db
ceb22d
206d75
756d65726963616c
70726f64
20696e207468652073616d6520
e79a
696d6d756e
204543
206869732077696665
29
205c20
20746865206167
61677265656d656e7473
696e2074686520636f6e74657874
20666f72207768696368
2043
54686572652069732061
20616c6c657267
706167652e
736861
20746865206c6177
4541
206e6577737061706572
4320696e
6e656c
20617320612062
206f627461696e65642066726f6d
2072657461696c
616c2045
2070617274
206869676820
6e65737320696e
20736b696e
286c
20726563657074
6572206d
6d732d
6164656e6f
20244c
20202020202020202020202020202028
2245
207365727669
537973
206861766520616e20
7265706f7369746f72
20616e792024
0a60
20746f75726973
6b2e20546865
742074686520656e64206f6620746865
636f6e7363696f7573
656420746f2061
576964676574
726567756c6174696f6e
4658
4f0a
0a0a54686520
7572736573
686f6f6b
30202020202020202020
2e2050617274
747261637473
353133
3e2c20
2e0a0a416e
0a233a20
6c6f2c
702e0a
70757368
20726570616972
616c7479
2070726f626c656d2c
206172652070
20696e203139
663d
20616476657273
4f6620636f75727365
6162696c69747920746f
20437572
616e766173
696f6c6f676963
706169726564
2e20466f722061
5628
2068616420616e
6e7d7b
6420e28093
6465725f
207465726d
6974792c20616e64
20656c73657768657265
312e204c657420
6c7920666f72
227d
20616e64206265
617420776173
5720
73747564696f
0a0a4869
546f74616c
646973706c617973
2070726f78696d
b220
2066697273742074696d65
746f74616c
4865
6b2c20
205c3e
20737563
352c2031
64656372656173696e67
2e222022546865
2020202022
792e2041
207b0a0a
28290a20
20616c736f20696e
2066756e6374696f6e616c
2e3a
746f6e73
206f6e2046
6f77736b69
206f627461696e2061
20746869732074
2076617363756c6172
4571
20746865204465706172746d656e74
206d6f74696f6e20666f72
7320627920
20686f757365
2077696e65
204c61626f72
343734
20416d6572696361
78706563746174696f6e
207b2353656331
696e64696e67206f66
696c61
3b207d
41667465722061
0a0a55
73207468652073616d65
20746865207761746572
20e280932069
646570656e64
206265636f6d657320
6e6f742073757265
726573746f7265
6d6520666f72
74732e20546865
2077617320706572666f726d
0a20205c
616e642049
486172726973
6c61726765737420
63746572
7b56
5d2e2054
7465726d69
2054726164
61696e20696e
65636f
206d69737369
6e6469
4e6f76
667275
6f72726f
486f77657665722c20696e
66616d
642d31
69746564
706f6c
7065722e
207265736f7572636573
65616c
702d3e
415254
206d69642d
20726172656c79
2074686520696e
47656e
6c792e2049
20756e6365727461696e
205965
43617365
6520686164
616765
2070617374
202870
7d2f
5649
202830
776e657273686970
2074726962
2070726f7065727479
2061727469
2e0a0a4261
20696e206f6e6520
20656c656d656e7420
6420736179
53657074656d626572
757270726973696e67
2d7469
206f66206f6e
446f75626c
302e3120
6c656420746f20746865
6c792065
75726174696f6e
20706c61736d
6d6952
2e4c2e
312020
5d2866
6f72207468656972
616c6572
69657261726368
2077696c6c207365
4f706572
65722070
312f31
6e672e
2c207468616e6b
456173
20706c6174
6f2043
204b6579
6464696e67
32202b
6167696e67
6162696c69747920
5c6c6e
65642069
72616e676520
20746f206d69
6c6965
66696e69746520
206573636170
207b2072657475726e
20436976696c
20747279696e6720746f20
756e64657273746f6f64
2074686520636f756e74
2077617320706572666f726d6564
70652e
746f6d6963
732061206e6577
2532
6f3e
682e222022
637469766974696573
726f74656374696f6e
203b
616e6365206f66
696e677320696e
6572746f
313633
5d2c205b40
2c72
20726f626265
70617469656e74
206769766520796f75
0d0a2020202020202020202020202020
20696e746572616374696f6e
20696d70726f76656420
75746573
3f205468
696e672c20627574
77652068617665202424
70686f72
74696f6e732c
203138
4c6f636174696f6e
2e0a0a5365
20627574206865
6e616b65
206f6620726f
6267
20726164696174696f6e
20696e76657374696761746520746865
206e6575726f
5c6f74696d657320
29293b0a202020202020202020202020
3a2030
7265707265
70687020
6a7567
7468756d62
4d6f62696c
244e24
20656e67696e656572
206d6179206265
6f7320616e64
32305d
4b7261
73696465206f662074686520
732066
66204d
206c65616420746f20
2022696e
73206e6f74206f6e6c79
71756974
2031
20706c6179
7d0d0a
5c656e647b
20666f756e6420746f206265
722920
4368696e657365
29207b0a202020202020
2d6d61
2077697468696e2061
2e3835
20246624
0a636f6e
706f727473
616e63652c
31352e20
6d202b20
6f6c
206d656d6f7269
272e
206e6f772e20
3a0a0a54
616e646564
302e33
2068616e646c
6d6f6e65
206561726c7920
6f7669
42696e
6c6573736c79
456666656374
206e756d65726f7573
206f66207468652069
72732e
390a2020
303432
0d0a20202020202020
745f7b
6e7375
69722d
6974657261746f72
2074696d
797379
6f6e206c696e65
6d706f7274616e746c79
20736f20746865
20666173746572
2220746865
2063616c6c696e67
29207c
6f2c20
303a
4349
35362c
2074686572656f66
676e6974
7d7d
383329
2061726f756e642074686520776f726c
20245c70
6f722052
415348
2e0a0a536865
636172646961
636f7264616e6365
6c6f6e6720
6421
5c6d6174686672616b7b
207273
646566696369656e
61726e6564
0a0a322e20
496d6d
8020
41525241
2061206e6f74
6b6972
6f756e64206f66
20746865207374726f6e67
6f74696e67
5654
65676f
706f7265
6b2773
20436f2e
6167657320696e
27732043
206973206265696e67
3136
2072756e6e
5c706d20
33302e
616c79736973
206d616e69666f6c64
3570
636f6e74726f6c2e
20626c616e6b
4520
427566
6f7461
656173696e67
6472697665
69646f
6e666c
2074686174206f6620
6e41
66616374696f6e
2064616e676572
207761732070726f
696e207468652061726561
8c20
646f
646972
20202020202020202020202020202032
20706f7274696f6e206f6620746865
636f6e76
706572
20746f206272
7433
646564
206265696e6720746865
206973207468657265
73206f6620696e
4f47
75742c
56455253
206b69
456e756d
20696e2074686520696e
746520666f72
616665
2062656e656669
20616e642061736b
206578706563746564
2062696767657374
ce94
20736f6469756d
292043
697a6172
20636f6e63757272
6578706c61696e656420
2e6769
2064656c
6f6d6f72706869736d
20612074776f
657468796c
2066696c746572
457069
74657220666f72
290a090909
6c65766572
3d31
795e
697361626c6564
6573206f6e20746865
0a0a2020202020
66737d
20617363
2c20666f72206578616d706c65
20636f756c642062
20706174746572
4672616e636973636f
65616e696e67206f66
456e61626c
20766f6c74
2a292c
205c5c0a26
20636f6e736572766174
205461796c6f72
206b69636b
3a202e
206d6574616c
53686f756c64
4a616d6573
2049207265616c6c79
48696768
373b20
5250
766f7573
69736520746865
2079617264
3e0a2020202020
6368616e67652c
20746173
20616e6420696e746572
692063
696c6579
66666f7264
6e20686173
2054686579
20576179
5461626c
206f70657261
616374696f6e2e
63617263
666669726d6564
2c207468617420746865
63732e
20532e
652077657265
363132
686520
736574206f6620
6b6e
2e302e
663b
696e672c2061
4561737465726e20
6964656e6365
242020
5f6279
20657865637574
2067656e6572616c697a65
343435
657965
5f696e6465
20696e6469636174696f6e
69676874
2070686f7370686174
293b0a20207d0a0a
38206d
417070656c6c616e74
2073757267657279
32202020
20696e2043
2076617374
6574696e
206120626974206f66
206461792c
20666f7220646973
74686f7567682049
206372656174652061
2048
736f6e3a
35e28093
6478
20656c6576
2063656c656272617465
295d7b7d
732020
6a616d
206c657373207468616e
73702e
726f6d
4c69
20616e64206f7572
0a0a47
2e0a0ae2809c57
20646f20796f75
7f
c2a04d
73656c65637420
6c6569
6c757465
77616974
72652d
20746f2074686174
7320696e2024
2072657370656374
596561682c
2e0a0a20202020
2070726f63656564
5765206e656564
70686f
333633
726f6e61
5c6266
20612057
2073657420746865
707269
207069637475726573
792e20496e
2c20616e642070
2074686520636c
65676172646c657373206f66
204573
20656c656374696f6e73
757279
20736179
202020202020202020202020302e
206f66206120
207761732031
340a57686174206973
205269676874
20285b5461626c6520
206368726f6e696320
697374616e6365
652e676574
206973206f70
6f6e73657175656e74
6c652e
476c6f
2c206163636f7264696e67
207265706c616365
65642062792054
4134
727420616e64
6666656e73697665
73686573
22202257
333e
206f66207468696e67
536f20
703c
206f662066
6c22
67616d65
2073636174746572
20666f7220616e7920
2062757420
47656e65726174
20796f75206b6e6f77
4a61636f62
4c56
2e4d
2e2054686973206973
20636f656666696369656e7473
75706c6963617465
20696e206974
207365637265
0d0a202020
2c20616e642074686579
657374696d617465
73206e6577
5929
2e0a0a4d79
7420686973
206f6e20612073
617469766520
656d2d
757420696e746f
696e666c616d6d6174696f6e
616c662061
202020202020202020205c
2920746f20
50617261
20612031
6164652c
20697320707265
34297b7265662d747970653d22666967
206e65757472
206661696c7572
6f6574
5f7072
2074686520696e66
207468652034
2057415252414e54494553
5c44
6d706f72
e280997320616e
2e0a20202020202a
30202020
20657874656e73696f6e
732e0a
2070726f766973696f6e
20696e20536563
65722c2077686f
696563
496d706f7274
436f6e6e656374696f6e
6f6e73656e737573
657175656e6365
656e65666974
330a2020
727920666f72
35342c
3931
20746f20656e64
616974
65676973747279
206561726e6564
202b2b
6572204a
343029
6f736974
4173736f63696174696f6e
24206173
65642062792044
616e616e
76657261
2e3034
677569
20616e642073616964
204920736565
5c626567696e7b61727261797d7b
656d65
2d6d616e
2063617265
313530
20706f74
6973206f766572
6e203d20
6d65737361676520
3a29
2070686f7370686f72
5c64656c746120
2073657269657320
20416e67656c
20646566656e73
7374207265
6d616c69
2070726f62
2c204b61
207468652077696e
206469646ee28099
28612928
616e6e79
0a20204d
226964
20746869732063617365
6d6964
27293b
3a2068
0a2e
204b72
20737563682061
566964
20617274657279
2061776179
65766572616765
20746f206c6561726e
2e0a0a4865
206f66204e
2050656e6e73796c76616e6961
4347
207468652073697a65206f66
23232323232323232323232323232323
2063616c6962
7b5c66726163
20776572652068
202020202a2a
696f6e732e0a0a
61696c757265
4a616e756172792032
6f2064
6520616c736f
452041
286368
2069662074686520
0a79
7068697d
207761732077
617465642077697468
506174726963
20536f6e
0a0a4865
6172697a6564
6d2028
34392e
646120
702c20
2070656f706c6520
7320746f207265
2074686520636f6465
61747461
2063697263756d7374616e636573
2c2063616c6c
3c42
2e43
2c20616e642074686174
2e22202249
2e0a0a5265
656e6572
206c6576656c2e20
207468652074696d65206f66
20476c
6c616e6574
613a
2041726d
0a416e79
79
207c202a2a
29207b0a2020202020
20466572
636f6e73
206d757475616c
65676572
76656374
67732c
732065787072657373
70746f6e
72616262
6f6d6d65726369616c
204920676f
616c6c6574
204c697374
3b2020
293b0a2020202020202020
223a2022
6f7461746f
786961
9d
7b7a
4465636c
72202b20
20616e74696369706174
636c7562
2073686f636b
73756368206173
206f720a
617262
617a65
20696e206173
73206c697374
204946
20726563757272656e
3a6c61
6261636b73
20666f6c6c6f77696e67
65772c
36392c
67687468
546865206f74686572
7450
20507261
2072656d61726b61626c
636f6e6f6d6963
2074686520627573696e657373
206f72206279
20696e666f726d
2e20447572696e67
696e67206f72646572
20636976696c69
202d203132
3320616e6420
656420756e74696c
74682043
70696374757265
20617474656e6465
756e64696e67
2d3034
796365
37352e
292e20537570706f736520
70207570
666569
62696b65
616e6e69
20737461746973746963
61676e
785f32
746865206f62736572766564
6174696f6e20696e20
72616e7369656e74
2028756e
20616e64206f66
203c2030
6f6d657273
20706f6c6172
5370616e
77656c
39302c
0a0a56
33202b2032
49206469646e2774
2074686520666f6f
72616e676564
6976657320696e
20766f6963
20466163746f72
732066726f6d2061
20c2b120302e
c3a2
206b696e617365
2c206269
2062656172696e67
6469736b
597d
20736179732c
6972
353030
6547
b8
6b6574
aa
6e696e6720
6d7020
20746172
2074686520736f757468
726520746f
652024
73696e63652031
20616273
2e0a416e
20686f6c64696e67
203c3c20
343331
303335
6c6d65
6d65732c
656e20696e
524e4120
206f66206865616c7468
20636f6d70656c
20686173206265636f6d65
3c6120636c6173733d22
7065746974697665
20616374697669746965
7674
2053696d70
5d5c5d2e0a0a
31297b7265662d747970653d22
6e617263
0a302e
312068
282d3329
20746865206576
20756e61
727420
4964656e74696669
206e65636573736974
b0
20536572766963
7175616c
6f6f6473
7d5c72696768742920
6e79776179
5c43
66662d
6465707468
e4ba
6e
79696e672c
736577
6f6c61746564
656c6c
48545450
20302e3030
626f7265
79657273
6970756c6174696f6e
717d
4761
2076656c6f636974
6c696e6520
706563
2d3e66
696e672c
2067726f75702c20
2074686520646576656c6f706d656e74
5468652066616374
09090909090909090909
20736964652c
206120636f6e7374616e74
2e0a0a436f6e
64657269
2e2041732073
647563656420746865
73656d
206f662074686520666f726d
6d756c7469
0d0a0d0a
290a202020202020202020
20746f20707574
5c7468657461
696c6c6f
616c63756c6174656420
6e676c
652e672e2c
73617469736669
7175
2c20616e642073
20636c69636b
20736174697366696564
287371727428
22293b
2063616e646964617465
204141
2c20436c
20696e6a7572
352e35
504c45
0a5768696c65
67656e2d
6344
504253
636f6c6f67
637269
20290a
616e642c20746865
69646520696e
5d3b20
2074686520616e616c79736973
206973206c696b656c79
20746f6765746865722c
313936
88
2063726561746573
d182
292077617320
20436f6e74
293b0a0a202020202020202020202020
2077697468206d6f
6c617665
206865726f
617461
207468657265666f7265
44796e616d
20616e64206261
7271
4368616e67
5468616e6b7320
6f7261626c65
2076657273
20244b
20636869636b
2c2d31
6963652074686174
7065726f78
206d697374616b65
2073616c69
2070726f76696465732061
20287468
20416464
3b0a202020207d
72656c6967696f7573
325c7069
2061626f76652074686520
6e6f76
6e68696269746f72
245c
53545f
7072616374696365
20657865637574697665
20636f6c6c656765
2d3735
65740a
20636f736d
776f72746879
20776173206a757374
3c2f73
5c0a202020
70656564
20636f6d7072657373
5c6571756976
4072657475726e20
2068696d2061
30c2a0
6c69636f
43726564
207468726f756768206120
6c66
6e673d22
68656d6963616c
612045
292e205468657265
2e204974e28099
20416e616c797369
20696e20666176
656167
2074726f6f7073
73205c5b5b404352
7574686f72697479
657669
2a5b
333037
706c6564
20696e2046
53746570
20616e64206120
61626c792c
20436174686f6c6963
2e3c2f
6b20
646174652e
247b5c6d6174686262
69636f6e
375d
54686520636f757274
284d
6f70
206f6620796f757220
7078
20657868696269
5f6c65
746176
206d73
207374617465642074686174
756261
616c79746963
496e666f726d
766520686164
732e202a
2e2e2f2e2e2f2e2e2f2e2e2f2e2e2f
303130
206e6f646520
20737566666572696e67
646973706c6179
65642074686174206974
6f6973
4253
6d5c
3936
20283230
737375
7d2c20
315d3b
335d5c5d2e20
20696e666c
2c5c6c646f74732c
2c20796f7527
e2809332
204173
20636f6e747261
6f7220696e7374616e63652c
78202d
6465766963652e
74656e7420746f
20556e69766572736974792c
44656c6574
746879
696f6e2c20616e64
20245c6d61746863616c
656e7465726564
20636c6970
6e6f7365
2064696c75
4d656d6f
6f7274756e6174656c792c
72612d
0a0a4172
62736f6c757465
64696d656e73696f6e
207468617420617265
20616e642062
6f6368
6f6365
646f7365
65206f6e
616e67
5061727479
73207468
20612024
696e22
6b205c
486f73706974616c
2073696d696c617220746f20746865
7320746f20676574
68617264
20746865207472757468
6469766964
207468652066756e64
6461792e20
6d6d6564
696e76
20572e
2e204e6f74
204750
2249742773
747970
61732073756368
616c2063617365
2020203134
687269
28322920
696773
29200a
756265
6374696f6e
206174206c65617374206f6e65
2077617320676f696e6720746f
73207765726520706572666f726d6564
6275696c64696e672061
2074686520696e697469616c20
5f697465
38382e
3b0a20202020202020202020
6c6f766573
77696e64
65642061626f7665
2c204172
5f2a
2e204576657279
207468652070726f63657373
643e
657320617265
77656e
73207768696c65
2063616c63756c6174696f6e
206f722074776f
74656d706c617465
3831
20312c20
556e697465642053746174657320
20696e2028
656368616e6963616c20
20696e20746865207761
74656420746f
20447275
746f63
207465727269626c
3933
436976696c
61726c69616d656e74
636f6d6d697373696f6e
207472616e73666f726d6174696f6e
69737361
7320706f696e74
2752
414c45
3030206d
204c6561
61696c696e67
494e544552
20696e20746865207265
6c7461
732e20427574
20627574206974
2063617573696e67
20617320746f
2c2062656361757365
652c2073
7761792061
79656172
75696e7438
4a53
6c656e677468
696573206973
69635f
697373696f6e
92
20746f207468652070
696e6720696e746f
205355
20746865207061706572
20696e203138
6d206174
206d6170
53656520
2063616c6c696e6720
6e726f
3b0a20202020202020207d
204e61
20492077617320
442e0a
20736f63696f
617373616765
72617373
454e44
636f6e637572
416e20
7365722e
73207374696c6c
2c204c69
2d7475
61636520616e64
2074686573652074776f
206973206e6565646564
0a20202d
6866
74696d6572
62696c6c696f6e
20736c617665
206361736573206f6620
656e2d
2728
0a0a57686174
29202020202020202020202020
0a7b0a20202020
4849
20696e204c
6d61747269787d
20696e746572657374696e67
6f6d61696e
696420616e64
207468697320706f73
3b0a202020207d0a7d0a
35293b
20666f72206576657279
2d3830
656c6c2075
662053
732e20496e20746865
20746f207369
5220616e6420
6f6e6529
332920
20776520646f
675c
65206265
6f206c
2068656c7020746865
2076616c75
2074686520747265
206d656174
64202d20
696e204d
65737365
207374696c6c2061
2068696465
2057696c6c69
726e
6167652074686174
20332e
2e7375622e
6c65676974696d617465
6d756368
756d6e
702077697468
6d6265
206472696e6b696e67
6578706f73757265
20746879
20706f64
5365637572
20706c616e6e6564
20646f
75702e0a0a
7665722c20
2d2043
22202248
36352e
414c20
31393935
617374726f
36302d
74204e
22486f77
20245c73696d
20576174
6b696e6720696e
20616e64206269
2054686973206973
737d20
2c207769
73206f662052
7473206f6620746865
6f746174696f6e73
6d656e742c20616e64
626c6520
20776974682074
20697320616e20
74696e6374696f6e
495449
20706169
20245c6e
696e7473
5f3e
6630
732066726f6d20
444546
42617262
6f6e646f
2b2b29207b
20707261637469
2061732050
3122
20202020202020202020202020202053
203632
322e31
0a202020207075626c696320766f6964
6174696f6e206265747765656e
0a2020202023
204649472e20
206c61772c
20737570706f73656420746f
2032303032
2074686520646966666572656e6365
424a
0a74
756e6469
2053696e67
732d31322d30
737469747574
206d6f636b
20746f2070726f
6272616365
20627574207468657265
6d756c
73686520636f756c64
2d20
5d7b7d5d7b7d
2d7265
20322028
656365697665
202020202020202041
20776f756c642062
20636f6d6d656e
20696e207468652046
547261696e
6573740a
6572204d
737369616e
554e
65717569726564
2043616c69666f726e6961
305d3b
20666f7220612070
20616264
3a0a
6f78696465
2065617374
2066726f6d20746865206d
6f77656420746f
6f722063616e
20736179732c20
20616e206162
20353025
206d69522d
2073797374656d20696e
636f64696e67
5c7369676d6120
323435
e2889231
20746865204f
7320707265
65736961
207368696e
2074686520686f757365
523a20
20656d627279
20736d696c65
7278
2070726f626c656d206973
496e74657266616365
732e20536f6d65
2826
616e6479
656e6465
53657276696365
646567726164
323937
20616e6f7468657220
7175616c6966696564
68204b
5e3228
5c657073696c6f6e5f
36302c20
39382e
53696c
207363686564756c6564
245c656e647b646f63756d656e747d24
5753
0a092020
616e0a
205442
63696e
0a0a53696e6365
696e73756c61
5c5d2c2077
20666565646261636b
0a202020202020202020202020
2061726520616e
06
6f6c64696572
2064616d6167
636c61737320
206164617074
6d42
4a2e2c
206f6e20616e20
e2809c44
e6
2073636f72
427974
726163
202d31
2067726f
01
20776861742061
33325d
656d6f7465
335d2c
637265617365
206d6f64656c206f66
206361706163
7320636f6d
20746869732e
20686f6c
20636f756e74
657320696e746f
6e77
627920746865
636c6173736573
392c202d
6f7765726564
617973206f66
2074776f2073
20747269616c2c
5846
20626174
616ee2809973
204a757374
20436f
20706f6c6963696573
76656e64
20636c6f73
792070656f706c65
20312e33
7843
696e6720756e
656c2c
2a2a0a0a2a2a
20666f72207468652053
2074756e
766164
4156
206f63636173696f6e616c
73657473
6368656d6973747279
20696d6d756e697479
657420666f72
20626520636f6e
206174206f6e
20616e797468696e6720
5031
20636c6173736963616c
207765616c7468
2c20313937
20285365
6e69616e
2c20696620746865
6f6c6c61
20746f20736f
2c20496e632e20
6f79
0a0a2424
363338
4964656e74
6963
616e796f6e
6d6563
29242c
2061207365636f6e64
28293b0a202020
77617272616e74
6c7561
456475636174696f6e
207468652051
636361
20313037
61786973
65726970686572616c
206972
622a
6f726d616e
76696577206f6620746865
20736f6e
616e6420696e
20746f2062652073
20e6
2e3237
20616c74
7c0a202020
6766
6f6f6420696e
76696577
616c2077697468
206c616e6775
2223
20616e6420656e
2043687269737469616e
205c696e20
6d696e2e
c2ae
20697320612064
766169
2077686f20617265
227d20
4066
68656c70
205a
206f6e746f20746865
206669727374207374
66203d20
7d3d
2a2c20
0a20202020202020207d0a
207765656b73
696f20
393135
204950
20776f756c642067
2066616d696c792e
646f206973
72697474
6f736974697665
2076656e
726965
3029
2861
2054657374
20776572652066
766573746564
20416e616c79
207b2373656330
206f66204368
3c6c693e
335d29
29203d
20617373757265
737562736372696265
616d73
6d65616e
696e672075
6c2041
206369726375697420
206f66207468652024
22646174
2061206c
6d2c20
20757375616c
205365
20616d706c
20636f6d7061
2e20546f
646f7473
65207369
7b0d0a09
4b656e6e65
6e2074
2068696d
6f67656e6f7573
65786974
20486f757365
206465746169
73656375726564
534953
736972
20636f6e636572
734f
20737072696e67
4f525f
206173206d756368
656d6d
206a75646765
63657373697665
33362c
206c696e656172
79206265636f6d65
20646973747269627574696f6e20
20746865206d656368616e
2070726f746f636f6c
2a5d7b7d2c20
202841
2c207468652066
792063617365
796f756e67
342e0a0a
706f737369626c7920
5424
756361
3a323031
75706c6f6164
206465616c2077697468
3244
2073746f72616765
20526179
732020202020
75732063
206571
20536f667477617265
c390
5458
6b6520
30303131
e2809973207265
6c656374696f6e2e
2062617272696572
6174687d
5e62
20706572
206163686965766564
20636f756c642068617665
616d656c
0a546865206669727374
2064657363726962
206f66205265
205c6c
61727920616e64
20647574696573
2053657276
2020207b
353330
4576616c75
3e206f
7465787475
746f706963
2a61
7365742e
3a0a20
207072696d61
20696e2066616374
5f69
73652063617365
36332e
5c70695f
292c206f72
737320746865
6420726567696f6e
20636f6d706f6e656e
207468616e2069
270a0a27
205c5b5b40706f6e652e30
20657874726163746564
69746520
6c7573697665
2069732070726f
3024
626f
2073746179
4875
0a57
2c203432
646479
206f6620616c6c20
2b2b20
6e64656e
6965732e0a0a
6b2f
20616d696e6f2061636964
732077696c6c
6c6c696573
204d61792031
206164686572
65722073
2061726520636f
692e652e
2020202020202020616e64726f69643a
303738
74292c
6520646973
6720746f
2076697275
2064726167
6d732e
506c6179
5b40435232
7564696e
757020696e20746865
29293b0a0a
63652069
7d0a2020202020202020202020
616c6b73
546f75
792073686f756c64
656c6c6f77
6765206f66
7461696e
2063656e74
20245c6d6174686266
732c207468656e
2061726f
6865207265
472e20
205341
73206f662053
726f6c6c6572
7175617274657273
206d6f6e74682c
66616972
205570
65726d696e616c
2e20417420
6f6e6520666f72
20617262697472617279
7574
206c617465722c
e28085
20616c657274
20726967687473
206f66206d7920
7265736f72
61722077697468
2d6d6f
776973652c
206e6f206d6174746572
2068616420746865
20c2b120
53544152
206170
20636f6e74696e75657320746f
756e6578706563746564
09696e74
6c696e6564
20636172656572
207420
636561
736f6c7574696f6e
63616c20
333330
206c6f77
206879706f74686573
205b2a2a
524545
207768696c
2073796e64726f6d
20616e6e75616c
207363656e6172696f
5f
206f66205468
736f6c7562
65616d2c
67657453
73204e
49
245c78
75746520746865
53796e
616e7420746f
6964697479
6520686572
206f66206861
742026
72697a
617263656c
20686173206265656e2061
2077727420
20696e20697473
e1bb
616e746c79
323739
73746f72
7920676574
204e6f6e
2741
2056656e
616c6c7920746f
50756c
207a65726f
6f6d6564
2e302028
7374617475
3a2067
726f6b
20626520746865206669727374
6e206f
706c696564
6865726520617265206d616e79
415448
20616e642077696c6c
20617320696e20
73202424
20647572
706e
2a53
65642070726f7465696e
65737420
206d657373616765
2070656f706c652c
206561737920746f
0a27
696e6720616e64
0a0a35
2c2066616c7365
2061732077656c6c
6e6964
732035
207269736b73
206f7363696c6c6174
412e2c
206865722068
4f45
5251
206b65657073
2067656e75696e65
2070757420
6d6f72652070726f
636f6e737472756374
6d697473
626163
73206f6e2074686520
24705f
203220
657374732e
647a
616e2d
393525204349
2e
2077696e646f7773
29207b0a
20796f752073
67657445
6965732c20
20746865206572726f72
2f6b
4443
6d757465
207c20
7b71
2070726f706f73
206e756d62657273206f66
73202850
343136
73746174696320696e
65726963
73207465616d
697320666f756e64
532043
83c3
6e6f772e222022
616e646f6d
2074686573
547261636b
6e656e74
627573696e657373
20426f77
20532e43742e2031
20697320616c6c
20776861742074686520
696e677320617265
636f6d6d6f6e206d756c7469706c65
206f6e2068
2e0a0a20
207768696368206865
20646f7a656e
790a
2061732070726f
5252
65206e6f
207265636f7665726564
2046756c6c
4420616e6420
496e7075
20617761792e
732063616c6c
732c206974
537573
732077686574686572
206f6e20686572
206163636f756e
2074617065
20776173206f6e65
636b206973
20284669672ec2a05b
746572
554e43
206d616e79206f74686572
642c20746865
742070726573656e74
2c204265
2062656175746966756c
6c6d6f7374
73616c65
696e6720746f
20544845
2c2077652068617665
6e646572
20536563726574
61707065616c
726f6d697365
652e2049
6c6565
746865722773
4c697374656e6572
5c626567696e7b616c69676e65647d0a
66726163
353032
d0bd
456e7472
3c2f74643e0a2020
5c72696768745c
676873
20666f72206469
20205765
20656e7472
0a0a497420776173
7875
3c44
2e204372
323333
68656c6c
75732e
2044656c
207468617420616c6c6f77
6b67
2d312f
5f46
bd
280a20202020
377d0a
7070656c6c6565
227d2c20
452e20
3f0a30
2443
0a0a5768656e
73206d6179
0a56
617264
204920757365
642f
677572
20746f20646f206974
206e6578
206461792e
616e696d
2020203132
207b0a202020
6963756c747572616c
637572
736574746c6564
20656475636174696f6e
2064697374
4f29
206561726e696e67
206361727279
20746865206d
20616e64206974
0a0a22546865
686f76
6d696e6973
6c697461
3e0a20202020202020203c2f
2c2073756368
2e2220225765
636964
6f6d616368
20746f20617474
5c2020202020202020202020
207477656e7479
4261736564
224e
204f7267616e
36202831
6e2069
7b327d
2048617264
206578636974
61726d73
6574206f6e
204e657874
2073746f6e65
7b737d
48657265206973
474552
20666f72676574
3b22
466967757265
20736c696768746c79
302e3032
206d6f7265207468616e
207461726765746564
6c792077697468
636f6e64756374
69732053
20466f7572
2a2a
6f6e7469
28782c79
20616e6420757365
20746865207468696e67
2074616b
2077616974696e6720666f72
2d696d
20556e69746564205374617465732076
6972636c65
747261646974696f6e616c
2f3e
7665206f66
6c79206c61726765
736869656c64
7d0a2d2d2d2d2d2d2d2d2d
696e7465
2070726f6365737365
6475
696e6720686f
696e652061
5f4341
20626520646973
446570656e64
6574656374696f6e
206f6e204a
756c61746f7279
4472
3729202020
496e207468652063617365
20627261
206f6620666f6f
0a766f6964
6238
6c656374726f6e696320
77617920
2e2220224e6f
655e
20616972
65766964656e6365
2e41
616c28
204d696c
74726174
28293b0a0a2020
76202d
20776f726c642c
206261636b
7a6970
506f72
626c6f636b696e67
53686f7274
7365206d
656e746f
7920796f7572
3e0a20202020202020202020
6c756d696e
204472
69747920746f
6d656e742e
20736f207468617420
0d0a0d0a2020202020202020
66696c6c6564
2e0a5468652070
20436c61
73206f662047
695e
2072756e20
3e0a202020202020202020202020
20247b5c6d61746863616c
2061206d
73686970206265747765656e
63757474
20746865207365
206e6f746564
677265656e
657073
756c61746520746865
2d332e
207468652066726565
2063616d707573
41726773
502f
5d204c6574
20646f6573206e6f7420
65726365
2062792074686520
2077726f7465
672f6b67
20636f6d707574
20696e20736f
5f3124
207374756479696e67
20706167
204177617264
207965617273
617373657274
5d0a
20313934
646966
20646976657273697479
7c0a7c
72696767
4f
4e6f
206f6e6520746f
20616e6420617070
65737473
0a3137
776179732c
20536369656e6365
20332e31
206b696e64206f6620
0a0a5468657265206973
732e20416e
20323030
20696e20686973
206f6620626f7468
2420202020202020202020202020
38202b
20202020202020202020202020202034
696e672070726f6772616d
343939
2074686520696e7465726163
7061636b61676573
6f756e642e
617068
742d3e
416d
70686f74
657665
2c2066696c
6b7261
2074686520636170
61726c6f
5f7b696a
322d30
6372656174697665
302e30303031
220a202020202020202020202020
303836
3070783b
646a7573746d656e74
726174
20776869636820776f756c64
2e2055
656420636172
6570656e64656e6379
6f676e697469766520
2042617474
20626f746820746865
206e656172
7320747279696e6720746f
2e0a0a4765
4672656e636820
646f637472696e
74756974
2d2d2d20
207468656d73656c76657320
322d2d
6c696e64
646967657374
736869702c
735f69
76696374696d
4d6f726520
783a20
2773206e6f74
207669727475616c
506572
696e672e0a0a
202a63
616e74732c
20666574
20617574686f726974696573
20507269
79207374617274
747564656e7473
69667920
206f6620666f72
7443
666f726d6564206279
0a6d
6174696f6e29
65722063
792070
5d290a
2070617469656e
20616666616972
33312c20
6574616c
2069732073
2e20546865206f
6c696e67
68617473
30352c
3b20627574
766f696420
7920776f
7244
4743
6172796c
2c20666972
416c6578
206f66206172
7720
20666f6c646572
2064697363757373696f6e
6f62
2d6e6f
5c6c6566745b
206f6e2043
537d
4c4520
20746865206f7574
20746865206d6f7265
4753
66696e697479
7465787473
732e0a0a44
204c696665
696e62
666f6c
393436
20213d206e756c6c29
6579
2c2037
6869726420
7273
2a2a0a0a
20736f2069
65642067656e65
657261746564
206d616465206f66
20696e20612063
737469747574696f6e
206f75722066
30732c
2062652068
345d29
2074616b652069
5472757374
206d6963726f6269
792c2074
2073637265
0a2a
616e6b73
27732072
2d636861
0a596f75
20646966666963756c7479
36372c
6963682c
6574e2809973
206f662077686f
20776173206865
20666f637573
362e39
73696e6720746865
323239
2073756363656564
6e2077697468
676e6f7265
43686572
20202020202020202031
79656e
6e65742f
2020202033
61732c20
6d616e69
506169
7220626f6479
6f20686173
20626f72
2a20696e
2e204f6e6520
20616e64206272
20776173206d6f7265
206f757473696465206f66
6e75747269656e74
696e672074686174
626563
0a2d2d2d2d2d2d2d2d2d
5347
73293b
205042
7b5c6f70657261746f726e616d65
756273746974757465
20746865206c6573
636174696f6e206f6620746865
206d6f7265207468616e2061
732c2062757420746865
78616d
666f722028
6f74746572
5c7665637b
206d617272696564
4e616d
4974616c69616e
20736b6970
20616476656e747572
5465
54686520666f6c6c6f77696e67
2c2020
20696e20436f
6f756e7428
2020202020202020202020202024
7468696e672061626f7574
207468
20746573746966696564
efbc8c
20e2809420616e64
2053636f
7b41
7920756e646572
70706f7274756e6974696573
2077657265206d61
642048
4272617a696c
617070656c6c616e74
205573696e67
746573742c
6279746573
6337
206163636f7264696e67
4e616d653d22
206170706c69656420746f
616d6520666f72
696c6963
2d2d2d2d2d2d2d2d2d2d2d0a0a546865
69726561726d
4428
20616e796d6f7265
6720776173
77686574686572206974
20466f726365
69676e65
2073686f
207468617420646f6573
207468617420666f72
6c792e0a
6f726465726564
646520746865
20697421
6865726527732061
6f206e6f74
6569676874
3030302d
203032
72616e6368
617272616e67
70686572
202a204072657475726e
7124
66696c6d
656e6369
2e20546865206578
206e6f74696669
292026
656c66
656d20
342e0a
2e0a4d
747269616c
4d616e
20447572
6720616e64
20202041
52617465
207374616e6461726473
5f7061
72616475617465
732c20726573706563746976656c79
20776f726c64
61676529
6e73
506c6174666f726d
73206f7220746865
3639
2e204e6f
2c206e6f72
732075736564
be20
62203d
436f6465
6f727469
373139
656e7420616e64
2031393931
647573
2077686963682069732061
2077696c6c696e6720746f
6179206973
656e74726f70
20636f76657273
6f6e2052
6c6f616473
676f6c
2d2d2d2d2d2d2d2d0a0a57
2077617320666f72
206a6f6220
2061206c69676874
6f72207468726565
6e7175697279
206265666f72652069
436f6e74726f6c6c
747570
206e657574726f
6c616465
6f6e6e61
30202b20
2064697370657273
39e28093
292e2043
3c2f737472696e67
6c6567656e64
205468652044
206f6e20686f77
5f746f
6d6174726978
206576656e206966
22202241
5072
0a7b0a2020
736563
6174696f6e
5e5b404352
e4
73656c662061
3c6c
206f6e636520
20696e206865
6620796f752077616e7420746f
0a0a4162
206772617373
202274
63726170
20617869
6f7574207468656972
746563686e6963
2070726f746563746564
74726163746f72
74656e2c
203d2046
65727661
612073
616e6b
2076657373656c
206b696c
20616e6420696e20746865
20492073686f756c64
2061726775652074686174
332c
697665
466f72
20616e6420736d
657220616e64
342f31
207072696e
206f72206173
2a2a322a
65646572
2065787065727473
7878
20616674
20746f207368
6f77206d756368
302c302c30
5e5e
206e65656420746f206265
772028
6162696c69747920746f20
756e646f
204c6f63616c
206d61792062652061
206361746368
730a0a54
6f73696e
696320
20747269616e67
7469746c6564
7461736b
207072696d617269
2d74
746f206265
736361
206d69524e41
645f
2066726f
73202b
526571756573
20746f2042
5c6e
292e0a0a
7061727475
456e7669726f6e6d656e74
635f
204665627275617279
69746963
206d6978696e67
6973656e
6b24
3920202020
206120636f6d70
2072656d6f7665
6f32
2072656c6967696f6e
6b646f776e
e8ae
742e22
206578706572
526567756c
20636974
616e2e0a0a
20726573706f6e64
617465206974
656e7a61
20686176652067
2a2c
7175616e74
492077616e74656420746f
656e68
6e692c
686561
2070726f6a6563
61696e65
2073757266616365206f66
72656672657368
20736c6f74
20666f726d657220
65207468656972
20746f2068656172
7365636f6e
2c207965
29207b0a09090909
2e20496e20636f6e7472617374
20646964206e6f7420
69616c2c
327d20
732e2045
636b2d
20726f
303233
746f6c
4854
310a
2070617469656e74
20726573756c7473
74696564
5c2020202020202020
73206f662063
4361636865
3c6c696e
206d652e222022
626f6172
206669656c64206f66
792ce2809d
2072656c617469766520746f
6d5d
203432
77656174686572
20616d6f756e7473
204c6f
206c6574
732c2070
206f662068657220
206d6972726f72
0a0a4f7572
282d
6261736564206f6e
7077
4041
6f6d706c61696e74
2074686f75676874
726768
2e20496e206164646974696f6e
616c206368616e6765
206973206f6e
207370696e
2072756e73
2c20686f7765766572
20746f20726564756365
20707265666572
2043656e746572
64206c
244b
20436f6d6d756e
20706f736974696f6e73
657479
7261746520616e64
6520776f756c64
0d0a0d
726f6e676c79
696e672043
206d616b696e672061
6b49
20776572652061
5432
667420616e64
20726567696d65
20657420616c2e2c205b
69737375
2074686520706c6179
20646f2c
5468650a
204442
756767657374696f6e
6173656c696e65
5c5d2e20
204b696d
6275727374
206c6f63616c697a
2c20e28093
656365
20636f6e766963
2074686520737472756374757265
617320746865
6f6e6520
7b6e
2072616365
5b302e
20696e6e6f63
6520436f
207369636b
2e46
687474703a2f2f777777
69786564
0a54686973
626f6f6b20
7574636f6d65
7175617265
207075727375616e7420746f
2063686172616374657273
442e
20666f756e642061
73206c61
20646973617070656172
697a
2c20726174686572
206f75742077697468
287929
646566696e697465
6761
2745
37372e
2e204920646f6e2774
3324
61726365
7920616e64
63686f73
626f61726473
207468652072656c6174697665
4947
2e204d6f7374
7061746f
6f73746c79
656d626572
416e746f6e
6174652e
2e222053
20646967
0a0a4e6f74
546865206f6e6c79
7665732c
706c696369746c79
20436c696e6963
207669657773
696474683d22
54726163
202442
287375
20696e74
676f6f676c
5562
206120737472
696365206f66
383530
617567
6554
69636b73
2c2077652077696c6c
20313530
207c0a
6e74696f786964616e74
526f756e64
65726961
6173206974
69726520
20616e6420616c
383830
75626c69
20776974682064
20636f6e7374697475
2c20776869636820686173
2d70726f
20746f2048
6572676963
616e6b727570746379
202d2038
20454e
20636f6e747269627574696f6e
20736f6c7574696f6e73
64657369676e6564
6374696f6e2032
204a756467
78706563746564
206f626c69676174696f6e
73616d
7d5f30
6f2d
20c297
6f727468
2e3538
0a5c6c6162656c7b6571
733b
204927
2d6a
20697320676f696e67
6e697469616c697a65
756374696f6e
65722069
2077697468696e
66697368
2061637469766174696f6e206f66
20796f752e
2e204920776f756c64
20736e6170
6672657175656e637920
206368657374
20756e6465727374616e6420746865
736820746865
4447
746872
0a666f72
4148
2c2027
6f7764
6c6976
5b405232
726f78
20706172616d6574657220
617679
20707269766174
206f7267616e697a
6349
6e746572616374
343430
2064697368
72726564
737472696e6773
2050726f6a656374
206e75636c6569
766974
3c6c693e3c6120687265663d22
20696e666f726d6174696f6e206f6e
7069636b
20e2809c
616c6c20666f72
6573706f6e64656e74
2074686520656e
20636f756c642073
2074617374
6c61707365
343133
2067657420796f75
20686173207265
636973
20746573746966
2074686520796f756e67
3463
2a2a32
2c3078
207768696c6520
323833
20746865204d61
2068656174
206973206d616465
20746f6d6f72726f77
20646566656e64616e7473
766d
0a73
74696320
2e20617420
5b404236
656e6469
20202020202020202020202042
732d30392d3030
2077616e7420746f2067
6d696e61
7369676e69666963616e74
207265736f6c766564
576f72
612044
207468617420686173
2e2e0a
20697420746f20
4675
737572696e67
2e5265
2d6269
657220746865
206f66206d6f
204d696e69737472
292054
0a0a3a
6e7374616c6c6174696f6e
206265747765656e2031
206d6174746572206f6620
662822
73706f6e736f72
0a0a54
642074686973
6d7367
637475
652c22
2061626f76
2020202020202020202020205f
393620
666c75
7562736372696265
20667573
666666
20686973746f
20466f7220696e7374616e6365
73206c6f77
61786573
303534
2e5468
20776f756c642073
6e79
20696e6372656173696e67
4c54
65697468657220746865
29207b
616c6c69
206e616d6520
7243
2e3334
770a
2074686520726573756c7473206f66
2c20636f6d70
7761792e
206f70706f73656420746f
617820
524154
436f6d6d657263
2e3738
382d31
626179
68616e646c65
5820
20616e6420636861
207769746820746865
2d322c
20657175616c6c79
2920636f6e7374
68616f
285c746175
6e206578
69642f
6572277320
652e0a0a546865
202d20746865
20696e666f726d6174696f6e2e
73206172652073
616c7469
2a205f
73636f7065206f66
6c6f6767696e67
292c2031
6227
303620
2073776f72
7461696c6564
736f6e2773
322e39
676f2c
20776865746865722061
61727279
6865616c
2073746172746564
772e20
66746572
6d657472696320
206c6576656c2c
20636173
737d24
20637265646974
20666f722031
20646964
2064
2074686579
65642e2053
20312e38
2073616964
696669636174696f6e73
206f75746c
7320696e746f2061
2068656d
353b20
322f33
70616e637265
20617420616e
552e532e205061742e204e
20496e636c756465
200a2020202020
20616d706c696669
2050726f647563
6e6f73
206f662032
696732
20646966666572656e636520696e
732c206973
696e6720626f7468
e28099732067
73206f660a
20746865206f6666
2074686520636c6f7365
2074726561746d656e7420
206120726563656e74
353b
6861646f
2061742053
642061
65696768746564
67203d20
2054686f6d
6f6e2043
f5
7320746865206669727374
20736f6d656f6e652077686f
416972
54595045
6c766572
207761732072
564552
7220667269656e64
20746865206e6174696f6e616c
2067656e
75203d20
6261746368
796120
206f7220756e
2a0a202a2054
6c657869626c65
09090972657475726e20
20617320706f737369626c65
206c6172676572
332c20
2d7368
206f6e206f7572
646469
206265207365656e
29207b0d0a
20566f6c
75737461
7d2e242420
616964
2020616e64
7a6d
20556e69746564
0a0a50726f
2048616d696c746f6e
206c696b
20424c
6c6176
353530
7479706963616c6c7920
333133
785e7b
20636f6e766572
0a0a2020202040
636f6c6f6e
223b0a2020202020202020
0a20202020202020202020202065
7050
33202020202020
73636861
20736d696c
73696c69
20726567697374726174696f6e
7b36
7265736574
2a2067656e
0a300a
7363616c
69656e73
6e697469616c6c79
207468652068616e64
2068696d20
206e6f64
2c207768656e20746865
20696e74657276656e
696e2077697468
27732068
2077696c6c20636f
74696e6720
20746865206865616c7468
31393834
732c204c
6f636b28
6c6c6579
2c205465
2045787072657373
207769746820616e20
4130
414d50
0a68
2046756e64
6f6e617279
57686f
5c5b70
20686f74
2c20697420776173
732c206f72
594f55
696e20416d6572696361
20636f6e7461696e696e6720
642773
6571756976616c656e74
53696d696c61726c792c
20536f6c
205c6c6566742820
532053
64727567
206469736b
206173207765
2074686520646566656e64616e74
2068617320616c7265616479
203d2030
206d616465206279
2064697365617365
382020202020
656572696e67
207573656420666f72
6f2077697468
74657269616c
206279204e
82c382c283c383c283
20536f72
2c20776527
747c
72796c
6f72616e6765
35206d696e75746573
5f66696c
20707265747479
20706f696e7473
35382c
2d2f
2074776f2d
6364
7327
30312c20
6e737472756d656e74
207468652073657665
3e206c
706f736564
69746c
0a61
2053656374696f6e
546178
636f6d706574697469766520
7420676f
20646164
e588
3d27
3c43
202461
696e67207761
6173206265696e67
72696e64
206469766964
6832
2c206265696e67
7e29
6e2061677265656d656e74
747269616e676c65
206c69666574696d65
333038
206c6f6e672d
20594f
6172642d
69656c64
642047
72656d61
206d656368616e6963616c
5d2c205b4042
66696775726564
2320
616e6473206f66
65732068617665206265656e
20616c676f72697468
20636c6f74686573
7465722c
616775
656573
206c6f6f6b6564
2074686973207061706572
6a6120
6f6e206279
697420696e
6e656174
7320616e642041
206d653f
207365656d73
206f6464
696e20496e646961
20284a
6c6c696e
2c207b
6e2c20616e64
5020616e64
792077697468
6e203d
206461797320
43616e616469616e
7320746f6f
73206f66204c
3d2272
5365766572
2062656c6c
2474686973
206865e2809973
205c5b5b40706f6e652e3031
202d2037
343330
70616365206f66
3363
4b2d
20696e64696361746f72
2066726f6d2067
20202020202020203230
20647520
6d2a
2062652067
746f5f
2c2063616e
6e7461
2073616c6573
20706c616365
207468697320736561736f6e
72616c697a6564
696e67e2809d
20686164206e6f74
206f66666963657273
2065786861757374
4553
5f327d
6d656173757265
2e2020202020202020202020202020
7b7570
206d6f72652061
2031303025
207768696368207765
20796f752073686f756c64
207475
7d24242077686572652024
626c6528
206d61726b6564
207265616c6c7920
20746f20686572
333337
20736f2074
534544
747874
5c74696c6465
320a20
20756e65
20696e6865726974
2c20302c2030
627365727661626c65
3a61
2e20492068617665
6d616e75616c
2074686520556e69
20746f206372656174652061
206120676976656e
696d6974
20646174
20697320746f206265
455448
20696e666c75656e6365206f66
3439
2c2035
736372
636c757369766520
616c204c
2e6e6f
20696e20707269
616d6261
20486f74
2061732077656c6c20617320746865
2066696768
23646566696e65
6520696e746f
656c65
474154
204c6963656e736520
20636f6e74696e756573
64656c61796564
20636f7265
20776f726b696e672077697468
2073686f756c642061
796520
6174696f6e73
20496e746567
494420
20636f6e76696e6365
20646f65
5b28
222c20
656e2064
72656520
494e53
616c72
6578706f727420
546f6f
61636865
207b0a2020202020202020202020
65726368
20496e73
206665656c696e6773
204a756c792031
69676e6d656e74
72650a0a
79206e
6b7d7d
2069732070726573656e74
4c6f63616c
29206f66
4473
2073657420746f
5343
782061
707570
20612074
0a0a2323232323
20666f722050
656869636c65
206f6620
70726f74656374697665
65642062656c6f77
20666f75727468
74696d652c
207061727365
722e2048
20696e207468652063617365206f66
7b2e
305d20
72656e6577
66696c652e0a0a
203d2064
455854
2048656e
454e54
20736574746c
204e6176
204d6174657269616c
6563686e69717565
20696d706c69636174696f6e73
6174696f6e2053
202b2033
20726567756c6174
616c205265
20616e79206f74686572
77726974652061
0a09090909090909
6167676564
7961
6b2d31
28707265
495f7b
292e204974
6672657175656e6379
6f74686572207468696e67
7365727665722e
2062616279
6d2074
72616b65
7474656e74
74206c
2e2220225368
726575
737320616e64
64206265656e
696e6720646973
0a2f2f2f
6f6469756d
6b2043
6c61696e746966662773
7473206f66
6d6172696e65
6f7474
223e0a20202020
3b2053
5c5d292e
206772616e
272c20
4920676f74
5d2e2054686973
7369646520746865
206d61746368
732070726f6261626c79
206d6178696d756d20
706c6f7473
363820
2020766172
7468696e67206c696b65
6d656e742e20
2068696d2e20
2061206c6f74206f6620
20696e204d61
65206173
2061726f756e6420746865
2767
2066756e6374696f6e7320
20617265206f66
5c656e647b6172726179
69727374
2e0a0a496620796f75
206974207761
6567616e
20636f6d7065746974
20636f6e73696465726174696f6e
5c6265746120
70686f6e65
2062656c6965
61732074686174
63616e6f
6f72732068617665
7468696e6720746f
220a202020202020202020
20203a
297b23
427920746865
203937
20736369656e7469737473
202d2061
636f63
3c75
2077696c6c2074616b65
202831
2c20746f20
617574686f72
697a65
206f662064
6f6368656d6963616c
65616e73
206f6666656e73697665
206c61626f72
6e64696361746f72
626f76
637279
6f7420616e64
20746865206c6f7373
322e37
2a2a5d7b7d2c20
2c204a61
697465206973
7b417d
7d5c5c0a
415f
20756e646572676f
3120202020202020
5329
7061636b61676520
2d46
68696c6c
2066756e6374696f
756d70696e67
3a3a
656e7472
0a2020202069
6d657265
70726f7879
2066726f6d2054
202020302e39
29203d2030
736564206279
20616e20656c65637472
d18c
20726566757365
2c6c
202447
6162736f6c757465
206f6620612063
612068
652c2053
616c6f6e
20e2809c66
20612067726f7570206f66
20616e6420636f6d70
203d20696e
22202259656168
204172697a
446967
616c20737472756374757265
616c29
797d
206974206f6e
73742050
20617661696c61626c6520
20616e6420686176
66756c20746f
205c72616e676c65
65696768626f72686f6f64
307d24
2d6f6c64
4c6174
20746865206261
2070617274696369706174
313538
73206f662054
6f7720616e64
3e3e3e
20696e207468697320636173
204461766964
6e646572736f6e
392020202020
20283136
652070617274
3c737472696e67
42726561
6973746f72
576861742773
4433
626561
205072657373
7070696e6573
35332d
5f7b696a7d
65617468
e280895c3ce28089
7373697374616e74
6174696f6e20617265
6f7728
65642e2054686973
20736f207468617420746865
70696c6f74
3425
736973
2d7361
20496e6469616e61
696d696e67
2072656761726420746f
0a66
5374796c
6d736769642022
20696e2072656c
206d616a6f7220
20646565706c79
4445
416e6420
32372c20
6d207570
757479
2061677265652077697468
0a3135
616d6d61
36292c
0a7075626c6963
20596f
6c697475
20472e
202773
4175737472616c69616e20
295c2c
7765696768
7827
2a2a5d7b7d20
20697320612073
726570726573656e74
20656e67696e65
20636f6c6c
546865736520617265
205041
2064656372656173
76656d656e74
20617574
287b7b
0a65
20736b696c6c
2920666f72
20415050
72696365
74756e
63617074757265
652032
646576656c6f706564
204d696b
6a5d
7472616e73706f7274
6172746e657273686970
0a3c6d
6172726179
20656974686572
20746865207072657373
20636f72726573706f6e64
2039
206e6577
6162696c697479206f6620
20657870657269656e63
31342e
2073686f756c64206e6f74
74206265
706978656c
206f75722073
70726f6f66
732e0a0a4e
7a6172
5d2c205b4062
6c792c20
2073686f77732074686520
c280
20776869636820697320
2066697273742c
7020746f
2061646a6163656e74
207468652057
31323a
7463
206120726f
3f0a36
207468652069
6f6e3b
73
35297b
61626f6c
65642c206974
20636f6d6d756e6974696573
206d75636820
526573706f6e64
637265
20726563656e746c79
206e756d62657273
6473
7b62
537469
622e20
3027
206368616e67696e67
726564656e7469616c
7669746174696f6e
206c656176
20436c
6c61756e6368
220a0a22
414249
6167652028
2062657474657220
6444
696e6728
67726964
61736520666f72
2c2049276d
35
6f6e76657267656e6365
203020302030
23646566696e6520
6f6c64206d
303431
727469
6d696465
0a202020202020202027
6176616c
5c6e222c
207265636f6d6d656e64
2e6e65742f
206265206e6f
20746865206e6f6e2d
722047
2070726f7465696e20
7b5c6d617468726d7b
20776f726b206f6e
2e220a0a546865
6d612c
206f6666657273
696f6e697374
70726f746563746564
20646174612d
666572656e6365
73207468652073
20796f75206861
20747261
0a3d3d3d3d3d3d3d3d3d3d3d3d0a0a
4e6f7465
5b404234
72656e616c
2d7468652d
7020666f72
206e6f6973
20696e205361
293b0a
3e54
206f662066726565
70616c
2a63
20436875726368
373620
20616e642031
6c6c2c20
73697374656e74207769746820746865
69736869
6e20796f7572
616e20616374
63756d65
244c
65787472616374
2071756f7465
3a206e
206279206465
4920616d2061
204a6577
756e64657273
207772
616e6368
7761792e0a0a
7320686173206265656e
696761746f72
72696e6b
333420
696f6e732e20546865
666f6c69
20286e
68726973746d6173
4f4e44
20636c6173736966696564
4435
6e65676f74696174696f6e
20677265617465737420636f6d6d
616c20696e
6d2031
652b
3161
2062617468
466f722024
2020202076616c
206265696e672061
5c7b20
207761732065
20726174696f73
5f5f20
20696e207468652067
3a50
62756e7475
206f662067656e65
4f7e
6c5f7b
20313936
544348
656666
7320696e636c7564
206c696e
6d7d
4578616d706c65
20656e646f7468656c69
2070657263656e74616765
4a616e75617279
2d76
6f726973
20726570656174
0a45
6f766520746865
206561726c696572
2e0a0a215b
222063
6f6620
20636f6d6d697373696f6e
0a43617465676f72793a
416e64
20446566
696e672e2053
636f676e6974697665
6f6c6420696e
63656c
2c20442e
726e696e672c
382e38
436f6e74726f6c6c6572
5c6d75
6524
2062792041
7469626c65
63697365
62626572
6c6c20776173
61707073
224d79
6c6f6e672c
65204a
20496e646578
79206261636b
494e41
666c65
2070756c73
656e6f6d
756761
6f6e69
526f6265727420
2874797065
746368696e67
20636f6e6e
20616e64207468652066
204672616e636973
732068657265
4f2e
786163
616c696e65
61737420
6e2022
5479706528
2074696d6520746f
726567756c6174696f6e206f66
362f
206a75737420746865
85
6e6869626974696f6e206f6620
2e2066
6520507265736964656e74
20417265
757365206f662074686520
5c5c0a26
6120
207969656c
627265
7828
9c
36
61756e74
6f76657220616e64
72696e672c
20737479
6f70206f66
7665737469
20796f7572206c696665
7669657720746865
5661
697a6174696f6e20616e64
77616e
616e2061
2829203d3e
3e27
2e0a23
2077697468204e
2062652062
31302e
312d33
657175616c
7072697661746520
6e65206f66207468656d
20646f6f72
2c2066
2768
45524e
657870657269656e63
436c61726b
6c792072
2a73717274
636f6c6f7572
7175656e74
305d2c
205370616365
616e742c
20284c
696c2e
70686920
675d
7920626f7468
20736169642e20
74696f6ec2a0
546573
3c30
486f6d65
2a6c
73206b6e6f77
20202034
20636f6e76656e74696f6e616c
6c6174696f6e73
732d
6d6f6e6963
696e6720746f20646f
20696e207468652045
20636f6e66757365
504154
45204f
2062616b
4c73
7d290a
7665
745f69
64657369726564
206f6620746f
202445
2d42
5175657374
0a0a40
616c2e20
65742028
53657074656d62657220
272c0a2020202020202020202020
20617420746865
4c6561726e
0a2020202a20
59
454d
616564
6c61746572616c20
4d6f64756c
207573656420746f20
51
3861
333438
20746869732079656172
20436f6d6d6974746565
205374756469
616c7d
6379206f66
542054
20562e
20636f6d70657465
206b6974
2d2027
2053656c
20737572707269736564
6c7a
61726c65
20687572
207468652073696465
616c7d0a
65202a
4e657572
20313430
203538
766f6b6564
2062616c6c
6e65
2020c2a02020202020202020202020
20506c75
2062696f70
6c2044
4c6175
696e6c696e6520
2c202a702a
2077697468206578
4f70656e20
2d3220
2c20626f
20416c62
7320617420746865
20746f20756e
69726f
2e746865
676c6961
20617265612e20
20657874726163
696e6720746f20746865
626f726e
75732a
20696e206f
796d6f
466f72206578616d706c65
207072696d
20746f206c6f6f6b
6861696e
7365636f6e64
46656272756172792032
2e2043616c63756c617465
20616e64203230
0a202041
2f4e
7065616b696e67
686572656166746572
662c
792c22
6e0a20
2063616c6c656420
20757020746f20
6469676974616c
20737068657265
656e63652077697468
7468652d
2066726f6d207468652067
616c69616e
20707265736372696265
206d6f7265206c696b656c79
207472656573
69747564696e616c
6329
636b79
206368617267
53756368
6563
2077617320746865
74797065646566
756e7473
746f776572
6d7072657373697665
28782920
6f6e2077697468
726573736564
20757365206f66
3432
206f66207468652046
6669656c6420
0d0a09
e28098
70656f706c652e
6d70696e67
20776527
2f64
206d757374206265
7e327e
696e69745f
6962726174696f6e
6d657468796c
526570726573656e746174697665
696e672048
6538
286e29
73657276657273
636b65
466c6f
6d6569
0a5468652070726573656e7420
206120756e
696669636174696f6e206f66
2e20496e20
2d706f
455353
20776974682070
6966696564
20746861740a
705f7b
7264
204554
20626f72646572
20496e64
616c6564
73746174696320766f696420
2065787465726e616c
656c6c6172
204920646f6ee2809974
3d2039
206578706c6f7265
20746f20616e6f74686572
d0bdd0b8
2072756c696e67
207768656e65766572
7468206f66
ad
756c6d6f6e617279
20686569676874
69747929
207468657265206578697374
204b6972
2c20736f6d65
7d287429
65733f
5e6d
6d65206261636b
2073747564696564
6173206e6f74
467572746865726d6f72652c20746865
2072656475636573
616d626c
5f5b
372d31
20536f63
28293b0a202020202020
25
2a204d
20776974682045
7369676d61
313535
2070656e64696e67
65642054
696e672068697320
372d2d
656e7669726f6e
4578706f
637472
3d3d3d3d3d3d3d3d3d3d3d3d3d0a0a
6620796f75e280997265
626572
415455
206f6620626f
206163696473
70726f6c6966
7920627574
656e6e79
2c20636f6e7374
6d6f74696f6e616c
7072696e
4c6173
7369676874
2c0a202020
65737320
206120706172746963756c6172
206163746976
5c6c6162656c7b
3535
206d65646963696e65
206973206578706563746564
65206d79
2d322d
20746f6f6b2061
0a0a546869
636f6f6b
20616e64207472656174
0a09097d
696a657270682d31
732e0a0a53
6772656564
2a282d32
206d6f7469766174
742045
7665206f6e
74203c
6172746e6572
793a20
2074696d652069
20686173206120
20616e642074
7272617973
7461696e7320746865
6f6e206f66
0a42656361757365
63696e67
756c756d
292e204c657420
6572666f726d616e6365
7b65
576569
206f6e2050
6965732028
747269616c20636f757274
207468696e6b73
206261736963
383729
b9
507269
0a0a20202f2f
756c7469706c65
65642048
6f5d
57656c6c2c
793d
533b
2070617274206f662061
504543
7373656e7469616c
5c706869
20747269616c
204b6572
206d697374616b
