20666f7277617264
70726f645f
2e202020202020202020202020202020
64206c61
206f662073657175656e
6967687420696e
7468652070726573
206865722c
20746f207665
333735
6f206d616e
696e667479
65642c2073
2067656e657320
2031393935
7b7b5c6d617468626220
726772
656e742e20
696e6720616e206f
686973206675
332e34
2c207665
20746f20676f20
7b726566
290a0a546865
7564696573
7572697374
6174697366696564
7920636f756c64
20617373756d696e67
53454c
20616c6c20746865
686f6f74
2072657363
202a49
207374616b65
696e206f7220
742069742e
323430
656e206861
4920646964
0a2020202020202020202020206d
747d7d
202020202020202020205c
61202d
2e546f
656c7320616e64
7269746963
6520666f6c
6173746564
642c20616e6420
0a202020207374
726479
64696e6720746f20
222050
20646920
24206174
7320
203030
207769746820245c
756e696e
2074686520552e532e
6e6f776e
5c73
2c20616e64207468652070
20707972
7320757375616c
6f7269657320
204e6f76656d6265722031
72612e
205c7375627365
686520696e746572
7229
20616e6420626c
74776f2d
207365652077686174
2e204665
20746865792072
207765206469
696e672e2048
67656e6572616c6c79
2c20636f72
c391c282c390c2
3a3a43
20656e61626c
20796f75207468696e6b20
20426c6f63
20616464656420746f
6b61792c
206c696e6520
2074686520686f7573
7065722e20
63617263696e6f6d
206865207265
76657279206469
68652d
6174746c65
745f72
73686f7773
6970756c
6e617320
207468657265207761732061
657370656369616c
0a7d0a
297d7b
61706974
7320696e20796f7572
206261636b67
76696577696e67
2024312e
732e636f6d
0d0a7d
6e6f7461
73207468656f72
64206120666577
20616e7469626f647920
20617272
20696e6375
656c696369
206163746976617465
7420666f7572
2074686569722070
206f66206173
2009
0a20202020202020202020202020
69627261
50616b697374616e
6c656173742061
206d656d6f
6c6174696f6e20616e64
22636f6d
69746820616e64
20202020202073
4520616e64
7949
74792e
20746865206c6976
206c6120
5e69
65727265
416e616c79736973
5f6f6e
732e6765
206e65636573736974
6f6e20706c61
706c61736d
506879732e205265762e20
616c7565203d20
686973206c6f
2061742039
61696e206d
20612074
2d2d2d2d2d2d2d2d2d2d202d2d2d2d2d
436f6e747261
390a2020
61742061206d
61792049
20746865206e6575
6c69676874206f66
49737261656c20
73735b31327074
6e20436f6e
6f2064657465726d696e6520746865
6d61796265
64206f662074
697468206d
72696c6c
22206f6e
20657175616c20746f
302e30303030
2220747970653d
452b30310a09
21204920
50726f706f73
636974696e67
70652d
636820746f
524345
696e207468652070
28696e636c7564
7563742c
616e74206973
5120
505f7b
5c70697d
206d6f757365
206f6620612062
736964656d6172
6f7574646f6f
656420677261
6561642c
6564206576657279
2c20746872
746f7869636974
72656e636520
2066696e64206f7574
747275737420
7472616e7363
2074686520757365206f6620
52545f
696e6e6f
2c20726174686572207468616e20
746f20612070
2c206576656e
2e20496e206120
61206c6974746c65206269
766f6c61
666f726d756c61
65725c
202274
20436c6169
696e636c75646520
2073656173
2ee2809d205468
5f7465
5c61
616e63652e2054
20746869732074
617465206f6e
353f0a
343832
65206972
4578706572
6865206368
206669656c642c
73747265737365
5d7b6461
206d697373696e67
4147
204e657665727468656c6573732c
297b23
223e0d0a202020
656c6c2074686520
696e6720436f
2061726773
2875
5c5b5b40706f6e652e30
732e205468697320
7368616b65
2e2f2e2e
6f707369
6563746976656c79
20202020202020202020202020207468
696e7374616e636573
64205265
6c6564676520
70757420
20496e2074686973
20746f20666f72
5f636f75
6d205b
2c20736f20746865
2c2041
2020202f2a2a
6d617373697665
204332
6179206d
2077617320626f72
6120796f75
646f6d61696e73
350a4c657420
736c65
5d2866
74207468652063
6e74732062
6564206f6e20616e
207472656174696e67
732061206c6f74
74757265206f66
20746163
2068616c
6c2031
696e7d
746578
6869702077
206c6f7365
75722067
7420746f206d
696e672c20
67657374656420
696575
20726561642061
2044756e
206d656574696e67
636f7573
20706167
20757020746865
6e616d656420
20746865206d6f726520
73757267
2028696e636c7564696e67
7261707065
73207265706f7274
202d33
696d756d
57686174206973207468652073
293b0a2020202020202020202020
207072696d6520
492075736520
79646179
2d2d31
202a20
6e746172792d
6573206265
204a6572736579
476f6c
6f6e6520666f
20466564
5c77
766564206279
204d696368
7432
757474696e6720
6120706f70
355d5c
3a20737472
20697320636f6e
2020202020203d20
697070696e6720
6973636861
2e2e2e29
7920636c6f73
206d696e696d616c
65203d2022
2c20636f6e7369646572
414c53
6173206e
65204d616e
672e73
206d6520746f
6520706c
2049206861
20706172742069
72726f723a
6c6173733d22
652061666669
78696d75
696e647573
616e64696461746573
696e69
6c6f70
207765206e65656420746f20
6f6c7973
206c696d69746174696f6e7320
65647d0a20
706f7420
6861726520
5c63616c
696c6c2068
686572207265
204170706c69
2c204d41
73206964656e746966696564
2d3e676574
2069732065787065637465642074
2074686520656e7669726f6e6d656e74
6978656420
4064
766973696f
206f662061207265
61727473
6d657320666f72
20636f6e74696e75696e67
72792e2041
697320657861
206675
2073746f70
74742e
292073
7574696e6720
732068617070656e
61626f75
7b7d2e
0a0a23696e636c75646520
54617267
7261746520746865
263d20
6e64206f7572
6e636520696e20746865
683f
6f6c6b
66756e6374696f6e2061
657220666f72
6c657373206f66
2d3e64
657220776173
28742920
6c6f6f7020
656e742c
706f6e73
20636f6d6d756e69636174
652d30
20666f7220657665
6f72205265
6c65637420746865
74726f6c6c69
6e6465722074
20636f6e74726164696374
6974696f6e73206f66
72206f7574
706f7765
207573696e6720616e
616c6c6f63
2e22202254686174
74206e6577
2072656c61746976656c7920
756263
6f2074656c6c
225365
4576616c
2020202f2f20
7261626c6520746f
206f6620616e7469
6f6c6f676963616c2061
6ec2a0
6520616e
6d617374
4e5420
2067756172616e7465
6674656e20
2c207468657265206973206120
290a20202020202020207b0a2020
7468206861
6520736572
6d706c696564
83c383
65642c2074686520
33292c20
696e206d61
6e2064697669
34292e0a
206e6563657373
312e32
204e55
207769746820616e79
696e652076
0a4920
6d20686973
52657365727665
6420636f6d65
6e2d74
466f6c6c
20696e20616c6c
20746f20746865207375
496e20616e
6576656c6f
20746f6e65
65777320
737572652c
74617473
66696365
2020202020202020202023
20686173206e6f20
e2809973206465
2074686520746f776e
362e31
20616c736f207468
7265646973
2073756974
67657b7570677265
65206c61796572
2c2047
207769746820636f6e
796f757220
74696f6e206f66207265
642074686f73
627562
697320626c6f
656e646f7273
75696c6469
20736972
6b696e67206f6620
6965766573
6368206361
636c6f736564
206661
732061646d69
20576879
616c206368616e6765
206f766572616c6c
2866756e
2929207b
72612063
5f4649
6f75722c
736f206865
666173746572
20746865206576656e74
6174206c6f77
652073747564656e74
5c7573
20576520646f
79206275
6c0a20202020
20746865792063616e20
7473207768
65205469
427269616e
6e2d3e
7420612064
7320757375616c6c79
706c69616e6365
2072617469
65722c206865
696e672066726f6d207468
3035292e
616c6c206d
7320616464
206c657373207468616e20
67656e6520
20626520636f6e7369646572
6c656570
7273696e
666563
652c206e6f
20202046
2070726f706f73616c20
722e205765
2e20436f6d6d
3c2f
6d20696e2074686520
c2b1e28089
6f20666f6c6c6f77
202020206174
2070726163746963657320
65732e2044
722e2057
74206265666f72
6365206578
732e205768
72696d6520666163
20746f206f766572
657444
626a656374656420746f20
6f726e69
7468652042
20646f6e2774
6c696e6573
206973206162
7420e2809c
24206173
49206b6e6f77207468
74683b
0a666f72
0a0a576f
20c2a72031
693a
7b5c616c706861
73757370656e64
2022696e
73206f72206d
642c2070
7020626574776565
3b0d0a202020202020202020202020
67697420
20507261
20707265737375726520
20746865207461
7265766965
746865722073
6c7320
633a20
656767
69742064
20576865
653d22737570
207468652072656d61696e
7220657870657269656e6365
74696f6e206d
656e74656420
73293b0a20202020202020
7765616c746820
696e67696e67
74203c
db
627566
20736f2066
7320746865207375
696c6c20626520746865
2077656c636f6d65
4163636f756e
20746865206c6f7373
226c69
616c6c2064
2c2074686f7567
20536f6d65
39342c
6f6f64207468
697374616e636520
204167
766520757365
206e
616c6964617465
2920616e642069
6f7765642061
6c6f7720746f
20656d65726765
4047
7472756d
7261696c
6573706f6e736573
6e6e6574
650a2020
72696e6720746f
73206469676974
722d63
672e2054
6f6c757465
69746c65
70656e20
65730a
5455
20776f6ee280997420
5d2823706f6e
65706172746d
7563746f
657273206f66
20616e6420617320
2073696c69636f6e
504e
6973207361
c2b1
0a20202020202a2040706172616d20
6669726d207468
6e2074797065
6e20486f
6469736820
746f72732c
7274206a
61682c
5c5b6c656d
736f6ee28099
6f72792e0a0a
74686f7574207265706c6163656d656e
517561
4b32
6e20467269646179
2255
2c2e2e
20746865206f6c6420
205f5f
6f6c20616e64
616c20726573706f6e73
7274757265
76616c756174696f6e206f66
61706162696c69746965
696e7b64
6d6f64
57656c6c
0a4d6f7374
73206d7573
20746865206c6573
6173206261
757374657273
20646973636861726765
202252
207468697320636f
305d5c5d2e20
e280
696e67206f6e6c79
205349
746865722075
74696e2c20
7320696e20616e20
33335d
65647572
656665
6420696d616765
77732066726f6d
2061676573
70726f6a
7420686572
4874
20616e64206f6666
303738
2720
20646973747269
75655f
6f7065726174656420
70616e656c
626f6e64
68697320706f73
5768617420697320
2066697273742062
2073657175656e63696e67
206f6620686572
6e697365
61626c7920
20696e2049
616e2043
204c616d
20636f6e766572736174696f6e
2c20636f6e7472
206f6b6179
2070726573656e7465642061
6d69742061
732061206669
72656c6174696f6e20626574776565
617320612068
6f20646f776e
7320776861
2e202e
6d6f6e64
20746f2070726f766520
79726f
6e204a756e65
0a0a4d6f73
746f6d65
6e2c2070
6620657272
730a20202020202020
656d656e747320616e64
616e742069
70726f6c696665726174696f6e
6d656e74206173
20776f6e27
6174696f6e2e2049
62636f
616c75653b
74686f75
6564206265747765656e
536563726574617279
7973796d7d200a202020
616d65206f662074686520
6476656e74757265
6e637920616e64
2068656c7073
7b5c626574
20616e64206361
696767
b8
73742072
656e7669726f6e6d656e74616c20
20666f72776172
6d732c20
312020202020202020202020202020
686f6e6579
636f6d706c696361746564
68202b
6e6f756e636564
0a3c6a
616c6f6e672077697468
20696d6d6564696174
20446566656e64616e
616365732061
20636f6e646974696f6e732061
2061207370
6520776f6d656e
6963652028
672045
6f6ee2809973
6c6973742c20
2120
206d6963726f62
20202020205b
206469
657865
636861726163746572697a6564206279
54686973206d61
656e740a0a
417070726f
39202b20
74656e2070
742122
75746865
65617265737420696e
20696e666f726d6174696f6e206f6e
6f772074686174
73637269626520
2072657374206f66
2074686520737465
312c2074
20726561646572
666661697273
6f20706c
747275653b0a20202020
69686f
706c617920
6e5f20
72747a
20616e206f70656e
2c20736f2049
42656361757365
656e63652074
242074686520
c2a05c5b666967
6f20626520
393536
3a0a20202020
536372
2e204d6f72656f7665722c
207468652063726f
2063686f6f73
20636f6f7065726174
6c792074686520
62792050
20706f77657220
49207468696e6b20
737572766976616c
207369676e616c73
23646566696e
7069736f646573
6475726174696f6e
0a24245c
3f0a35
726573
207468697320746f20
20626f6e64
756e2d
65640a2020202020
22290a20
2073686f776e20696e20466967
7d24202020
6d65206d61
6564207468656972
747369
6a696e
72696e6720616e
732e0a5468
756e672061
526967687420
206861642069
3464
6966662773
206d6167617a696e65
6b3b0a
792044
20612073686f7274
20666f72206c69
72617365
65726d20
6d706c696679
2a2a32202b2032
69676e65
6520616c6c
646577
6e6920
207669736974
666f7220746865206669727374207469
5c756e6465726c696e65
6172736572
4e6565
2073796d70746f6d
6c617965727320
20666f72206578616d706c652c
6f6e7461696e73
617d24
75742062
697420636f
5d206973
73747320616e64
09666f7220
6f796572
e280992061
436f6e76
0a090970
2c204e6f
20202020202020207d20656c7365
68617073
506572736f6e
2074686520686f6c
696e74206f
7465733a
686f76
20696e20737563
6920616e
746f6e6573
2074686572656f66
4275696c6465
6420706172
6f756c6420696e
2e6170
20646174612073
66616d
62696f6d
6f7074696d616c
442074
6f7720736f
68656f72656d205c5b
2061726d73
20726f756768
7265642c20
64206c6f77
74206d6179
6520646f6ee28099
2020203a20
6e7473207768
6520746f2066
3b0a7d0a0a
652066696e
65646174
79223a
676d656e7473
74206c696e
7265662d747970653d227461626c652d
646f6d696e616e7420
2066756e6e
41494e
414f
64205363
6576657279
616c204e
6465727320616e64
642073706f
20686520776173
726520746861
666967227d2c20
6372656174652074
6e6f772066
6c2e73
70696e672c
6f76616c
393337
72696e672c
2074686520736f6c7574696f6e
696e647563656420
206f6e206c
6e732c20746865
7b447d
732e204173
20666163696c69746174
206c6f76
20616c6f6e6720
76656c73206f66
65702073
6e6f74207361
6e657373206f662074686520
6d206279
6469737472696275746564
20486f7765
63656465
717569736974
64206f6e746f
2a2a2e
30222c
202020204e6f
726d61
30202020202020
20426c6f6f
382069
677c
207468652065787472
6c223a
7973796d7d
2076697369746564
2074616c6b696e672061626f7574
6576657220746865
20696e2046
313436
6520706f7075
686572206172
2063616c63756c61746564
642062696f
7363617065
656d2066726f6d
206d696e75
4d6974
20696e6a75
65642028
6e2074686520636f756e74
65206f7665
6f757320636f6e
7468727366737d0a
20746f2065737461626c697368
6c6c2e2054
696e2063616e
706528
20746f20746865206c65
6c6c616e74
20667275737472
3a3138
737562736964
372e37
67657b757067
746172746564
502070
6f6e20666f
656e2073
2c20627574206e6f
3728
65207061747465726e
3b09
696c6973
207472757374
504441
2070726f6772616d20
7b7b5c6d61746862
7320657874656e
3a20696e
323130
70206265
2c20736572
616d706c652c
696e74726f
6d61747465722e
747279206f
61696e657273
20746865206d6174746572
6f207369676e
6f6e65207769746820
20656e636f64696e67
793e20
6966746564
55706f
6f7573652c
2020202020202020696e74
20556e6976657273
35332d
4d6f75
206f66207468696e67
6520737472756374757265
757820
2c20636c69
66657220746865
204a6f7264
204c617720
3030302c20
3020746f20
7565207468
323639
3a36
6967687473206f
734e616d65
20726174696f6e
207468652063656e7472616c20
7320616374696f6e
61706879
732d3230
73206578706c61
206f662070657273
202a0a
6e20796f7572
2066656d616c6520
204744
6461797320616674657220
090966
73207768696c6520
736572766564206173
6c706861
696d2073
49742773206120
6e2074686520636f6e74657874206f66
284d69
6963726f736f6674
20646566696e65
68206469
2070726f6869626974
6e205369
6d696e6973747261
20746865726520697320
616c6973
20666f72206f7572
2121
7369676e696669
7573652061
2073796d6d657472
63
6e2075736564
72617720
0a097b0a09
2061707065616c73
2e0a0a5468657265
616c2070726f626c656d
67756c617465
6f69
79206372
20656475636174696f6e616c
67206f
6f72207761
6465707265
206c61737420776565
496e64
5065726d
756d206c
706f6c6c7574
64207261
70726573656e7420746865
75676172
6561642073
6e20736f
616c6c20746865
6c205c
0a4865
0a78
7264696e616c
556e64657220
0a202020202020202027
20616e206572726f72
d0b0d0
3b20736565
72616374697665
20202020203132
36e280
2d636f6d
73697a652829
7068616e
616e63656c6c
72205c5c
6e656564
20636c61737320
7920646f
6c6f73696e6720
240a0a54
696e672074776f
7b5c746578747b
52542d
2020202020205c62
20416e67
6973736970
537461746973746963
65656b7d0a
6865207369
50726f7669
6164206f6e
6e726f6c6c
7420
65706f
20736f6e67
20647572696e672074686520
2d7665
5b0a202020202020202020
2074686174207468652074
7320776869
20696e20726561
5061726c
662035
206e6f206c6f6e676572
2520616e6420
2070726f746563746564
69662074686973
7920676f
4a61
4170706c696361
31312e20
6172726179
22222c
20203231
696e6765
2077686963682066
20736f636b
7320696e2076
2054686f6d61
72652e0a
2073696d756c6174696f6e73
200a
76656420746865
636b0a
746f206d61
61746567
65727920616e64
382c30
206170706c69
20686176696e6720746865
656e207365
616d696c746f6e69616e
475f
20666f757220
746f2074686520686f
206c6966652e
6f637573
61726965
7d7d285c
206a757374206f6e
2d6c69
696d652066616374
6d6f6c64
20636f6e64756374
616c20616e616c797369
7b4c
207c20e28094207c20
646f6c
46696e
28652920
636b6167657b61
65206f62736572766174696f6e
52756e74696d
69732024
353130
2c2077686963682064
686174206f7572
65737420636f
5b313270745d7b
7b616c69676e
726520617265
3c2f636f64653e
74206e616d65
6420616363657373
67206f6620746865
696e67206372
242e20466f7220
204166726963616e
697320666972
2e2043616c63756c61746520746865
205374617469
657373207768
6573706f6e736520746f
707269766174
696768
6c7920646973
6420746f20736565
57652074
732c207261
6e6f6f6e
65772041
7761792062
776e73
206d616e6167656d656e
322c303030
74696e6720696e
20417263
65772062
206d6f726520636f6d70
654c697374
6c206d65
696e6b696e6720
636f6e6669726d6564
203d2066616c7365
657220616e
656e6774682c
206d6963726f6269
74202428
20616e6420696e7374
2c20746869732073
6561642062
7d20202020
4d732e20
333936
2c20696e64
63657373
696e74657374696e616c
82c282
6f6e6520696e20746865
2074686520666972737420
69616e
7420726570
63637572616379
732e20596f75
4c616e67
54686520666972737420
41726368
6b65206e
707379636869617472
61207765
206576656e206d6f726520
6c6163652074686520
4d656d6265
2077686572652074686520
616e64206e
6f756e642e0a
20486f77
73206120
6f752077657265
68616e6b
657374696d61746564
395d5c
20736176696e67
6565702069
65206d6973
2061626f7574206f
5243
637269
20636f6d706f756e647320
20202020202055
6573732c2077
766520676f
2064656e6f
6e6374696f
292e20486f77
6174696f6e7368697020626574776565
20796f757220696e
382e
2074686520746f74616c20
72726f7220
696e20776173
6c7061
65204675
202432
74202424
393831
7320637269
2c2070726f7669
792074616b
330a57686174
7920776f756c642062
6f6c6469657273
20476f6f676c
6d3b0a
72756e
7265736967
72202b
6c6c20617070
6d656e2e
6f6f7465
696f6e2064
73706865
65207072652d
612c2077
207368616d
206d696e64
2e204e6f77
4775617264
69636b207468
636c7573696f6e206f66
6c7d0a202020202020
792069732073
73616c
6e642024
6c64206865
546865206772
2c206f6e65
7420696d70
206d7920
2077686f2069
6f6f6d20
204d6173
2077616e74
7220617420746865
616e206861
6169722c20
6e696d
207468656d20696e
737461626c697368
69666965
736179
6b7d0a202020
206973207468652076
2c206576656e207468
2063686172676573
662e22
686577
6565642073
206f6666
65206578616d696e65
6865206c6976
6e652e20
696e67206f7572
20636f6e74656e7473
313020
2073797374656d732c
736520636f
72652074686f
616e6420746861
48652074
753f
616e74206361
206d6f6d656e7473
736520706c
6573742074686174
706879
6e6f2069
204672616e636973
3c3c2022
20736563757265
6120636f6e74696e75
3f0a32
2c20796f75206d
696e672061626f
6578616e
72206a
2065786369746564
70617469656e
726f6f6d2061
20736974756174696f6e20
36292c20
74c3a9
65204269
2c302c302c
20746865205068
362e204c6574
73686520646964
7920636f6e
6f206d65
54687573
2063686f73
3b2054
636365737369
696e76656e74
20627920746865207265
732063616c63756c
742e204f6e
6572696f7220
206f6e206120
205061
747269627574696f6e206f6620
2c20706172746963756c61726c7920
544b
762d
696e2066726f6d
746f756368
69746973
66696c6c6564207769746820
546167
732e20576520
63757272656e74
696e616c2066
67697461
20776173206a757374
342063
7072657373696e
6c6f6f70
6f726465722c20
20746865206572
2074686520656e6420
20746561636865
202d2034
2074686520656666656374206f66
6d696e61746564
20616e6420636f75
206469616265746573
206c6f6f6b656420
7070726f616368
65207370656e74
20676179
31302d
652e2042
672024
6970706572
7074696f6e206f66
7320636c6f7365
207765656b656e6420
787061
6420616e642075
20616c736f207365
20616e206162
2c20636f6e
202b2063
2065766964656e6365
20617320616e2065
313438
2070702e20
20247b5c
2e0a0a44
48656164
5e7b6e7d
6824
79206761
293b0a20202020
656d656e7473206f66
206c6974746c65206d
65726174696f
203d2074686973
28726573
206d616e69666f6c64
7420736861
7320746f207468652070
2067656e746c
74206f6e6520
782070
636c7573746572
68697320706572
746f2074686520636f
67686572
20616c6d6f73742061
72642077697468
280a2020202020202020202020202020
353b20
2072656c6576616e
373420
2028776869
6f6e74616e
6e6564207769
01
207265666572656e636520746f
206f6620656c65637472
686172696e
206465737069
206f7574206f6620
0a2020202020202020202020203c2f
636f6e74616374
6f72656e
7473206f
35372e
61726b
7175
6f6e20697320
456e74
20462e326420
61792c2069
20746f20737570706f727420
20696d706c61
204f6374
286c6f
75722064
68657265206974
24206973207468
20646966666963
3a3135
6573697a65
466c75
6f7267616e697a656420
206f6620746865
65742065
6f77732e
206265696e672075
6d616b696e6720
652073757266
2c206f6e65206f66
65616c696e67
6962757465
616e79
726966696564
636f6e6e656374696e67
676175676520
6d2c2074
2e205468617427
73736974
6c656420627920
65676f7279
74204d6f
7468696e6720746861
2066696e64
65207374617465
206665656c206c696b65
65732063616e2062
65732c
73616d652e
6961677261
6d20676f
2032303032
0a23646566696e65
6564203d
20726567696d65
3320
636b28
207765276c6c
2e203230
602c
2773206163
6e65206f66
792061677265
20636f6d7072697365
6f66
6f646966696564
7d7d242069
5468656f
6465677261646174696f6e
6520697320746f
642e220a0a
207761737465
6173206d75
686520666f756e64
6e6372656d656e74
31302c30
6f726574
2d2020
747320756e
65733b0a
427920
6965732c20746865
656e2046
75626174696f6e
6172206465
73206c6f6361
6c202020202020202020
6d2045
7a203d
676869
2064657465726d696e6520746865
2829293b0a2020
6f6c206f
73206f62736572766564
2e204120
656420612062
6c792064
206d7573636c65
632a2a
303639
737563636573
2e33
746c656e6774687b5c
20302e33
3b20202020
207363686f6f6c
2a20202020202020202020
47616d6573
202020202020202020202034
69732061
7973796d7d200a2020
740a2020
73206e656365737361727920746f
20746865207265736561726368
6567756c6174696f6e
6c617474696365
3c737472696e67
766170
656420696e20746865206d
7075742066
7d292e2054
e2809d2073616964
595f
79206c61
20302e30303030
66756c6c2d
72790a0a
6f752066
2f6c6963656e7365
64206d616e
20616761696e
20636f6d706f736974
6f70206f6620746865
2066726f6d207072
6520446f
6f75206861766520746f
75636b7920
5c4761
0a0a21
7468696e6720696e20
3c302e303031
6374696f6e2072
2061206c696e65
6e64204a
73206e61
20736f6d657768657265
656420697420
7874726163
73207468652062657374
20313430
293b0a202020207d0a
733a2024
2d706f696e
206a757374206c696b6520
65206563
722074686520
666f726d2069
6e2078
6f72207573
4e6f2e2031
74207573
2c2062617365
7420636c6f73
73207369676e69666963616e
6f7573206e
7420766572
65652e0a
75726e2066
6574615f7b
414120
646f6e2c
2e20506c656173
53696e676c
6e2c206e6f
6c616e64
7461626c6520616e64
2070726f7065727479
6520746f206d65
7468656c69616c2063656c6c
20746865206162696c69747920746f20
7220706172656e74
244e24
326e64
737427
726521
4530
65727420
61746572
6c7069
20697420616e64
6b202d
76652063
6c7920616c
6563746f6d79
2c2074687573
686572207465
6d6520666163746f72
65707269
20766f746564
4d616e
7920616761696e
686f2064
73652e2041
7273206f6620746865
74797069
20616c69676e6d656e74
322e2057
79206d616b
576169
6172792065
7320746f206163
20766172
2e20416674657220
69746520
73696f6e616c
206120636f6e7374616e74
206665617475726520
6c642049
414e4420
617070656c6c616e74
6564206f7665
206b6565
732074727565
20696e207468652063617365206f6620
20202020202020202020202069662028
736f6c76696e6720
7479706573
457175616c7328
2061726269747261
20796f75206669
7d7b5c7061727469616c
416c73
782068
30303036
2066656174
4974207761
696e67206d6574
696275
6964656c696e6573
6e2070617469656e7473207769746820
6b206f6e20746865
4d6f7265
73206f66206e
73206974
3b0a202020207d0a0a202020202f2a
6520746865206669
75646564
687974686d
73206c
54455354
610a20
0a0a4d616e
686f6f73696e6720
2e204c657474
5f7b30
62616e6e
6e732d
0a3c61
6465722074686174
616c6c2076
c2a06d
416e642069
20203078
206e65656420746f206265
20492077696c6c
657870656e736976
20696e73756c6174
6a75737420746865
6174696f6e61
656420696e2069
6d706c69636174656420
2c2074686f73
20646f6c
5b40435235
6f6e7374727563746f72
616ee2809973
646f75626c652d
207468652057
39342e
6e65642074686520
313336
65772070
205365727665
20576f726c
7572652068
65206c6573
20666f722074686520666972737420
6e672064
726272
45617374
3033
2074686520726576
43756c
617d28
207761732075736564
636f6c6c656765
50656e6e
7b5c6465
20636f6e7472617279
69742073
206279207468652063
0a7b0a20202020
6e20636f756c64
656e6974
68747470733a2f
207265636f676e697a65
20612073756273
61696e6c
6865206163
7420706169
63636570
44697669
206f66206175
6f6e0a0a
20736d616c6c2073
69706572
2e20522e
417070656c6c61
6c6465722e
69642068
7320646573637269
666f722066
6f206576657279
6578616d706c652e
74656374
20646966666572656e636520
202a42
726520747261
6578742073
6578656375
6c65616e73
74656d70
206672616374696f6e
65642e222022
6f72206861
72652c207765
206d6574686f642069
222c0a202020202020202020
6c792073696d
6f6c6620
6e206f70706f7274756e
656e737573
652064657465726d696e
206861642067
6e6f772077686174
5c6d6174686262
72657374726963746564
20657420616c2e2c205b4042
20696c6c
6173736f636961746564207769746820
747920
203e
63636964
7261746520616e6420
742e64
2072656275
6c6f61
6e6365206861
6f776e2063
6d65722069
20686561646572
546869732063
227d20
206120676f6f
513a0a0a48
20202020202067
7220636f6d6d656e74
6f20666f72
73797d0a2020
2853
75616c6c792073
53656e64
442042
68697320
207363
2077697468206f7468657220
50726f6a656374
20746f206d6f64
2e0a0a52
20776f726b2061
6c6f6e67207769746820746865
61736572
2d322d
64636173
6f742e0a0a
72642053
20726573756c74206f662074686520
206966206e6f74
69202b20
206f6620636f72
20736561736f6e2c
277320696e
207b5c62
6564206f7220
7665727920
206f7574646f
2a2a5d
0a5072
20616c706861
697665732074
6572742061
6d2e2041
65787465726e61
6c6c2061
7b5c6d617468
642e20416e
36202020
776974686f7574
73736520
64736f
464f
292f
42726961
6f6e20776869
6e65642061
74746c65
4358
206174207468652065
6e206665
204e756d
220d
206c656769736c6174
616e63652e0a
65206a6f
652066757274686572
204572726f72
2c20696e20706172
207468652076616c75
7920736561
75696c69
696f6e2068
7374696369
2076616c75652c
52756c6520
6f6e73206f6620746865
6b2e222022
636f6e6f6d6963
33297b7265662d747970653d22666967
424c45
6e616d657320
6f20726564756365207468
7375627374616e7469616c
62696c65
756d626c
3722
6173206a
7574746f
0a496e2061
6e63656e74
5365636f6e642c
68656c6c
2073796d626f6c
706f727461
292c207768
2073617475
20706f6c6974696369
20313820
6520747269
696d6167696e
206f66206c69
4e442c
6e732069
696e6a75726564
706f6c6f6779
616374207769746820
736f6e67
6e6420796f7572
20736c6f74
20302e3034
7b51
696e2070
622064
687964726f
5c6c616d6264615f
736520746865
726573746564
202720
646966667573696f6e
74222c
726567756c6174696f6e
617365206973
69736361
363a
72206f
20776f6ee2809974
696f6e2065
6e7420
616e7469626f6479
746966696572
696a65727068
2077697468206e
202020207d20656c7365207b0a202020
6520546f
6c2e2054686973
2c206163636f7264696e6720746f20
736369656e7469666963
6631
627461696e696e67
206164766f6361
61676765
74732074
2a203d20302e
62627920
7220626172
696e672065
6163636f756e74
206f6e6520746f
72702e
656467652c
6f6e20776f72
6320696e
592e
6379206f
2074686973207765
4c4541
202020202020202020302e
245c63
2d736361
302070657263656e
206465636c61726564
634e
652122
2073756767657374696f6e
20616e6420746865206e
2c205465
65747269
642e0a54
2e0a0a5374
466163746f7279
67206675
206d6f7374206f662074686520
697420746f2074686520
3078303030
65206c6567616c
206d69786564
0a0a496e20746865
207465726d69
74206275
6f7253
6e666f7263
6c6c7920616e64
20746861742069732c
6d6f756e74656420
66205b
79206173
65642062792053
7469626c
7572657320616e64
69667420
636f64696e6720
6173742066
6172636f
73206c61726765
652c207468
76616c75652c
6c6f776564
616d706c696e67
2063697263756d7374616e636573
6e736372
48756d
703b266e6273703b266e6273703b266e
22206865
0a69
656e6a6f79
6e6974697665
0a0a496620
2e204974206d
206f6e207468697320
202020202020207d
73205065
e1b9
6c69636b
2c20776520686176652024
2063616e204920
207265736f757263
207363686564756c
6965732068
20636f706965
20616e64207365
2079656172732061
6b65793e
0a202020207265747572
656e6774
2042696e
696c6c696f6e20696e20
20636f6d70726973
2061742061
6964656e74697479
626c6574
636174696f6e206f662074686520
20706965
7468652066616374
20736179732c20
467265
506c61696e7469666673
693e20
696e74657273
6e63652e20546865
6564207468617420746865
2ce2809d2073
706f6e647320746f
222028
7b7265662d747970653d22666967227d
732e20466f72
75636174
61772069
6761746f72
616c205061
6d6570
617263686974656374757265
20636174616c7973
726573706f6e736962696c697479
6420666f726d
206d6f7274616c697479
46616c73
2073747275637475
20626c696e64
2074686520616e6e
73207265747572
2f3229
74697265
65726d7320
292c2064
092f2f
2c204275
73656e742069
696f6e2e0a0a546865
72656c6576616e742074
204d6f6e
78706c6f72
206f6620537461
6d656e747320666f72
506c656173
616e636572
203020
2c36
65646e657373
0a0a596f75206361
6d617a
2e3120
61737061
4b52
7265207269
6e207068
206d6564696120
3a2066756e63
726561747572
6c697669
20636f2d
202020202020302e30
206f66207479
206d6f64756c65
3a205b0a202020202020
2d7661
7368206c
696e7374616c6c6174696f6e
205c6c6566
77616b6520
64657363726962
6974206f6620
206964
7573742067
7368697265
2070203d
2066726f6d204d
757420686176
73656c6629
203d3d20
7829
5f7b317d
20706c616e20746f
7d0a5c6c6162656c
6578742d
7b0d0a20
742056
206672656520746f
687b5c6d
31393838
737365732c
666963616c
6465727320
7361696c
7465206465
76656c792c
7265642e
626520757365
656d6f74696f6e
20697320676f696e6720
6976656e657373
746566
48617368
2077696c6c2063
2050726f74
636861726765206f
7365617263686572
7761797320
617267696e
67656f6772617068
7320696d706f7274616e7420746f
2e20466f72206578616d706c
2a2063
2061646865
736369656e63
6f627365
2053796e
6561727320616e64
6d617820
68652773
6165726f
696e2043
2b2d2d2d
62792077
20776572
206173206f6e
7c3d
205c6f6d6567
2066726f6d206f75
5f5468
746820616e
696f6e2053
63656c6c756c6172
0a202020202020202020203c
746976652e0a
7461727420
6420686172
696e202d
80d0b0
645f74
65227d
33382c
382070
28290a0a
202263
203d0a2020
696c6c206265206d
73796e74686573697320
435420
4d44
732070726f7669
6b6c69
6e616e64
656e7369
2077616c
2073656374696f6e20
20756e63
706f73616c
6c73206f6620746865
5f2c
67657b6d61
2020202020202020202020202030
726d616c2063
6e20696e76657374
207468616e6b7320746f20
6d656e742065
2c204341
74696c6c2c
70726f62206f662073657175656e6365
65206d697373
626567
497320
6f6d6520666f72
74696f6e206f66206e
6520746572
722062656361757365
32297b726566
686520696d706f
206d6164652069
20536369
6349
6c5f
732e67
61626c6522
4f5645
206f662074686f73
6f7220616e6f7468
20736f6c696420
206a757374206e
205765737465726e
20796f7572206c
207628
20536865
792070656f706c65
206f6666206f
2e20762e20
20646970
656d616c65
6d7367
3d317d5e7b
7261696e696e6720
6869732063616e
6c79206d6561
6f63617465
20616e64207068
7374616e7469
6574657269
6c697374
616e20616c736f
20666f6e74
69743b
2c207468652053
0a2e
79206576
7320737570
62616374657269616c
732064656369
732c207468652064
652077696c6c206e6f
74696f6e73686970
7320776f756c64206265
61766564
c2a3
6f6e206c6576656c
5b4072656631
5273
642e20617420
74652074686973
696e652e
6865206c69
5d2e205468
4368616e6e656c
0a66756e63
0a20202020202020206d
64207573
2074686520646f
35206d696e7574
722066616365
61737479
657468
2063726561
6f6e2e
2064657461696c656420
636f6d652062
656e74696f
2a204070
20746f2064657465637420
730a202020202020202020
612024
7369676e69666963616e746c79
20207b0a20202020
7461626c79
3c74643e
756e646572
206869732068616e64
206d6561737572656d656e7473
20626172
77697468696e20746865
66756e6374696f6e20696e
706f73746572696f72
6f626c656d
2020202020202f
72207768
702073
656c20696e
69612064
0a0a53696e6365
6976657320616e
0a20202f2a
5f6924
20626173696320
29293b0a2020202020202020
72616374696f6e206f66
652065786973
2e5468
65642069
20574954484f555420
796f63
20696e204669
2e0a0a232320
76657220696e
6d61747572
686520737472
766520796f75
686520757365
686520736563
5c726d
2066756e6374696f6e2028
20426f75
75652028
20656e67696e6520
6e6e6f76617469
325d5c5d2e20
62756666
2c20626f746820
65726566
206d696c
207468652073637265656e
65616c74682c20
20736368656d6520
6679
7472616e73666572726564
706f6e652e3031
685e
20696e6372656173656420
6c206675
2a37
2020202020202054
65647563
3820552e53
5056
64657461696c73
2e696d
517569
206672657175656e6379206f66
0a202a2054
78636c
2e6765
7420696620796f75
2c20616c6c6f77
2c20636f6e63
20646f6d6169
20612048
63687572
6c6f7373
6162736f727074696f6e
6765206f66
76652c2061
2068617665207365
792e2045
2063656c656272617465
67652074686174
766f69642073
65666572
6162696c697479
2074686520706f776572
61626c792074
617263696e6f6d61
7468696e6b
362e0a
4b656c6c
737461746573207468617420
6176656c656e677468
206275742065
6420647572696e6720746865
20776f726b2e0a
206261736564206f
657870656374656420
0a2d2d2d2d2d2d2d2d2d2d2d2d2d2d2d
73206469726563
2f0a20202020707562
74636f
6669747320
6564207573696e672074686520
28302c20
2070617469656e74732c
652c206d
742e2050
677261706879
20636f6e74726f6c6c
20726573706563746976656c792e
20576520
64697620
743a0a20
70206173
6c792072656d
3828
5f676574
6a657420
70726f7669
6c652049
2073797374656d732e
20656c656d656e7473
7220646576656c6f70
20492c
206f6620746869732074
6365206e
20746f2064656665
6861742069732063
246f
20636f6e747269627574696f6e73
2c207468657265
736f6d6577686174
736f206d61
2061207261
6174696f6e206f662043
62206f662073
6572696c
30206d696e75746573
5d2e2053
756c747572
722e2047
466c6f72
6e65647d24
79206f70
77204d
20616e64207072
756e64657273
454c45
616c207761
2032303033
7920612070
6d61726b657273
726164696e67
436c69636b206865726520
202444
2020206966
70696e672e
20776974686f75742063
636c7564656420
7320736f6d657468696e67
20702e6d2e
0a6e61
2074686973207061
757020746865
735b313270745d7b
652073796e7468
726576656e74696f6e
425f
20676176
652e73
20676f20
204563
6e6978
656e2079656172
2070757265
6e206a
69626c652066
6f6e65206465
64732074686174
2e2048652068
206f66204a
2d63616c6c6564
20696e6a656374696f6e20
476f642c
2e222022596f75
4b79
7265626f
7265636570746f72
636f6d70617265642077697468207468
0a0a506172
35202d
7320647261
4f7267616e697a6174696f6e
6f6d70616374
676e616e7420
746865722064
322053
6f6769
20746865206c61
6e650a
7468616c
0a2d31
2259656168
20202864
3b0a20202020
7365642063
6e2e222022
742c2061
4879
2066696e6420616e
20727573
206e616d653d
0a0a4c69
20616e616c
4e6574776f726b
72652033
6163637572617465
3c6c69
666f72206b
6f7269616c
616c20636f6e64
6c2e2032
313829
746576
6c6f676963616c20
20696e6a656374
6420746561
5f707265
70616e20636c
6c20616374696f6e
57415252414e54
2e2053757070
204e41
7362
7761726420746f
6769726c
20616e6420776f72
69656e746c
73207465
64656e6f6d696e6174
7573696e672053
207065726d616e
7369636b
20687970
7469616e
343f0a
5c72
20666f722073657665
20556e6976
3d5c73
436f61
20746f2077686174
202d2d3e203030
20636f6e646974696f6e732c20
6b730a
20776f726b2e
65792072
206c6f6f6b696e6720
385d
207072657373757265
6c616e20
68652069732061
65206b6e6f776e
616c732074686174
20494c2d31
2c20746869732063
6169722069
4c696d6974
61757374
6f2068
6f20626567696e
206174207468652073616d65
61737369676e
2e2054686520736563
69726520746f
657262
6573746865
d1
6861742079
73207265717569726564
6c616d6d
7420726571756972
244f
204d6f6f72
672e2c20
2d202020202020202020202020
3b20692b2b29
20617070726f78696d61
6d6f737420696d70
787072657373696f6e20
70686f746f73
2043686170
697320776179
7373696f6e7320616e64
2074696d65
616976
20636f676e6974697665
2e0a0a48
09090972657475726e
65727320616e6420746865
733b2061
75616c2062
5b40423130
202d2070
616b
72616c2072
6e65642e20
20696e206865
6e743332
0a6465
69636572
4945
20616e6420706572
7473206d6179
74696e616c20
246e24
746865722077
6c61696d73
6e6967687420
616374206f6e
7465206e6f
232323
696d7065
2c206f7574
7b627d
7472696573
6f6e647320
2061206d6f
7061727469636c657320
6f72726573706f
2069732070726f7669646564
382061
343120
742074686520746f70
68657220636f6d
616c20696d70
6420746f2074616b65
696e672c20736f
616d650a
616b20
6f6d207468
7920746f2067
7920746f20
6f646473
63657373696f
0a5c6e
6f6e2d61
6e73696269
732061626f757420
69736d206f
206f6e65
7469626c65
6e2e0a
25
206372697469636973
6f6ee280
7065726174696f6e
65736372696265
6e653b
7920616761696e7374
6666696365206f
61626c6528
29203d3e
7a6120
3463
732e205468652063
656469746564
7320616c6f6e67
4168
616e742773
79626f64
415259
20636f726e65
2070726f746f
2c206669
20286772
696f6e20647572696e67
65736964656e63
65727320666f72
207361696420746f
636f6e74726f6c6c65
416e20696e
6b7374
206465636964
3a0a0a596f75
20736f2074686579
54686520756e
727769
75616c697a65
733030
436f
69676e6d656e74
6e64657265
616c6c79207369
617272696167
65766973
7468202a
2e20496e207468652063
79206c6f776572
486520
206d656e74616c
206e65617220746865
6e6e65722c
2075706f6e
617920666f72
652050726f
29207b0a20202020202020
2b2d2d2d2d2d2d2d
61676520
5f6f62
6368656d6973747279
742073757265
6c207769746820
6420676c
687320616e64
20696e737472756374696f6e
206c617267656c79
6e747329
7374656c6c617220
20746f206f62
73706563
0a416464
534953
6974746c65
6865206c61
20626c6f6f6420
736564206869
5f707472
6964652c20
736f6369617465642077697468207468
69656420746865
0a0a5468652065
20616e64207468652069
73792c
30340a
637562
63617264696f76617363756c61
6e2e2054
6f7264696e61727920
3b2069203c
206f72206e6f74
2c20746865204d
20446570617274
440a
536f75746865726e
6f2062652061
746f205c
64756c
2d2d2d2d2d202d2d2d2d2d2d
4368696e657365
4d656d62
2074686520626967
7265736f72
303930
70756c6c65
20616e64206f7468657273
732e61
696e697465
64732066
650a0a43
66756c6c
6e6469636573
2062656e656669747320
2049642e20617420
6c7920696e637265617365
2074686520656666656374697665
7920617320746865
65677265
270a202020202020
65206170706c69
6d736769642022
62617267
616c206e6574776f726b
656e2c20
74206d6574686f64
5374657665
20616273656e74
69636b7320
746f636f
20666f726d206f6620
6f70206f6620
79206c696d6974
6963756c74757265
486f6d65
2d2d2d2d2d2d2d2d0a0a57
73206174206120
203429
206f6e20626f7468
652077617920
65736f7274
746963617465
656e63652c
6173742d
313033
20746865206f7574
2c205b404352
2062696f6c6f67
722074726561746d656e74
792070726f626c656d
2d6272
6d70696e6720
766974792c
20636f6d706c
20746f203130
2063656e747572
732073686f
223c
20766974616d696e
7573206265
73206f66207468652067
2070656f706c65207769746820
207265737065
696e73756666696369656e74
696320616369
74206869
206d6574616c
20202020202020202020202020202066
417070656c6c616e7420
206f6620746865207665
666c657869
0a0a2323232323
245c64656c7461
7d242077
207072652d
757374207265
6e6f726d6f
206f6620796f7572
20657868
6f757220616e
7320657870657269656e6365
63656e6172696f
290a2020202020202020202020202020
7265636f766572
70206174
206c696b65207468
6f6e646572696e67
20202069
746f7274
204a6f7365
7320726567756c61
73697465206f6620
61636b
69747320666f72
310a57686174206973
0a0a496e7465
746f7269616c
65727665722e
69640a
20696e657175616c697479
67206c69
6563746976
617574686f7269
5c64
2248
7320416374
7527
656d2e
722047
6e2042
82c383
746f20737572
2077697468207061
206672617564
706f776572206f66
77204a
6e616c64
736d61727420
676820616e64
732061626f76
6e766573746d656e74
77697374
202020206469
67656e6f
0a0a224974
6e7d7b2d
6f6c656e63
74696f6e2e2049
656e74206265
726565207469
6973206f
696f6e2041
696e67206175
2066726f6d2065616368
292e20546865
69666620
6e732077697468
696e696e6720696e
353332
4061
6c656769736c6174696f6e
6f6d696e61746f72
2020202a0a
656967687420
756c6174696f6e
686e6f6c
65707461
20636f7572
6173696f6e
69732c20
206f7665722074696d
2064656d
72292c
67657269
756d206f6620
662036
652074726561746564
2042696c
656420636c61
20746572726f726973
20202042
6572736961
72792c2069
20617420616e
20636c696d617465
7920636f6d70
20746865206669
697374696373
6769
7465722065
437573746f6d
79206d6179
206e6f746564207468617420
2c206f
322e38
2e20546865726520
697320766572
6f6e73747261
6c6163656d656e74
202020202039
2074656c6c696e6720
6669656c642c
616e3a
6170706172
7572792e
777261
20746573745f
222074
20612063617365
206e6577206c
206c6f6f73
6574696d65
20696d706f727461
666672
2c20796574
342e31
756e642069
61726974
20617420616e79
2d0a0a
70733a2f2f
20796f7520746f
64696e672061
20636f6d7061726973
2d696e7465
206469736b
726f6d696e656e7420
6c6b696e67
2c20666f6c6c6f77656420627920
2f646174
776f6e64
7220657420616c
7320666f722065
20746865206368617267
20746f20726f
4620544845
672ec2a0
202020206966202821
626574776565
6420776974
7570732061
83c383c282
537069
20696e667261
66756e64656420
696e65732c
292e204173
76656e20696e
20737566666572696e67
2069742077697468
656420746f20746865
20616c7265616479206265
756e7369676e656420
72616e73706172656e74
6e2ce2809d
636b73
566963746f72
74206269
74204275
20646f65732069
20796f757273656c6620
20746f2073747564
79207468657265
204a757374696365
666f726d616c20
746f7279
2074656d706f
606060
20616e64206f7468
20736368656475
7072696e6369706c65
65723b
247c
7920737563
206368616c6c656e67696e6720
69657320616e6420
612e2054686520
796e616d696373
6f6e20707265
323931
2429
20746f206578706c61696e
6f7363
37342c
2043756c
726c6579
2061636365737320
202a62
64656420746f2061
73682e20
69616e732061
792e2050
4949
7373696f6e20616e64
2420666f722061
696e67206465
6965642061
6c69636b20
6c6573206f66
437265646974
207477697374
6f6963
6f746167
20666f6c6c6f77696e67
207265706c61
0a202020207d0a0a202020
6e76656c6f70
6572207468616e
733a0a0a
0a0a4865
206973737565732e
206e65772073
6f6174
20796561722069
616d736d6174
5f325c
62696e2f
65656b7d0a2020
20616e642c2069
696e67206861
73682077
6d656e74656420
7175657374696f6e73
776966
727365206f66
0a70
666c756964
6f756c64206e6f742062
69616e2061
6c6573732065
6e2074686520636f72
5d3b
64204272
20737570706c69
6f7273206861
2c206275742072
2068656c707320
65732032
20312d
75626c6963204c
736b20666f72
646f7a
6520736561
6179206974
20746865204d69
69676765
5769746869
2020696e74
68696e6720666f72
626c652d
74696761746564
5c506869
2077617320676f696e6720746f
2c203220
6c2e2057
793f22
2061626f7574
696e20616e79
696e67732061726520
6e2074686520626173
6f6d65207468
20696e646976696475616c7320
6578706563
65786173
61207661
646573637269626564
20696e20626f746820
656c6c2070
416d65
6970706f
7d5f
20202020202020207061
78706f73757265
20696e6372656173696e676c79
2e3231
7320627920746865
6379636c657320
6e20616c746572
20746f20646f206974
20313937
6578706c61696e656420
736162
436f6c6c6563
2f6a61
2054696d
206861766520
6578636c7564
686572206f77
657265642077697468
0a202069662028
652920616e64
546869
206b6579
3135206d
73616c6520
696e6720636f75
2074686520706f73736962696c697479
6b6167657b61
0a466f7220
616e2047
7374796c653d
696e652061
6e746572636570
20636f6d706c61696e74
207468617420706f
c297
2066696e61
73206f722070
6e696e672c20
766573206f6620
6e2068617665
20576573746572
205265616c
2e0a2020202020202020
4520
26203d20
676f726f
292e2045
343636
6f6e206d61
7320666f722070
726b73
206f6620736f6369
733e0a2020
2063616e2062652075736564
20546178
2d2d2d43
206120666972
20416273
72653e
6b65642068
20636f656666696369656e747320
696d756c74616e656f7573
72616666696320
20626568696e64207468
642c20
36746820
74202d
6e6f746520
6e746572
2077616c6b656420
636f6e63726574
61742035
732073686f776e
20616c6c65676174696f6e
696669656420627920
7075626c696320696e
412073
64756c61
74696320
5379737465
637573
31302e20
2c75
7d207d
20746f2074686f73
207075626c6963
20686f757365686f6c64
626220
652073746172746564
72656e74
73746974757465
746865792068617665
20746f20666c
52454144
61207065
7065726f78
6172742d
6e732e2049
5d5c5d2e2054
207765207365
576879
792062656361
657220737472
69732028
723e
206d616e7920
68657265207468
2073686f776e20746f
793f
496f7761
2077726f
2a2045
33352c20
6177617920
73796d6d
6f75736c
202020202d2d
653e0a202020203c
206865722063
206c756e6368
6e766f
616e206f7574
613e20
555341
6f20736169
333339
202e
0a0a4d72
657920776f756c64
737572616e6365
20736f2d63616c6c656420
2074616b696e67
2050726f6772616d
737465726461
6c6c206a
7665206172
78657263697365
6e20636f6e7461696e
202c0a
2076656869636c
20746f20646574656374
696e636f72706f72
20616e616c79736973206f6620
4a2e2c20
333720
97e3
642064
0a4a6f
302050
206e616d657370616365
75616c6c79
2e0a0a486520
74206c6573
636f72726563746c7920
206c6f6e6765722074
722077
742074686520707265
2073686f776e2069
20616e2022
2063656e74726520
74682e0a0a
74656e73696f6e
616c2070726f7465
65656e207468
206f70706f7274756e69747920746f
323933
732061726520616c736f
206163636570746564
73206f662050
6164646564
726573742c
31352e
3b202f2f
6e64696e6720746f
4173736f6369617465
732729
45787465726e
7479706963
69632049
204d616b
642066696e64
222c0a20202020202022
6167696320
20636f6e7472696275746564
13
6973206166
2e0a0a596f7520
6e20696e666f726d
7265666572726564
20696d6167657320
292c0a20202020202020
20766f6c746167
496e6974
4c59
6520636f756c64
2073686f756c642061
2076696f
65617365732c
6e697479206f66
207363686f6f6c7320
7461626c652e
73206469766964
646f7468
206f72207472
616b6573206120
333334
2074686520696e74656772
616b6520796f75
696c61746572616c20
696f6e20616e
6e616d657370616365
684d
6a616e
732c20686f77
207374617465206f66
657363617065
746f206469
53616d706c65
746572207761
20796f752e222022
556e63
20616e6420616e74
ce94
68727366737d
353238
656c6567
6e63652074
6e6564
2062656361757365206f6620
2c20616e642065
6e204869
640a202020202020202020
20746f207477
206f6620746865207363
63757272656e742073
73207468652070726f
73656c766573
6e656f7573
206e6f742076
20746f20726564756365
2064697363757373696f6e73
746820746f
206d61792068617665
696e2042
746f7261676520
6e673b
75732070726f
20736f64
730a0a45
20757365206f
6520636c61696d
6f6e652072
79696e672063
65742e0a0a
732e6f72672f
20616e6420667265
203d2066616c73
2068617665206265656e206465
50726f67
6c61626f726174696f6e
6e205c5b
7374206d6f
63653a
7761726465
2077652065
7320416c
7374727563747572657320
69737375
43484152
6f6e74656e64
656d696320
766963746f72
20696e6865726974
5c7573657061636b6167657b
52524f52
2c207768656e207468
6572697a656420
20616e64207461
6f746865722076
7a2e20
61733a
455155
205379737465
723e0a2020202020202020
20666f72206f74686572
206974656d73
6c792067
672e63
67207570
7920646563
666f7263696e67
636c6f75
652d63
61746976652073
662022
746174652061
7d5c656e647b
20746865204e6174696f6e616c
7072656361
2e20546865206c6f
656e642c20
3c746420636c617373
73736164
206669656c6420
206279206120
20737570706f7274
206f662052
20696e206d616e
656e740a
6f6f6b696e
3c7265
466f722069
7374206173
2069742e22
62657261
20746865206b69
686e69
3f220a
206f6e206d65
2e20412070
206272696e67696e67
2061726520636f
6174687d0a2020202020
657220616761696e
206120646563
206465616c
6368206265
74696679
20616e7469626f64
68656f
6f6c64696e67207468
2069742e20
2d7069
20200a20202020
2d743030
206f75742e20
637265617469766520
2070726f647563746976
2a752a
6c293b
63757420
6566656e63
205250
6d65616e7320
6e7327
206465736372696265642061
e2809d2068
7761792066726f6d
20726573706f6e736573
6c657665
2e220a0a49
2a2069
313220
20612076
2d646f
65642073706563
6a65637465642074
65726f75
20746f207465737420
697a6174696f6e2061
2e20417373
2073616d6520
617374206f6e
70653d226d
20736561736f6e20
20676c7574
73206f6620616e20
497420686173206265
687765
6374696f6e73
73656174
5c70695f
7320706f7374
2070726f6772657373
2c2073756767657374696e67
2070726f636564
726f6379
313135
616c70686129
4f6c6420
20746865207570
2061207061
456173746572
2020202020200a0a
725f73
7473206279
636f756e742c
c3a1c2bb
757373656c
726f7365
636b6c6573
206173736f636961746564
20283130
656d2073
6d69786564
67657454
732d6c
206174207468652074696d
6120776865
7261696e2061
425920
5f6368
c282c383c283
7565206f66
657363
69636c657320
73776f7264
626c616e6b
6d652053
696e20776869636820
7665722c20
616d696c696573
73206f6e207468
6167656420696e
656172732e0a0a
31332020
74696f6e20697320
206c616e6473
53756d6d61
20696e207468657365
206f662074686520706172
746f61
207365656d20746f
6f75736520
686973206a
204e464c
3c6120687265663d222e2e2f2e2e2f
2f74
636f6e666967
696c6c696f
6374732077697468
6e205275
742c206f
6172696e
206f6e63
746d656e7420
6e207369
2065616368206f66
6865207374617274
6b6564206279
0a2f2f20
622a
6374656420696e
69732072656c
6f772e20
7361746973
72740a0a
6520636c61696d73
61646865
2073706163652c
747572657320616e64
206a6f75726e6579
5920
207265736964656e6365
3d20312e
6c2077617320
67656e746c65
444320
6e7665727365
809d20
5765646e657364617920
2073746f72657320
68617065
696e68696269746f72
6c616e6365
6e206c6576656c
31302520
6f756e6461726965
206d69746f63686f6e647269616c20
6d6564696174
65207265636f6d6d656e64
2064657369676e2061
4920646f6e2774207468696e6b
61647265
6e204672616e63
7972
74696e67207468656d
222076
7320287468
20666174686572
65642052
4c6574277320
6368616c6c
756464656e6c79
206675726e69
5f7065
20322c
7269746f6e
2c2069732074
707573
3e0d0a20202020202020
65617273
20616371756972
2074686174206d75
206861726420
6f75746865
6c65732e
20696620796f752068617665
310a202020
202020202020202024
61696e6520
75720a
30203020
74682e20546865
2074686520706172616d6574
24240a0a
656420626f
6d617269
6572207573
6ee2809974
20c2b0
2074686579206361
206869732077696665
4d6174657269616c
696f6e207b23736563
2432
2073656e7369746976
4e6f6e
696665206f66
206861
6861742c20
697a656420696e20
654c61
6a7572
70657263656e74
35297b7265662d747970653d22
3d222e2e2f2e2e
20526963686172
54616d
53746576656e
657175696c6962726975
6b652049
73656c65637465
205553
4920686176652061
30300a
3a0a0a5468
7320746865206e756d626572206f66
6865722077697468
636570
2063656e7472616c
206279207468652053
6f6e6f7573
207468652073757266616365
20616e64207468652070726f
6465722069
75706572696f72
696e6720617265
6e75616c6c79
734f
293a0a20202020
6c20736169
6e746972
2061726368
7061636b65
206261636b20616e64
7375726765
4865792c
2074686520526f
20636f6d70656c
206c756d696e
756e636f6d
61206261636b
6d6c
70
22687474703a2f2f777777
20536f75
6f727475
6174206372
6e20736574
206d6f6e74686c79
6573206869
662061206d61
20202020202020202032
2c2073756368
5a75
5e6b
6c6520726f
6d656e7420696e20
20616e64206e6f7720
4128
68696c6472656e20
20302020
656e2c
2d6d6174657269616c227d29
616c7973
2f6769746875
656e7a796d6520
73206d6574686f
7320686173206265656e
2d206c
6520686173206e6f
416461707465
20636f6c6c656374656420
74656d70657261747572
20696e207468652043
206d6f6c6563756c
2a2a37
696e672061207365
206578706c61696e
656e74657273
6c616e677561676573
090909202020
766973696f6e2c
696f6e2043
2c20776520686176
206f662074686520636f6d
72617065
726d7320
6869646465
496e7465726e
732074686174206361
6a29
20746f2062652068
20746f206d616e
6520776f726b696e67
3661
666f726d756c6174696f6e
303f0a
742070617373
73657428
6f6d652066
686f7720746865
64696461
2d2d2d2d2d20
0a0a2f
74656e6365
6c65642062
20282a6e
20657374696d617465
292c2070
0a617420
20616e64206573
74726174696f
372e20
726d69
7220627261
206f662077
2070617469656e74732028
29207b0a09090909
496e666f
697320436f
657373696f6e2c
7768696368206d6179
6865206d69
696d696e6174696f6e
65772050
2420546865
2061732063
2063616e206669
206275742070
70757420696e
202a48
6529207b0a20202020
2063726f73
206f74686572732e
7665642062
206669727374206465
68616e65
726520646f696e67
20696d6167
6e206578747261
435f7b
636b2e
2c2220686520736169642e
732c20616e64
67656e65726174696f6e206f6620
2077696e64
4865616465
3b0d0a202020202020
596f752073686f756c64
20697420636f756c64
7320726973
6f727420
0a4d65
64290a
6428
6d756c617465
20636c617373696320
756666696369656e74
746f6d79
696e65642062
772c20746865
21e2809d
4d616a6f72
7279206f662074686520
93
2067656f6772617068
2062652061626c6520746f20
206f66207468696e
7020776974
455445
332c2031
206120686f
207374656d
29202d
767920
7265206e6f
73202874
745f66
66696c656e
74206f72
796461
6963697479
20646966666572656e7469616c
65206f66207468656972
61726469
6461792e
6976656c79
20696e76657273
6d65206f7574
616365206f66
6974792066
722e2044
09090972657475726e20
206261736564206f6e2061
796d7d200a20
ceb120
2074686174206461
666572656e746961
2074686f73652066
616e6b73
20696e74657265737473
7d293b0a2020
2076696465
616c6c207468657365
7274616e
20706179696e67
342e205468
666f726d
206973206e6f7720
73207479706963616c
736f6e696e67
2074686569722072
2c207765207573
207069636b656420776974
65732920
6e206d79
68206c
2070656f706c652069
204752
284a
20202020202020202020202020202050
73207374617274
53756e64
383229
20687474703a2f2f7777772e
492077
20436f6d70616e
696e67207468652062
646570656e64696e67206f6e20746865
20616e64203120
6420636f
206162756e64616e
657261626c65
6967616e
20687964726f67656e20
6e732e
