642c20796f75
207d0a0a2020
2049207761732061
5c5d2920
0a5761
353f0a
20696e20746865206e65
66757274686572
20746865207175616e74
20696e667261
226661
6e6f772068
2c20696e636c
7468696e2061
70742c20
72656420696e2061
682063
6d696c617220746f
20696e20676f
696f6e2c0a
657220636f6e7472
63792061
61736520616e6420
642063616c6c
2070657263656e74616765206f6620
696e6473206f
20776173206c69
652062726f756768
6520436f6e74
207761732074686520
6f72207768696368
6c697365
7269616e63
0a5468617420
6572207069
7468616e2031
73206173736f
696e672061726520
737461746573207468617420
782066
62206f662073657175656e63
6561726c69
28722920
73656374696f6e73
616964207468
61732077656c6c20
616e206861
656e204c
0a205c
6f6e2c2065
6b6579776f72
2d6d6174657269616c
6469766973
74696320
2073696e6365
554e20
6e206173207468
6e20646576656c6f70
617070726f70
6861726420
2073657420
5b4052
713a
0a0a5468652069
20746f6d6f72726f77
616e20416d65726963
626c65
6573202020202020
70653d22726566
6164652075
20766572792070
0a4861
2072657665616c6564207468
737570706f7274656420627920
696e7d
20596f7572
582e
6f6e2072656c
7420707265
4d3f
3b2069203c20
6c6c206275
6c61722070726f
6f6e20617420
7468652066696c6d
7265737420746f
6f7420696e
5d5c5d2e205468
7374796c653d
20612062616420
4576656e2074
76652c20616e6420
6173207769
6f6f6c696e67
732075706f6e
7920646973
61726e696e
6f7220636c
206973207374696c6c
2077686f2062
205265736f
20726563
746520706f
48616d696c
6d65642e20
636564206d
5c656e647b646f63756d656e747d24
706c6163656d656e7420
6c626163
616e797468696e67
6c2073657276
7920796561727320
6e206973206d
696e2064
61732042
69642053
2062792061
757269746965
656e64696e672061
736f6c6174696f6e
436c69656e74
6e737472756374696f6e73
507472
696e6720696e666f726d61
66696722
74666f
6620657665
64697665
7272656c
6f6d69637320
616e740a
6e205468
6520796f752067
742720
74757279
206861766520736f6d
2074686973206173
20646f696e672074
6e2070726576696f7573
626f726465
2073686f756c64206e6f742062
2920e2
72697074
20736e6f
6174696f6e20666f7220
612070657273
61746368207468
6572792061
756e6966
76656e74696f6e20
8082
77617465722e
6f6f6420707265
706f6973
72747561
207472616e73706172
293a0a2020
64652c20616e64
6e796f
30206d696c6c
205c6f6d
656e74207061
76656c2e
6f6e44
206163636f6d706c697368
65642e2042
696e2073657665
616e2c20
656e6e61
20362c20
61742032
6c7920756e646572
65206661696c
24206f662024
656d616e
686520436f6d6d
696e207468652061
2020202020202020302e
656e2068
7469636f
203d202d332a
65616c2e
4e4e45
6c642054
20737461626c65
6f726d
20616e6420686973
6f752075
206a7564676d656e
733e0a2020202020202020
6f6f6c2e20
204173736f63696174696f6e20
6861742068617070656e
2e205768696c652074
70657465
343734
2c0a090909
6d6172696a
6865206f62736572766564
706c656d656e746564
652066656174757265
7465732063
206f6620476f64
2d747970653d22
0a202a2040
7965722069
54686520666f
7220657870657269656e63
757420696620
73796e74686573
2061206d696c
6f7265766572
6b3b0a
696c642061
2074686520666f6f
65203d20
6572736f6e2e
626f6172
655f
4542
653d226d65646961
792070726f62
20616e7465
20616761696e737420
7d0a2020
4c4c
3d0a0a546865
652e0a0ae2809c
20576179
20756e636c65
295d
6e7369
62617365642073
6d616e656e74
6f20617320746f
20736169642074686520
0a0a2020202020
e280932061
68652061637475
77656420696e
29206672
6f726b696e
83c382c282c3
2a2a20202020
656e2c20616e6420
616c7320616e
2e20536f6c76
6865206e6561
65787472656d
22293b0a20202020202020202020
6561742070
3c74
657220686973
6d616c61
67617d
20766972747561
2073657420666f72
726174696f6e2063
65636f676e
207761737465
32202d
6c65637420
65642066726f6d2074
6e64657220
20526f6d61
315d2c5b
6573636f
66207468652044
652e0a0a54686520
20646973747269637420636f757274
20746f20677261
20696e636c7573696f6e
757820
3a0a2020202020
3a5c
747261696e6564
686f6c6473
207468652070726f74
6e6b2074
636f6d6269
4c697374656e6572
6765732e20
617265206861
70726f647563746976
656d706c6f7965
207468652062616e
72742053
2070726f74656374696f6e
20202020202020202020202024
56657273696f6e20
220a2020202020
7265642062792074686520
65726e6d656e74
6f20746865206e65
4120746f
617070656c6c61
206120
68792074
69737473206f66
6f757420746865
706f7274656420746f20
2d6f6e65
3474
6c73652069
6c79206672
686f
7b5c6f7665726c696e65
5441
696e73757265
2046696e6420
2074686174207768
722c20627574
6c656d656e7465
7420746f2063
20616e796f6e6520
5c6f6d65
30206d696c6c69
20697420746f20746865
65642061726f756e
697479206f66206c
20736372
2065766572792074
20746f206e6f74
6f746865722065
6f6c0a
65642073696e6365
30302020
242062
32207965617273
617661696c61626c652e
476175737369
73736962
43616c6c62
63732c
6f69643a6c61796f75
697320737472
2e0a0a4920
6520746865206f70
72732c2074
656d7320
647563656420746865
4368726973
6572706f
207468652072657374206f66207468
636f6d706f73697465
636f6e7465787420
7320666f722061
4147
6d652066
626a65637420746f20
2069742063
6964656e74696669636174696f6e20
20696e20746865206365
79207468652055
706572666f726d
74617469632066
6c6f77696e672063
206f662074686520736f
642076616c7565
6d6174657269616c73
20696e647573747279
6328
20476f7665726e6d656e74
686174206869
20616c6c2072
6d70726f76696e67
706f727473207468
6f727320746861
20746f206f66666572
636b206f7574
7375726765
20492062656c6965
20746865206b6579
3a205b0a202020202020
204f7074696f
20646574656374696f
6565206f
742074686520656e64206f66
2020206173
7469632070726f
69626f64696573
6f772c20746865
6f726265
6c6f7320
2e2048656e63
63652073686f
6b65204d
6d656e74206d
32372d
6520636c617373696669
730a20202020202020202020
686f77206d
726520636f6c
206963
696c642073
6163636570746162
0a202020202020202064
7273206f6e2074686520
206e6f74
6520747265
656173652061
2070726f6772616d6d
766579
61697420
65732c2068
6d706c696361746564
2070726163746963616c
7276652074686520
20696d70616374206f6620
202020202020202f
726d6974
6f2077697468207468
2d64696d656e73696f6e616c20
207375636365737366756c20
20796f75207468
69676e6174757265
70747d0a202020
696e652074
666f722069
7265612e
734e616d
6573736c
74657320
7269656420746f
5f6c6973
7920616c73
636f6d65732066
61737365642074
72656420627920746865
656c656d656e7473
317d0a3d3d3d3d3d3d
66206665
616e64207468617420746865
7769736820
e58f
0a0a54686174
6d61696e2061
2061626f757420776861
206b696e6473206f66
7265206f6e6c79
6172657073
61206d656d
2065786572
2073616c61
2061742034
3120202020202020
746572697a61
737d0a202020202020
207374696d756c61
696564207769746820
2077686963682067
72616d65776f726b20
732e205468652070
6572206f662061
2e205468697320636f
206d61792062652069
73652022
30206461797320
642063616e2062
206f72616c20
72206d656d626572
746820686f
2064657374726f7965
6164732c
6865726974
6469636174696f6e73
6f756368
65612e0a
2e7075
6c206c6f
206162
5c7573657061636b61
626e
69616e2074
65747320696e
65206f627365
6573206669
206f66206d6f72
74696d6520746f
2028612920
6e20746872656520
7572652074686174
322c2033
2d747970653d227461
7264206f66
7d5f7b7b5c
2074686572656f66
726f772e
696e746567726174696f6e
0a0a496e2061
656e74206461
9d2074
206f6e206d65
6f6e20746f2061
7420696e737461
6d616c657320
726976617469766520
0a0a486f7765766572
436f6e73657276
68656e2069
2a205c
3e3c6120
54686f6d61
27202b
30
206566666563747320
20617265207374696c6c20
6566657273
746f6b65
6d696e7574
204d6179
29207b0a090909
64646974696f6e206f6620
692065
7920746f2073
647b616c
2061206d6f6465
20646576656c6f706d656e74206f
67656e657320
7a6520746865
676c792c20
616c6c696e6720
68652059
67696e672c
737d200a202020
206c6967616e64
6d706c696573
652e0a0a53
7468726f7773
657320647572696e67
546865207368
4567
546872
616e79206d6f7265
656420746f207472
52656c65617365
4f6e65206f66207468
2068617665206d616465
66206f6e6c
0a202020207d0a0a202020202f
652063616e2062
6e6f636b
652076657274
20464c
636575746963616c
6572726f72
6720616e642063
4b6861
72204e6f
74686f7567
6768207072
746f207363
6520726571756972
6e737472756374696f6e7320
2d7363616c6520
656967656e
62792069
6164732061
202020202074
616c20696e666f726d6174696f
652c206578
6f75206a757374
6e204665
686520736561726368
29290a2020
6e672070656f70
20202020737472
20746865207072696d617279
616c652069
2e0a0a596f7520
6c6174696f6e2c
646520796f75
2773206265
6d656e74206f662073
20746865207765696768
69747320616e
656d7068617369
6c616e6b
7267656f
353330
74206f66206465
345e
68657261706575746963
6f74682074686520
6420617320746865
6f756c64206d616b6520
6f7572636520636f
74656e64696e
2073616c6520
65656e207365
206f6620636f6e74
6f736570
746c652062
6120616e64207468
6f207468696e
74657265
2c207768696368206361
2070726f70657274696573206f6620
7232
63616c63756c617469
2066616d69
746963206d61
2074686520706f73736962696c697479
61736b696e67
6861743f2220
20636f6d706f6e656e7420
20696e20746865206772
7320616e6420746861
686f6f64206f
6520666577
65637475
75732066
404f76657272696465
20617265207375
2061730a
6970206265747765656e
6e2c20746869
6e637920696e
2f706c
0a0a54686520617574686f72
6e642064657269
63796c
20202020202020206173
6c6e657373
6973206c696b656c79
706c617973
6d70617269736f6e
726d696e65
6974652072
7965617273206167
20776861742073
2070726564696374656420
65617679
74686520617070
20696e746572666163
20746f2070757420
612e0a0a54
7973796d7d
726b2064
742063686172
68616d20
662055
20636f6e73656e7420
6e616c6974
652073686f77
6730
737761
20202031202020202020
68696e672062
646965642069
2047617264
7065207468
732074686572652061
6c6c206769
746573207768
64204669
6f6e2e204d
697320706f737369
626c616d65
4a6170616e65736520
206261636b2069
72746f20
6f75726e616c6973
6f6d706c6574696f6e
7272617928
6f722e0a0a
206f6620696e666f
6c657661746564
2e6822
0a3c74
206d65616e73207468
20747261696e65
72656420776974
302e3030303030
20696e76617269
20636f6e666964
696e746167
20616363
3461
642064657269766174
656e6761
395d5c5d
6420666f7220746865
6520746861742069
6573206974
65722e636f
696e672074686973
2f6b
616e74696f78696461
73746564206f6e20
244f
6d65746164
20736368656475
7363726962652074686520
20686973206865
6e6420616e2069
746f7070
222c0a20202020202022
7761792066726f6d2074
20696e204669672e
2061207765656b
6e2c206265
6f20617373657373
6665726564
54686520666f6c6c6f77696e67
2920666f72
20202020202049
6c657074
6520696e2065
207268
206e65772061
20243530
6b6c696e
312e3220
2e20506f
3029202020
205a6f
207363656e617269
29222022
6573736675
686963682077
505320
75726973646963
6e64726f69643a
63616c20636f
73207265676172
756c617220696e
662e5f
20496e20636f6e
6469766973696f6e20
7920626f74
6e637265646962
616c6c65676564
2c20616c
756e6974696573
6e656420666f
0a0a4576
43617468
20696e205b4669
74656420776974682074686520
686174206865206861
2e20466f722074686520
646f74732c
6320616e64
466f6c
6179277320
20746f206275696c6420
2f2f2063
7320746f20646f
206465736372696265642061
79207075
2d6e
616861
287629
206c6173742073
6f6e20746f2062
20746f206164647265737320
2077696465
656669
6f737420
756f75736c
0a0a5461
696e2074686520666f726d
6f6f6b2c
7061626c65
2074686572652c20
74206f6e65
656170
726e6579
61792028
526564
2e0a0a54686973
20414e4420
20666f726d6174696f6e206f
20696d706c616e
6e6765726f
79736973206f6620
65206c616e67756167
2d6272
207573696e672073
2e0a0a4c
616369
697320616c726561647920
743e20
656e6420616e
64207374617465
652066696e64
6368207361
20202c20
20616e64206e65
6520696e68696269746f72
6d69636f6e64
642ee2809d0a
65732c2079
446566656e64
4974657261
5b404239
266e6273703b3c
207468652033
65207761732063
7d0a0a202020202020202020
2070617474
66696c652e
6d652074686520
656e2069742063
6173206f6e6520
64766572736520
6d736273797d0a202020202020
737469636b20
6f776c20
6c20656e657267
70756c61
6f6e20616e642061
6e69746564
676f6f676c
75726b6579
652046
635f73
206d616b696e672069
6c6c207468652077
6973737565732c20
45203d
6421
2074686f7365207769746820
7465616368657220
616e64207468652074
7920696e746f207468
20706173736564
67207761
6d6975
6865206973
7469632073
6d616e20616e6420
6574615f7b
5c2a202020
696e20737563682061
20687964726f6765
62726f77736572
65712031
616e6e696e67
646174696f6e206f66
7835
69656c6465
706972697475
6e657870
6f77657266
73206974206973
7b776964
5c626567696e7b616c69676e6564
206272656173742063616e636572
696e20707269
6520616d6f
20686973206c69
68617070656e696e67
61626f6c6963
615f20
20696d706f7274616e
5c646f63756d656e
20737570706c656d656e
636f6e74726f6c6c656420
6f20636f6c6c65
652063726564
76656420627920746865
2073756767657374
20756e64657277
20646973656173652c20
6e74656e
656374656420627920746865
203838
204d6f
6d61636f
6963655f
72206f6e20
6e79207061
20746865206c65667420
636f6d65207468
5361747572646179
746170
746564206669
74696e20
c391c282c390c2
686520636f6e
666f756e642074686174
6e64726f69643a6c61
224e6f2c
2c203332
72206875
0a0a4d75
616e20467261
6f7220746865206465
6c792064657465
393135
0a202020205c
626a6563746976
20536f
5265676973746572
726579
20736f696c
6320726567
747470733a2f
20646570617274
686520746f6c64
6d6963726f6269616c
74732073756368206173
5c6361
746368696e672074
3c73756d6d617279
2e20467572746865726d
6172616374
206c696b65
727563747572
7370656e7369
656666696369656e63
2067726170686963
0a0a436c69636b
20636f6c6c656374696f6e
7574207265706c616365
6861742069732074686520
5468696e6b
6a64
6174206973207468
6e2064656e6f6d696e6174
6572652076
7420636f756c
756374696f6e20616e64
74682046
64206c6566
6761696e2061
6d75737420
207374617920
41747472696275
727320616e642063
746875622e63
2063616e20626520757365
74e28099732077
616c20636f6e
65206d616e79
6173732e
636b64
206d6f7274616c
6d653b
6e2e2053
7b6d696e696d616c7d0a20202020
6420646966
4561726c
74457175616c
69736520616e64
6c6f6f
456c65
7269616c2077
642035
6520737072
6572207072
206c6f737365
65676172646c6573
204e6f72746820
746f67657468
206865722c
617374206e
6d6520746f2061
72616e636865
2220225768617420
63682068
6174696f6e7320616e64
6f2075736520
207468617420776173
20636f6c6f6e69
436f6e6e
616c20737562
203230313920
74206a6176
61757468656e7469636174
73706f6e736f72
6363757272656e6365
686520646567726565
6973207361
203d205b
657320616e642069
2044616c
204a7573746963
486561
2073776974
61726477
656d61726b
a06d
6e6720666f72
20636f6e7461696e6564
697320616e64
20576174
2f676f
7374727563746976
696768742068617665
652073746f
6572616c2070
20776173206e
2e20466f6c
2061732068
2063757272656e746c7920
617264656420
6f7261626c
617320646f6e
2074686520657861
616c2e20546865
6e2073797374
20646f6573206e6f742061
61742063
67726970
78696d75
7274616e6365
73206f6e2065
20726573756c74732c
742e20
72616e736974696f6e
6e797468696e67
6b2e20546865
436f6e64697469
20657874
20666f6c6c6f77696e672061
7220696d61
20696e206f72646572
696e652077686574686572
70726f6c6966657261
2054686520646973
7420686172
20202020202020202020e288
20646179732061667465
757420646f
732064657369
6573732e0a0a
5c5d2e20546865
6f7262
636363
20746f206c69
70726f2d
70706c69657320
77696c6c20636f6e
666967687465
e280997320736f
72206265747765656e
20666f756e6420696e2074686520
72696e7428
74656e6469
6520737572766579
6520636f6e73697374656e74
65706c79
496e207468697320636173652c20
72697479206f66207468
757475
6c6f7365737420
2e68746d6c223e
626c6f636b
2c206578636570
2070656f706c6520696e20
6e642e2220
20686f6d652c
626520666f72
6761696e73
63682077696c6c20
5c6d757d
78706c6f6974
4a756e652032
6574
706c69
7320746f2070726f766964
746572
6f703a
7570706c65
206265696e
2020202020202020207b
20617574686f72
696e696d616c7d0a
6c2c2070
20225368
7420636f6d706c657465
6f20636f6e6669
67696e672c20
65207b0a202020
20706f6c6963696573
0a0a536f20
53756363
73204920
7420657874
206e6f77206265
7b2d7d
696e737461
74686520636f7572736520
2073746963
616c797369732c
73636f7065206f
333238
225465
204772656174
736174696f6e73
756e6368206f66
6b65207375726520
2077652077696c6c20
742039
7465726e6574
6f742d
20636869636b
74696320636f
696e6720686561
6672696e67
20696e20686561
72616e736163
4974616c79
696e672070726f74
736869667420
6120646563
207472616e73706172656e
68756c
207468652061766572616765
757474657220
73616d652072
73656420617320
4920746f
0a0a4375
496d706f72
72666f72
6f776572206c
64206e6f7420686176
2c2061646469
4f6273
7020796f757220
20676972
72656c79206f6e
20617373697374616e
6f746520746865
7273616c20
20557064617465
2e20596f75206361
20746861742049206861
6e6b61
69c3
756c6d
30206d696e7574657320
746f20756e646572
2e72656630
6f766520746865
6d20616e6420
5f7429
73697479206f66
6c6c2e22
7420666974
466c6f72
2073757363657074
3c64697620
6361707475726564
667420746865
6261636b20696e
656c6174696f6e736869702077697468
3a6765
707329
65617375726520
5d5c5d
2f2a0a20
297b7265662d
646765206f66
6564206e65
7420766572
206f76657261
20202020202020202070
6170747572
5b45
746865206578697374
6520746861
6d20746f20746865
2067616d657320
65747269
5c6f70657261746f726e616d657b
646961
686f2077
696e6f2061
6520696e73696465
72656c6961626c
497420776f756c
7273206279
732070726f76696465
6c6974746c6520626974
31392c20
656e6174
5c50
2e20496e2074686973
6f7468656c
6261736520
20696e686572
7320646966666572656e7420
37c2
636173652077
6c696e6b65
206576656e2066
4b6f726561
6572696e672073
73637269626564
6e20676c
6d6f756e
6e2047
6c656e74
6f776572
6f20706572666f726d
6c656167
68206d69
696e6720616363
732c206672
74696c6c2c
20706c61736d61
72202f
206d6174726978
70656369616c6c
69732065717561
6120746561
6f737420726563
656d6f766564
67657269
616363656c
20737572666163
2220225768
20496e746572657374
6f72656f7665722c
65656e2063
206f75747075
686973206173
20746f6d6f7272
d18f
0a0a2a
756d2061
61736d69
7468696e672061
6c73652c
4d20616e64
6963756c61722c20
2069736c61
746865206d6f6e
20706f6c6974696373
4c65742068
3934
4920646f6e
20746f2070617920
e280942061
652d66
20506c6169
65646566
736f6d657468696e67206c696b65
696f6e73206f662061
2061636869657665
627567
6c65726174
6672656520
20696e76656e74696f6e
7365732066
2d2037
65637461
2070726f647563747320
6765737465
6365730a0a
617373657373
2074686174206d616b
732c206163
74686520686973
6f726b696e67207769746820
7375627374616e7469616c
6a7573742061
2072656164696c79
726d6f72652c20746865
73756d206f66
776e2066726f6d20
65206f706572617469
207375726520
74616b652074
6e6f6d6520
73656c6620746f
61626c652077697468
2075732e20
746572696f7220
20726564756374
72652c2073
302063
546865206d61696e20
536e
535953
6c31
6e647320746861
2e2e2f2e
68616e646564
68616e646c65
696d706f7274206f72672e
6e65737320616e
2e0a45
2ee2809d205468
207768617420
6c657374207661
686520776179
74696679696e6720
6e6e6f7420
7420746865206c
6520696d70616374206f66
72656e742066
2a6320
20737563636565
7374206c61
20636f6c64
202020302e37
726d696e67
20437275
20736b696c6c
6172742077697468
73206f7074
6174696f206f66
696d70726f76656d656e74
2073696d756c74616e656f75736c79
6f2c20627574
49e2809976
6e6b732e
6b657462
6c79207265647563
20616e20686f7572
4672616d65776f72
206173736967
6163652077697468
6b2048
204953
672e61
536f757263
792070726f6475
207361797320746861
20636f6e7374616e746c79
65777269
6865722079
3d3d3d3d3d3d3d3d3d3d3d3d
652074696d6520746f
7320626563617573
0a427574
2067726561746573742063
75732043
736978
20333520
2e2054686520726573756c
20766f6c746167
206361746567
204172697a
206861746520
7274696365
6265686176696f7572
63656976696e67
6572656e63652069
727368697020
6e6420776f6d
6520666163746f72
20313239
6572732077657265
545f46
7b70
794964
7573656420696e20
2073796e64726f6d6520
72707265
2c204a65
737572652074686520
6e672061726f756e64
747970653d22726566
20746865206465746169
666f726d6572
75202b20
6e2020202020202020202020202020
63742069
20696e74657272757074
6372617a79
205370656369616c
204578656375
6f6d2044
6f726420
2d2027
206c656e64
636f6e737469747574696f6e616c20
2061206e75
2c22207361
496e746572657374
206578706c61696e207468
69657479
76696f6c656e6365
3142
73206e6f2073
65636b6564
73746c792c20
6f75206f
6b65722061
63687920
0a0a2d202020
5b4062696231
6f75736c792064
717569736974696f6e20
74207761732064
79207369676e696669
7879
6420647269
6865726520686173
696f6e206f662048
7072656361
616c6c792c20
6f20736c
312420616e6420
2057616c6c
732070617373
7468204369722e3139
6573207468617420
20616c676562726120
612048
74616c2067
636572746169
747320696e636c7564
20706879736963
20736c696465
292c20696e
75742073
61636573
6e74696f6e2072
6e20656666
43616d627269
72206e6f
6963726f73
206d656574207468
4e756d62
61726520676f
207769746820796f75
206973206e6f74207468
74757265206f66
6970706564
6c6567656e
352e35
722c2062
302e38
6f206861766520626565
6c662e20
28342920
424d
7261746573
206d656173757265206f
652c0a2020
75726561
20706f696e742069
6b73206f6e20
766963746f7279
6573206d6f
7320746865206661
6e652067
2e2048652074
65732c2049
65706172746d656e7420
20436f646520
6e65617265737420696e
6465207769
6d20686f
67732077657265
746f20666f
7265206d616e7920
206f746865722066
20746865726170
737369737461
6520707572706f7365206f66
6e746564206120
657875616c20
2e0a4c
7363686f
656e636520697320
6c6f6e67206173
6d5b
6d6d656e7420
6865206c6162
5061747465
6e616c2072
6f66207069
666f722050
6865732e
663032
76616c756174696f6e206f66
203d2050
895c3c
73776f726420
650a202a
65732c204920
6e746d656e
662068696768
744c6f
6963206d65
65722070656f706c
2066756e64616d656e74616c20
68616c6c656e67
74636c
6465207265
6e6f6c6f6779
74206c65617374
2866756e6374696f6e
73206574
6442
6b72
73696669656420
20686973206d
4f63
74696d652068
20202020342e
612e22
20616e642074686174
652074617267
6e20746865206f70
696e67206675
20283139
70726f6772
a020202020202020
20746865206d616a
652077617320696e
65636c696e65
746f20776f72
706972697475616c20
612066756e6374696f6e
61206c6f74206f66
202020202020737472
73207468652069
75702074686520
7468652043
20706572686170
6c732074686174
657220756e
20776f726b6572
2052656e
74697461
73696f6e732e20
20746f207468652061
6f702e20
20697320616c7265616479
6564292e20
20202020207d0a0a20202020
6d616c6c6573
20796f7520776572
686973206f776e
6520636f6e73696465
7369656e
7565732e
206f66206f76
6f207365
6c646e27
3b0a0a2020202020202020
6d20746f2074686520
656a656374656420
206d6f737420
20323920
20494949
616c2054
65652e0a0a
6d6f7573
206f6276696f7573
20476f6f
6574617d
616d656e64
63616e20757365
6865205269
6e74206d616e
627365
726571756972656d656e7473
6d6f7265206c696b
74207468652070726f
7920736574
2077686572652073
2063686c
6a75696365
73746963616c6c79207369
6120636f7079
2065786563757469766520
2061206d6573
20616e64207468652062
2e3431
29207b
455f
6865706174
2077696c6c207468
616e6765732061
7373206974
206f6e20616e
2065786861757374
766f6c746167
2d646973
6c696e6573
7279626f64
c283c3
6520747269
65642061626f766520
204745
e2809c6c
332c
7574746572
7920746f20696e
6e20656d70
6173206170
202020202020207d
7320666f722066
6175736573
20636f756c64206e6f74
2473
7365
7461626c652063
696e20616c6c
2d7374796c65
2072656e64
6d65722069
79207468726f7567
206675727468657220696e
6669636174696f6e20
7920696e637265617365
656564696e6773
72792c207468
6f7264696e617469
20202020202020726574
75742074686973
65787465726e
2e222022497427
2c37
202038
656e63652066
2073757276697661
6179e28099
61696c61626c
207370686572
65727320666f72
6f6f642077
6e2064697363
7072696c
204669
6d657472
2020302e34
2d636f75
2e323030
73706565636820
7765722062
203c7370616e20636c617373
656e636f756e746572
61732054
696e6773
2064726f7020
3222
646973706c61
616e64204b
69656420627920
496e20636f6e74726173742c
6f7220696e7374616e63652c
69736f6c
6372697465726961
7265207573696e6720
64696174696f
69736f6c61
207369676e65
69656e74732028
497420697320
68652067726f75
206465636c617261
2061206869
6e64656420746865
7920696e6372656173
20746f20636f6e73696465
6e796c20
77696c6c696e67
5c5c0a5c
e2809d2063
20646f63756d656e7420
20796f75722073
2369
20796f75206469
6572206472
6e737472
667420616e
616e205265
646564206f
652c204a
686973207365
20746865206479
7220657863
20777265
6c65732e20546865
2070657273
697374732c20
63636f6d7061
245c656e
207468652072656d
292e204c6574
617267652c
757320696e
2067616d652061
74696f6e206163
65206c616265
6e6f742070726f
76697374
6f776e2c
20646f63746f7220
6f6e6520696e20746865
6865206566666963
63746976652065
74696f6e616c6c7920
696e206164646974696f6e
6c6966657261
732e20596f75
617061626c
68616e6e656c20
202020696628
74652074686520
e2809c41
732c20646f
2074686579206861
20696e20612073
7468652076696374696d
736574746c656d656e7420
732077656273697465
2074687265652070
656e2031
697473206172
2068617320616c
202020202020202020202020205b
656e64657220
202020302e32
4f6e6c
20636f7572742074
6420746865207269
65206e6174696f
636b657473
686d
696e6720696e746f207468
697320706f7373
2069732070726f766964656420
72792067
74726176656c
2065737461626c6973686d656e74
735b31
7220706172656e74
2ec2a0
65207468697264
72616e73666f726d6564
62652072
0ae280a220
7420666f722069
626c652061
6e20546875
20666c6f6f64
647b646f
794c69
206d6173
0a0a476f
3e0d0a
20726573756c747320
61204465
65732070726f76
2077617320706572666f726d6564
726f73732074
5c646f63756d656e74636c6173735b
20696e666c616d6d
7264206f6e
6f6d6520746f20
4f6273657276
62626974
0a0a53696e636520
2c20706572
6c6520666f
61746f72
6f722056
65726e2062
72793b
6520636f6e74726f6c6c65
6e616c2070
7573696e672074
206f6620616c6c20746865
6d6f737420696d
62696f6c6f676963616c
6976617469
2041677265
617420686f
726974792c
65726520636f6e
70206465
6765206174
6563746f
44696e
2064656d616e6420
6d5e32
2e0a416c
756279
486179
2067656f6d
65656b65
20636c6f7564
6f7574696e6520
70726f626c656d2e
732072657665616c
6520646964206e6f74
61647669
66696e616c
6d61746862627b
696e672070
746572206f66
6169642e0a
432074
696e67206469666665
6e74656765
6e20616c6c20
696e696e672074686520
50726f706f736974696f6e
6c6f756420
73202c
5c546865
61207472616e73
2063656e7465
72792050
206469736369706c696e
726520696e636c756465
616e6420746861
706972
292068
4d722e
7363616c696e67
69636520636f
6520676f696e6720
6865206f766572616c6c
2074686520697373
616c2076616c
6f727469
2031323a
206265666f72652069
65616c2077
67657220616e64
20474e
657363726962
28766f69
7320616e64206f7468
0a6172
206173206120636f
6120766572
207261747320
7261637469636573
67617020
7220707572706f7365
436c65
68657320616e6420
7320746865206d
29290a2020202020202020
666f726d20616e
6869730a
3f22202220
72616e6365
79206f706572
6374206f662061
7573206469
6b206f6620
6520696e74657270726574
6e20436f
206472696e6b696e6720
2773206c61
20415050
7274792d
20636f6d6d697373696f6e
202020202f2a2a0a20202020
656c736520
696e6720612074
6c7d
7573657061636b6167657b61
732074686520636c6f73
20616d6f756e74206f
697468206d61
656e74207369
6c6974616e
6f206265
220a20202020202020
496e207061
7665726974
6f6f7264696e61
6374696e67
e280896d
4e2061
657373206f662074686520
20476574
3a204a
4628
62206f662073657175656e6365
e79a84
6163686520
20636f6d70616e
697a6174696f6e206f66
655f636f
2d6d6564696174
756520616e64
6f6e74737d200a2020
20696e20746865206d6f
656e737572
69746f72696e
7265642062792061
6f77207368
72657465
7320666c6f
546869732063
6c65732066726f6d20
72652074616b65
6f750a
202020207265747572
746865726d6f72
616d656e74616c
20706f696e742e20
20696e746572666572656e63
686520757365206f66
72652070617274
20746865206561726c
61626c65206361
20746865204173
652041
68696c6472656e2e
5072656d69
67726170686963616c
20656e64206f662074
63686f6c65737465726f6c
67616c6c
67616e20746f
206c6f772d
7920636f6e7461696e
742e636f6d2f
20686f757273
65206d65617375726564
7365617263682074
20726f7461
4d414c
65726520666f75
6a656374656420746f
6d76
7743
6c3d22
7572746865726d6f72
687220
69612077
206973207468652072656d61
32297b
2067726561742064
656e642074
6f696e746d656e74
6865616c74
442063
7b0d0a20
6d6574686f647320
6e20657870726573
6f7220616e79
65642073696e63
206f6620736f
7420617420746865
6174696f6e206f662063
742072756c
736964657265
6e6976657273697479206f66
656e206167
68652073686f77
7220667572
7072656669
62656420696e20
792070726f626c65
696e650a
546865204e
c283c382c283
696e67206173
20616e20617274
6a656374696f6e206f
20616e64206f7468657220
7420667265
206c696e656172
76656e756573
9461
207365706172617469
2063616e20626520666f75
2062792042
0a0a4163
496e746572657374696e67
616d706169676e20
656e6963
637d0a
6120706f7274
20313430
20776974682061
2020202020203120202020
6e616c2050
706976
4571
5768656e
2074686520726563
2066696c652e
6d756c6174696f
74686f75676820697420
6473206f6e20
6e65206265
6f6e7369646572696e6720746865
6f637472
65766f6c7574696f
6e63652c20616e64
7274206973
746e61
63756520
64656e63652074
666f726d2074
73726f6f
20686967686573742063
6e6365206f6e
2020202020202020202020202054
6c616265
5f4552
20746872656174
6775726174
636564207468
6572747320
7465722e20546865
672056
206d616465206f
797468696e672069
207075626c6963207374
6f20686176652074686520
63742065
206d616e
2057617368
20746865204c
20746865206c75
62656c696576652074686174
617269
722c
732062657477
742c2066
65642056
2e204f72
69732070726f62206f
736573206f6620
2075737561
652070726573656e74
616c697479206f6620
20696d6167696e61
6e7769
20696e20636f6d
722c2042
776f726b206973
697a6174696f6e206f66207468
20657370
5f646f
666665637473206f
20696e206d696e64
6e20616e64
61206d756368
64696e69
6920616e64
6174696e672063
67696e6e69
656e206d616465
2a56
5069
72696e7465
2d3530
7770
745469
206e756d626572206f
6974656d7320
662e2049
6e647573747269
2c20777269
3b2074686520
2062792049
206d6163726f
617420636c
636f6e74696e75652074
6f7572206578
436f6e6772657373
617267657220
696f6e206f662074
706172746963756c617220
6c696b6520616e
6d6f7469
69732076657279
333830
2077696c6c206e6f
6368206465
79206f666669
652074686520666f
206e6572
756d70656420
732072656173
207072696f7220
61726565
20646f6ee2809974206861766520
6e76656e74696f6e207265
616c206e61
4e4f5420
730a202020202020202020202020
70696c6c61
617465206d65
20696d706c696573207468
726573736573
756d707469
646572696e67207468
7563656420
74656d
68652063756c
20766172696f
74206d7920
656e652c20
732064657465726d696e65
6572636520
6e67206d61746572
7320746f207365
652c2041
e2809c4f
6973206d6f
303b
e282ac
496e2074686520636173
2c206f722063
2c2069742077696c
746f206c
207461626c
657a69
2068652069
6d616c6520
65466f72
616e616c79736973206f6620
656e742920
206d6f72652072
6c6173732c
20666f6c6c6f7773207468
696e6720616e79
74206c696d69
7370656369666963616c6c7920
6c657320746f20
74696d756c6174696f6e
70682d31
447572696e67207468
2063686f73656e20
20696e2074686520616273656e63
6e6f6d79
7320616666656374
206f63637572726564
6972206469
7433
732d3131
68657273656c66
75702061
6974696f6e206f66207468
2077697468696e206120
207261636520
70726f6d6f7465
4d6564696361
61696e7320746865
61727265
6f6e646172
207468652061707065
2074686579206e
75726974696573
62656869
6e2d6c
20616374696f
612073746f72
726e2043
20776520757365
6c6962726172
75722061
6962696c69747920
2067726561746572207468
2e32642038
68652069646561206f66
2065636f6e
2930
612066756e63
206e6f69
343220
206964
33203d20
6869732d3e
706f73746572696f
6f6c6563756c617220
2d706f736974697665
6173736f6369617465642077697468
3d302420
323830
6573706f6e64
68652050726573
206f6620776861
7265207468652066
69746520616e
6973206d75
73206f66206e
646f6d697a
33392c20
646973636f75
6e5f20
6e206c617465
7b457d
286c6f
207468652062696f
7061737420
206576656e20746865
2064726976
38202831
20656163682073
7573636c6520
2061676772656761
637572736f
206f662074686520726f
7320676f6f
74732c2063
742070
7472616e736372697074
6869732070726f62
6275742079
09726574
616c207769746820
20696e2061207072
096c
7474656420746f
20646976657273
5072696d65204d696e69737465
656e742066726f6d20
4d6f72656f7665722c20746865
205765737465726e20
79746f70
6d62657273
5c6d6174686672616b7b
2028692e652e
295c6e
6e616d653d
61726d20
83c283c3
78653278383078
6520726573747269
48617272
657265737465
742c207365
6974657220
73206f6e6520
73792e
20656c656374726f64
68616e636520
657175696c6962726975
656e74203d
2e5265
7365642061732061
70656e6420
556e6c65737320
202a2f0a2020202070
626974206f6620
6f7220696e2074
7266756c
206d756c746970
285c66726163
6865206c6f6e67
72657175
2e0a0a466f72
7269616e67
2e0a0ae2809c5468
697365617365
6c6f6f6b696e
7220667269656e
3633
6f776e206c
2257656c6c2c
207265667567
676c65206f
202020202020207c
626162696c
65207061636b
6a7573742062
7973206f
2073696e676c652070
20706c6173
6f6d652061
6f727473206f6620
6d20746f2073
642068756d616e
20746f20736f6d6520
652046726565
20697320686f77
28646f
506c65617365
6f636b
616e2061
6420736f
206d6f737420636f6d6d6f6e
6c756d65
202020e288
69736372696d696e
6d6d7574
6369656e742074
656e636520696e20746865
732c20737563682061
6d70726f76656d656e7473
7420646574
6e20496e74
6f67656e
6e73206f662074
6f677261
2074686520736f6c
6572636569766564
5c56
2074686572652068
20646f2074686973
6973206d756368
617468656d61746963616c20
696f6e7368
73696f6e206f6620746865
726f6772657373697665
20746f20636f72
7565207761
696e67206c69
74696f6e2e20546865
6d6f76656d656e74
20746865206c6966
696e642061
61746c
652063616c63756c61746564
6d792e
2e20313939
746865727320
7420726174
6e6420746865206d6f
6374696f6e2065
6c2073656e
202255
656ee28099
2c206174206c65
626f787b5c
20636c6173733d226e
6c6c617273
79207769
656e652069
7c20
e8bf
6973206472
5c73696d20
e2809d20696e
73616d706c657320
20626f7272
6f6d207468652063
2076616c756520696e20
7720776861
686973206e
20556e696f
706572666f726d6564
696e6174
7265636569766564
792e20
0a65
6b696c6c20
4d4143
686970207769
6e2070617469656e74732077
6f70656e2074
6c2e2054686520
6d656e742c20746865
6c6965732061
5468652064697374
206865616c746863
6562
20697320676f696e6720746f
6d6f726520
2620
73656173
6e63652c
74206e75
6420657669
6d61746866
6d696e61
0a646973
726570726573656e747320
2067617264656e
20426c75
2068696768207363686f6f6c
617265206173
202020202020202020202020202028
7265206772
0a20202020202a2f0a202020
7320756e69
207761792e20
696e67207477
696e6720696e666f726d6174696f
73696e6720
454f
20746f6b656e
7261697365
73686f756c642073
6974207765
6174206d6f
2074686579206f
65205768697465
206f66207269
61797320746861
2061766572616765
7265766561
7369747920696e
73206561726c
6f7274616c69747920
72616d69
6e20285c
203938
2077697468207468656d
6e64696461
656d656e7469
637473207765
20492063616e20
6565696e672074
20746f2064657465726d696e65207768
7420686f6c
74797065223a
436f6d6d69747465
6f6e20686f
0a0a4475
617228
2e204c6574
6f7865
6f6f6c2073
202020322020
206f6620746865736520
617465206f72
65686176696f72
65206f662041
20646f6573206e6f
496e206f7468657220776f7264732c20
7d7b5c73
616c206d6174
2072657665727365
6d207b
206c617267656c7920
7265636f6d6d
73206469736375
70726574
5c7661727068
662074686520696e746572
205468652047
6163682074
745f77
747970656e61
6f7220676f
6d65204d696e6973746572
2020202020202020436f
313220
696e6e657220
4529
3a2049
726465722e0a
7365637574696f6e
20746f2043
6e616c797a
74206d616b65
65662d7479
6564206974
646f696e6720736f
7865327838307839
63756c65
206c6f636174656420
65726d7320
2c20666f726d
6861726c
2c20746861
727469
323330
666f726d6174696f6e2069
2c20706172746963756c
5f4d41
757272696e67
6e2873
202a72
7220666f6c
6865207472656174
646974696f6e20746f2074
6120726573
65207072696d6520
20506c65617365
6e20313937
73206261736564206f6e20746865
20736179207468617420
6564206c
526576
20706f6f7220
74686f73652077686f
686520736169
2065636f6e6f6d69
73206f66206765
6c65676974
2074686520616c6c6567
20202020202a2f0a20202020
715f
20776f756c64206e6f7420
742e205468
652e65
6e206973206f
66742062
3d205f
6f662063
6f726d206f
2e2e2f2e2e2f2e2e2f2e2e2f2e2e2f
3d202d
696e6a7572
6974696f6e732e20
6564206174206120
7469667969
2d696a6d
6665722069
7970653d227461626c652d
77696c6c206e
652072616e6765206f66
73206172652072
6265656e2065
68206f72
656f706c652077697468
20766964656f73
6167657b77
206d7573742073
69736372
20746865206269676765737420
766f636174
7d5c6c65
6e74737d200a20202020
65746963616c6c79
6164792062
2070617373776f7264
616e616c797365
6c697374656e696e67
726f707065
6c206c696e6573
6e20746865207363
696e6720706c
697320696e20746865
667261676d
206f6620746865206172
7220616e642074686520
6520736f75726365
617469736679
696c7920616e
6e642077686f
6e746572707269
496e206f72646572
2c206365
206120706174
656420746f206861766520
73686164
7420776f726b
776520
6c6c2068617665
532e2c
6420746f206869
207468757320
73206f7574206f66
6453
6372656174652061
416e6420746861
656e746c792c20746865
223a207b0a202020202020
686520636f6e76
6520636f6e73657175656e63
20676f696e6720746f206265
2e352e
4b44
20616e79746869
68656e207368
6e6f6d
65726520696e20
6420726573756c74
6c2067726f757020
2070726973
7461696c73206f66
617070696e
207265737065637420
6e64206f75
656f757320
74657374696e
2e2049206c
4f6e6c79
70656e2061
3230303620
2074686520556e6976657273
726d696e617469
6164206465
62656c65
4e3a
79206a
7472616e73706172656e
325d29
6365737369
616e7420746f2074
72697a6174696f6e20
204920676f7420
313270745d7b6d696e
646965732e20
67696f
656420746861742061
64696361746520
3f0a0a413a0a
6f77657220696e
6f2034
6f6368
20537472696e6720
652020202020
4a6f75
6f696e742c20
696e673f2220
64652041
636f6e666967757261
5c5d2e20
756e746564
2072657072
64732c2074
342920202020
696c
7468652070726f626162696c
6d652c206275
616e676573
652c20686f77657665722c
202b203130
672043
6f6d7061726520
696e7465726661636520
6675747572652e
6220696e20
656e696f72
627461696e206120
206f7065726174
20202a2020
20747261646520
732e20416674657220
657665616c656420
6520696e207468652072
616e61676520
382c2061
64796e61
7472696f
726f6d2042
6473206f66
206f662074686520666972
6f72657469
206e616d65206f66
6420492063
2064617920
206f6620746872656520
6c202020
3e3c2f73
2420202020202020202020
31312061
686572207468616e
6f6d707574696e67
756c6c61
20666f756e642074686174207468
2f0a2020202070
746865206e6561
293b0a0a
746865205374617465
6e696d616c20
342066
2070726f74
2d6c696b
68796472
206f662061207369
736d6f6b
206f6620636f6d706c
73696f6e7320696e
697320736563
657920776572
656374206d
206f662073657665
686174206d616b6573
737420656e
6c626f
796f757220
61207368
6f63756d656e7420
74616e742070
2073686f756c64206e6f7420626520
756e747279
205c707369
73736564206173
726f666f
2e5c656e64
6520696e636c7564
20202073656c
2020202020207468
20746865792061726520
6f6e67206d
6520526f
6f6e2020
656e696e6720746f
617420686973
79696e6720666f
20313131
20737472756374
20737566
6e6e6174
7220636861726163746572
626120
622a
206974206d69676874
5573696e67
333930
73742c2061
e280a62e
69736b73
737a
4f6b
696e6365207468
7468652072656d61696e696e67
293d
732061206261
205c7269676874
726f636573
37382e
686520737461
74686520706f6c6963
696e74656c6c65637475
6365207261
666f72204d
292e676574
6573746967617465
68652072657175
656361757365206974
742074797065
2020696e74
7468652065787465
6e652c207468
6c2066
6174696f6e206f662074686520
68652066697273742074696d65
6c6e
4e6f72746865
7370697465
656e64706f69
207468616e20696e
6520646566696e69
54656d706c617465
7965722c
20343820
5c7573657061636b6167657b61
656e7420646f
64207265747572
6f706561
2074686520706f70756c61
090976
6120776572
61766520616e79
706f6c6963
476f74
6620636f6d
6c6c2074616b
736169642074686174
6520766f74
7665722e0a
20436f6c6f
69742061
696e20737562
73746c65
3d206172
2070726f647563656420627920
696d62
20466f7220696e7374616e6365
68206f6620746865
2073746174757465
20676f2e
7373696f6e20616e6420
6f2070656f706c65
61626c65206c
68656c642074686174
6c652031
33352e
7369656e74
6e732c2062
20416e642069
65206f7468
2074726561
7472696375
656420696e2074
726d2069
6e67207368
79206973737565
6b206f662074686520
2d747970653d22737570706c
7761697665
7472696e67
6720666f722061
6420726573756c
64616d6167
72616220
742e205368
73206a7573
20616e64206578706572
20416c74686f7567
6f6e28
63636f6d70616e69
6772616d206f
7374206172
65207375627374
69732075736564
616e64206f6e
252066
2c2065
702d3e
20202020202020207b
656e736974696573
616c6c2074
67656f6d65747269
65206469646e2774
612031
20736f6469756d
636f6e64697469
68696e6720696e
202a2074
7265732c20
72616d6d696e
6720746f2063
746f20697473
6d6c22
616e64726f69643a6c61796f
2074686f756768
7265636f
656420737475
696c6c2c20
657074696f
20776173206261
65722054
206e6f7274
6e206561
72696e672074686520
75697265
c2a0202020202020
696e7374616e636520
6172792062
68652073746f7279
6f756c64206c696b6520746f
20707261637469636573
28290a2020202020
73696f6e2077617320
20302030203020
6963206163696420
65207265616374
616e6469646174657320
49207361
202020200a20202020202020
20612073706563
20696e207769
776974682053
6e666572
756d656e7473
722061
20546f64
206174206d6f
616c64205472
4e6576
6f6d20746861
74206f6620686973
68652067
2a302e
4e6565
20726567696f6e206f6620
0a3c212d2d
6675
6c696e672062
72747320746865
6520496e63
697a653a20
3c6c6920636c6173733d22
0a2020202020203c2f
20482e20
2f7464
756464656e
206c6f6e67206173
742074686520436f
7970652e
74686520656e
20736f72
20666c6174
69616c20636f757274
70726f706f7274
656d706572
6e6e6120
632044
792073656c6563
6c20436f6d
722077686f
726f68696269
7361792074686174
6561746d65
7274697369
61637469766174696f
7320616e6e6f
2e2048652061
20637269746572696120
6d696e6174696e6720
756d706564
656c732066
74657220616c
65652062
74206269
2c206573
20506f
657227
6d6520616e642074
74613e
6174206f6e
20696c20
2064c3
617261626c65
0a09092020
6e6f74696e67
656e74206d65
65204d61
2061646d696e69
202020207b0a
262030
79732c20
20616e6420776f756c
5c64656c
72656272
737570706c656d
2f2f2f2f2f2f2f
20496e7374697475
6c6c206d616b6520
6f206120
6e75636c656f74
7320617070
61726e696e677320
206e6f7420696e20
6e20746869732063
73697374696e67206f
65206566666963
636174696f6e2063
6f727461626c6520
7665722c207468
20676f6e
2066696e616c20
646f2068
e289
5b67
72617465642066
616d655f
636573736172
6c7320746861
65617369
7258
6469616c6f67
6e20636f6c6c
203139
7461626c65227d
6173757269
204c74
7220616e7469
6269747261
732e20536f
0a30
4120616e6420
642062657474
7065636965
6f7572636573
726e696e6720
20707265646f6d696e
20646566696e652074686520
6561642061
7320676f696e67206f6e
76657220636f
6c20746869
757262
7561727465
303137
676e616c696e
496e20616464
20666f72206d
2074617820
20446563
6c616465
776520646964
206f6620746865204e
6163746f7220
20636f686f72
7d5e7b32
0a3b
68652065786973
20686f73706974
696f6e2074
6120636c6169
6e69
31302c20
696e67207468652043
64206164
79206c6966
20736f646975
617374207477
656d6172
3f0a0a
20696e207468652074
2a2042
20746f207374617920
622074
20616d6f756e74206f6620
656e74206f6666
65726f67656e
7374207265
20696e746f2074686520
7461636c
6520746f6f6b
6d756c6174696f6e20
652070726f66
656e636965
0a2020202020202020726574
546865206469
72206265
635f63
6e672053
204c6f63616c
76696374696d73
2077726f6e672e
69632053
7070656c6c616e7473
7b527d
207265636f726420
6e6720666163
6c2064
7472656520
666f75722d
656e61626c6564
63726561736520696e20746865
657322
666c656374
20202020202f2f2f20
6f6c206f662074
74696f6e20616e64207265
5c6f70657261746f726e616d
6520556e697665727369
204374
746f5c
e38184
5354
616d2e0a0a
7265636570746f72
54656c65
706172696e672074
207b5c6d6174
6573746d65
66726f6d2050
626f64792074
2020205c7365746c656e67
63656420
7420636f6e74726f
2020206e65
20737570706c7920
7365722e
642e204e6f
64650a2020
5c617070726f7820
6372696d696e617469
6c6974696f6e
2031302c20
6c736f2073686f
20526567696f
270a202020202020
65726e616c206c69
2e2e2061
207468696e6b2077
7220646966666572656e
732064657465726d696e65642062
20616e64206d75
6f7520636f756c
7920626c6f
652073706563
7472616974
7920736169
6320636f
20626f756e64617279
656e74656e63
7b627d
20696e2072657370
642e0a0a5468
3d22666967227d
c2b12031
616462
676973746963
6374696f6e20746f2074
656420766572
5e5b40
6768616e
616c2065787065
736861726573
20736c6963
6c69617220
74687d0a2020
6d626174
616c205c
6e20746865206e
636f6e7472617279
3d2274657874
646520
436f6e73
675d
6465727320616e64
7574696f6e2077
206372656174696e
4d6f6d
203c72
65206f70706f
204920616d206e
6e74206f6666
6563742062
6272696e6769
6c6f6f6b696e67206174
20746f204c
656172206f
656e74206c69
686f7572732e
455448
6c656e6774687b
20636f6e76657273696f6e20
7665722c2069
6761696e73742074686520
65727468656c
6e64732064
6b206966
20646566656e64616e
6973686f
6e204c61
6f7665726564
65636f6d6d656e
6174696f6e732074
656e20616c
6f637974657320
74686572652065786973
79206469646e
206974207365656d73
6f6d20
657220746865
792073696d
6e20656c
6f6e76656e
6c6c6f77732074686520
656420646f77
6e63652d
696e2074687265
72616b20
6976696e6720696e
72205361
2061732077656c6c206173
616c20616e642073
424143
65206f66206d69
206e6f746564207468
6c2065666665637473
72652068
6e65696768626f72686f6f64
652074616c
6f6f73652074
6174652c20616e64
617779
72204b
6578706f6e656e7469
6620686973
6e20616972
74656d61746963
6e6f7572
20737570706f7274206f66
656c6c6f
74206d696768742062
737461746973746963616c6c79
5c74
692f
6620746865207261
6f75727427
2063616e2049
2062756e646c
626f6469
2050657465
696e2d6c
2453
6d2c2073
615f7b
7265736572766174696f
6a20
28412920
20726f61
61696e2e0a
662063616e
6f6b206c
646961746564
6e20636572
727974
72792c2069
6820776974
2061726368697465
792c20616e642061
73747261696e73
2e0a0a56
20636f6d62696e
79206e657720
20636f6e74656d70
616c7465726564
6c64206173
2e2020202020202020202020202020
652e0a0a0a
6f6e7375
72656365697665
722050
0a2020202074
6d61746872736673
74206261636b
7574207769
6420747572
72732c20616e64
6d6d79
415220
2074686520496e7465726e
68652067726561
7320202020202020202020
686520506f
6e206f7267616e
64223a
7320746f67657468
7365206f662070
70726973696e
74206261636b20746f20
452042
7665207375
2020202020206465
c390c2bec390c2
207d20656c
656374696f6e732061
206f722062
65732c206120
275d20
302420616e6420
206c616e6420
6e7420707265
61726961626c6573
666163747561
207468652064696666
2061207061
526563656976
2063616c6c2074
617567687465
7b0d0a20202020202020
2063616e277420
206669667468
726520612073
2c20436f6c
444c
c3b3
2070726f626162696c6974
656e2043
5444
636174696e
6b6572732c
696e6428
6c42
546f776e
207765726520756e
64e280997320
0a20207b0a20
2073696e
206665656c207468
72697368
65676174697665
207370656369666963616c6c
616c697a65642074
6f66207069636b696e
6f64652069
730a3d3d3d3d3d3d
6f6369616c206d65646961
655374
0a202020202020202020202020726574
20616c6c207468
643e0a20202020202020202020
686963682c
6c79207769
6865207361696420
646972656374656420
20207072697661746520
47656e6572616c20
6b6720
74697665206461
355d28
646174612d6c6162656c3d22
6720656c
6420646574
65202869
2044657370
6f726d617428
2c20686f77657665
6320696e
204672616e636973
206163726f7373
332074
29206d
6c20636f
732077686f7365
207468652074656d70
20616c6d6f
73706972697475
697665732e20
206861766520666f756e
61726d696e
6f6666696365
54686f
64204e6f
6c6c206b
73206a7573742061
75626c6963206675
7a2a2a
64656e74616c
20205c7573657061636b6167657b
2e3737
743e
2e706e67
6f6e20706572
696e6b206974
2074686973206f
4261636b
687970657274656e7369
6174687363
627573696e65737320
206174207468652064
73205065
205042
4368726f6d
696d706c792074
6e612077
686f727365
626c652e
6f736974696f6e2e
204c6f63
2068617665206861
686f7720796f7520
302d3030
6963206163746976
7469766174656420
757365206f66
6f722065616368
6177
72206f66207265
74656420636f
73206e616d65
746573742e
68697264
2020202020202020206e
73757270726973
206368696c64686f6f
697365642069
67656e6f6d65
206578707265737365
65616b7320
2d7374617465
656c2d
0a23656e64
6f206465616c
2074616c656e
20202020616e64726f69643a
20616e20616c6c
20636861726163746572697a6564
69676820
6e20746865206761
6e204578
6174696f6e7320617265
6f756c6420796f75
737570706c65
78706c
6469726563746c
65207768656e20
6f6e2e222022
61677265656d65
6e43
73746f72792e20
207769746820726573706563
72206c69
20706c6163652069
696e636f6d65
202a20
6c7920726566
292c2077686963
686174204920686176
2073696d756c6174696f6e20
206d65646975
657273206d61
61742074686520747269
38202020202020202020202020
616e75736372697074
5562
616c207374
6f2d66
6f722074686520636f
616420616e6420
686d616e
6f6e65206973
e2809461
626567696e6e696e67206f66
7220746f2070
6e2074686520636c
7465726d696e652077
737572656d656e74
0a0a5768656e
20205265
74206170706c6963
637420636f6e
6f6e2077617320
6861766520736f
6f6e616c206f
6865206a756467
6e20746f2068
6c7429
5468726f7567
4d696e6e65
20446576
7420636174
7573207374
69742773206e6f74
6f72746162
2074727574
2077686f20686176
20636f6e6669
74206d656e
2e303120
63636f7264616e636520776974682074
6d736273797d0a
7220706172746963
2e412e20
70656369657320
4f63746f62
6573206265747765656e
6865206c6974
2063617365206f6620
676f6e6e
202020202020202020202020202076
64696669636174696f6e
2070757420
6974696f6e65
0a5c66
642077697468696e20746865
726174696f6e73206f66
79696e672c
63757069
2069662079
76616c656e6365206f6620
706172656420746f20
5f5c74
206974207365
656c792063
68657220616e
206578616d706c652c2074
206b6e6f776c
74617469766573
20746f2070726f63
6974686f757420
73696269
6f7420636f
686973207061706572
2077656c636f
7420776f72
20202020404f76657272696465
747269627574656420
63697469
2072657472696576
20746f20746865206e65617265737420
20616e64206576656e20
72766572
20215b
6d6120
2073696e676c652d
6e69746f72
68756e
636176
6f64696669656420
0a30303a
6734
20746f6f206d
204d6173
6572616c20
2066657720
2072696768742c20
20616464207468
6f74653a20
616e2070726f
6f7220616374
205c7369676d
2053746f72
300a20202020
646566696e6564206279
6265747465
2074686520646566696e69
2074686520726f61
6e652e22
75626a6563
0a46726f
20676574206f
6520726f6164
4275742c20
352e205468
746861742074696d65
207468697320636f7572
69732066756e
6c652e636f6d
2074686174206d616b65
494748
6f626c61
202d3e
696f6e2061
20746865207465726d7320696e20
20616e64206d6564
2061732077656c6c2e20
4974e280997320
20636173657320
20472e20
7365206167
6d656e74616c2063
6e746974696573
616c6c206e
7374616e74
6573652c20
696d6520746f
2061207661
696e7b6172
6f696e672069
72652074686174
6e64206f66207468
2e20436172
2074686520706172616d65746572
20746f20636f6e74696e75
437573746f
706572736f6e73
736573
74e2809973206120
6f756c642075
20726567697374
20202020202072
41207265
7b5c656e737572656d617468
0a4469
6e676520
72616c2067
657468696e
636f6d6d756e69636174696f6e7320
20646966666963756c7479
62792049
652074616b
6865722075
616c2070726f626c
6520697320612073
0a20202020202061
6c656d656e742061
6c6520
74643e0a2020202020202020
65747765656e2074776f
7420796f75206361
697374206f6620
636820776173
7468657469
202020206966202821
20796f752776
730d0a
657220657874
672074656368
616e646c696e
7c2020202020
206f6e6c79206f6e6520
2e726566
20746865206c617474
227d5d
64206c696b6520746f20
792063616c
636573207768
65647d24240a0a
20646573637269626520
20746865206e6f7469
686561642c
686f6c6c
69636961
2420636f6e
204347
2074686520617574686f7273
0a0a202020207075626c6963
62697472
63616c63
6520636c757374
6f20626567
20746172676574
76697375616c697a
5c61
2054776f20
6963205265
20363030
636c6561726c
6c6174656e
7273206e6f
2068617665206f6e
61742e2220
3320746f
616ee2809974
6e616c20436f
62652074616b
6e20746865206675
6d706c656d656e746564
6c6c2077
2c206275742072
6541
74656e742e20
222022
616e6420776173
7573746f6e
20202020202061
6865206e617475
0a2f2f202020
2e636f6d2f
656e7427
70686f7370686f72796c6174696f
69676e656420746f20
757365726e616d65
72e280997320
2065766f
383029
752063616e20
6f7220616e
2c2032303137
7320617070726f
6265636175736520
207765726520636f6d
4261636b67726f75
393437
706f696e746d65
496e206f
656564732e
73206120677265617420
6e672074696d6520
2074686520474e55
427566666572
20776861742049
74205465
20636f6e7374727563
617373696669
206d6574686f64206f
6d732c20616e6420
74696f6e616c
736574757020
6f726e69
646974696f6e73206f
74757265207265
73697374616e63652074
737461727465
6967687420666f72
270a2020202020202020
2049206469646e27
6e746572696f
7265206163
5265707265
616e657365
20202020202020206c65
6c69
796f752068
6020
20302c20
372073
20796f756e6720
6f2068617665206265656e
6d6f74696f6e20746f
20696e2077686963
6e7374616c6c6174696f6e
6865726564
6573732e20
67616e20
2043686965
7920646f65
206120626164
6666696369656e63
696e746572616374
6176652069
617274696375
2068757274
6820646966666572
73696d69
0a5468652041
6174206272
6e20616772
20756e7469
20696e207468652070617374
6963206265
2070726f626c65
2074686520666f75727468
73656e6365
6b73
2074696d656c
6564207379
20527573
726561747572
0a0a54686520666f
