695f
426973
616d70
495245
697a6174696f6e2e
0a0a6f
5f6461
206d7973656c66
41626f757420
6369736d
206164766f63617465
615f
204d75736c696d
4b42
3d27
2e205468617427
636f6c6c617073
220a2020
616c652c
617475726520
2077726f7465
20372e
6f20666f72
206e6574776f726b73
206c617374
736372697074696f6e73
636861726765
2773206578
636f6e74656e7420
6961e2809973
6f7264657273
7369676874
2061732077656c6c2e
6c617665
0a2020202020202020
476f7665726e6d656e74
205570
685d
73207b
46616374
7320756e64657220746865
2074686520706572736f6e
6f726520746865
5c27
20706f7369746976
657368
732c206f66
65727279
3230303020
6f7279206973
0a202020202020202070
61746976
20202020202020202020202020202032
2e0a0a466f7220
31c2a0
2074616c
20e2
2024665f
66652d
22202b20
41414141
2073706561
4265737420
636c6173732e
726d20616e64
65732e0a0a
2077656174686572
776f
3734
6e6729
0a0a3c
6e616c6c79
68697073
5c53
2073796d70746f6d
20706172746e6572
2e0a0a23
20746f20616464
676861
2061776172656e657373
6d6520666f72
2a2a2920
3b2044
0a0975
4545
2070726f6772616d6d696e67
6f75722c
332069
6e656c
6368696566
74207374696c6c
73746173
6c6f7765737420
7474657273207069636b656420776974
20646179732c
202864
677261
757d7d
732024
46616c7365
2061206c6f74206f6620
20697420686164
31393831
616e63652c
206f66204d69
6365206f6e
206865722e20
207468652077696e
2d332d
6f6666
2d636f6e74726f6c
612069
2049736c616d
206120626c6f
206973206e6f7420746865
2070617274206f6620
6a6f7269
20262043
697479206f6620746865
2061747472696275746573
6e69717565
6f75722064
2d0a20
3e0a202020202020
206c617267652070
7b5c737172747b
6d6f7573
20796f75722073
4a7d
696e697469616c
766973
7b0a20202020
202274
69747929
2e20497320
6f722028
32362c
20646f7365
206f6666656e7365
617373616765
20627574206e6f7420
2d706c61
2072656c6561736564
2c2074686174
20706f77
5f6e616d
ef
6520697320
6f736f6d
20707572737565
383520
6d756c74
205c5b5b404231
2c20616e6420616c6c
320a
7265652c
6974616e74
72652063
2373
20323031322c
72692c
3024
322c202d
6c696e6564
6b2063
506574
703a20
617264656e
67656e6f7573
696669656420696e
207472656e64
6965732e2054
2821
697422
204d63
73686572
362e0a0a
322031
434f50
2c205461
732e20e2809c
206d616e7920
20456173746572
2074696d652e20
207275
616e6167696e67
6620746865
7d207b
20666f7220796f752e
20616e642032
412074
616d652c
722e204c
20612048
206772616465
3a49
2c207570
2e0a54686520
6e6f772074686174
27766520
7474657220
2061742042
20696e20666176
6172792e
207265706c69636174
20737572726f756e64696e67
2064697374696e6775697368
20262620
6d62
4729
2f69
6574746572
2c20757365
205c626172
32202020202020202020
7269646573
207761732068
6974652e
2072756262
20746f6f
0a2020202020202020202020202f2f
206a7573742066
65732e2054686973
33202d2031
2074686520656666
205c74
6965732e20
20736f756e64
206f662044
207468656972206465
762e20
5433
207468617420697320
302e3235
20746f20636f6e
532e20
2c20616e79
5768656e2077
63697263756d
206c6170
72697665
65642e0a
29202b
6c6963
204c6f75
793e20
2f3132
737175617265
20202020202020202020202045
20726563616c6c
20506f7274
792026
4135
416e7469
5f454e
6e6f726d61
6967686c69676874
6f6d6572
2074726561746d656e742c
6672657175656e6379
323529
7265746963
696775
7d5f7b69
2068617665206e6f74
6974206174
2e0a0a4966
7a0a
20617262697472
207769746e6573
732e2042
20726571756972656420746f
73207065
206175746f
6e2b31
2c20616e642068
696c6c616765
202020202020203020202020202020
63746f7273
4173796e63
20616c776179732061
2d7275
2773206f6e
50726f6d
2e0a2020202020202020202020202020
206e6174696f6e
5368617265
20302c20
2f636f6e
20636f756e7479
657269616c
0a436f
20746865206e75636c65
2e205468652069
4372696d
5c0a2020202020202020
2e203131
20696e6861
4e65766572
312e38
2070616e656c
69732028
657175656e6365
206974206973206e6f74
207461636b6c65
3528
20746869732062
2e2043616c63756c617465
206879706f7468
83c383
652c2077686f
205468656e
2c22
6574686e6963
696620796f752077616e74
20636f6e747261
6564206f6e65
292c0a20202020202020
206465206c
2e2049e280996d
20636f646573
73797374656d
65722c204d
6e76
72657373
323720
31393837
2072656a656374
686d
6d656d62657220
7065616c
64697363757373
636164656d6963
285265
656e646966
2c203134
20612068
7b6d
2e20e2809c57
6c656d3a
6f7263
204f6e6c79
2c2050726f
64656c696e
7b776173
206e65696768626f72
207573656420746f20
202020202020202020205c
73203a
64203d
206b6e6f636b
0a202044
72746966696564
207061746368
707265646963
206261636b20746f
2829207b0a20202020202020
7d2c0a0909
73657276696e67
6a756e
2e6564
756d65726f7573
32202d2033
6d656e746174696f6e
7420666f7220
6e79696e67
203832
76657373656c
206f6e6520
6f7473
204974206973
666c6f6174
323635
206d696c6573
206e6f74206578
6f75726e616d656e74
2831297d
732066757274686572
746f64
547261
8083
64293b
682c20616e64
616c2076
636172
293b0a20202020
636c7562
7d295e
20313430
206f66206d69
2e2076
545e
426f7264
2c322c
6f6e73657175656e74
46697273742c
20636f6d70726f6d6973
2052757373
79746f
206661
20686f6e6f72
2076617363756c6172
20736d616c6c65737420
526f756e64
207265736f7572636573
4456
206578706f6e656e74
0a66756e6374696f6e
20616e6420736565
65786365707420
736572696f7573
302032
6f626a65637473
7269657374
64205374
73206469676974206f66
372020
72696768742e
207468616e206f6e
73746f7273
726c73
2074776f2070
5c5b73
776869
69747927
2065786375
20486f72
616772
2e204163636f7264696e676c79
65616368
20746865206c69
7265206f
0a0a526f
5c6571
75736572
203078
6f72726573706f6e64696e67
646570726976
0a20202f2a
20746f207468652070726f
20616e6420736574
54686174206973
322f32
20656e67696e656572
6c79206265
20796f75276c6c
205c6c6520
20637269746963616c
4c494e
75747261
2061626f7274696f6e
204e2d
732070726f76696465
2e672e
657466
2062726f6164
626f74746f6d20
415448
206d6972726f72
20746865206578747261
20617320612064
65787472
20726967687420
20637269
0a0a5b
20626973
6d6d6967726174696f6e
454545
2074686174206861
53484f
2e2220224974
72657475726e73
72206469
75706c
206d697373696f6e
20616e67756c6172
2245
204b65
66696c6520
74726f6e6963
746f20
2b2062
616d706c65206f66
2d6368
4544
6c6520616e64
656e74696f6e206f66
696e672077
206361757365
6e20616972
2068656176696c79
323639
436f6e74726f6c
656e666f726365
6d2076
616e204a
206120726574
656374696f6e206973
697368696e67
207468652070726f64756374696f6e
2070726179
20616e64207468656972
706c61636520746865
2070617469656e74
20697320737570706f
6253
53204f52
6520636f757274
0a0a4472
2068617665206d
205543
68656572
e2809d2c
0a2020202043
7374696e65
6172616772617068
3e0a20202020202020202020
486973746f7279
292042
72616368
68697320626f6f6b
204920676f74
332c20
6c6f6f64207072657373757265
333532
6261746368
2064616d6167
61206174
206865722068
3e0a23696e636c75646520
65772d
5f7374
696e67204d
6f737461
33322c20
6f6e672c
7d2c0a2020
4c6179
2a2a2c
7365637574696f6e
2c20537472
73206f662068
3a48
7d0a3d3d3d3d3d3d3d3d3d3d3d3d3d
696e696d
292f32
2074686520636c696e6963
715f
62696e2f
2074686520666972
686f7573652c
2066756e6374696f6e20
3c2f6469763e0a3c
20776572652077
636f6e66696775726174696f6e
53706563
6465726c79
544154
6967687422
223e0a20202020
20245c47616d6d61
72206166746572
61726e
206c6173742079656172
70706f7274756e6974696573
65207468652073616d65
63757474
73657175656e746c792c
616c20757365
424954
73756666696369656e7420746f
245c667261637b
207461
206974207761
6f6d7075746174696f6e616c
20207c
203732
6578706c61696e656420
75732073
207365766572616c
2054656c65
b4
207072696e6369706c65
686f6c6f
696f6e206173
32352c
20696e766573746967617465
6f20617265
2e0a202020202020202020202020
305d29
7479706529
206f7220756e
20686f726d6f6e65
6e6f746520746865
756e6e79
75697473
20696e73
2c2042
204e756d626572
76616c756573
2073657061726174656c79
20736574746c65
206f757420746f
736f6e206973
29206f6e
20616c69
2e0a0a42757420
4072657475726e20
746861
e280997665
2069732070617274206f66
6c696e6573
616c2044
2c204c
7465726d6564
76616c2c
6c6567
6520617070
73792c
757374726174696f6e
20202020202020202020202020202036
20594f
524941
20456e64
73656c6629
65642062792041
2773206368
50726f66
20796f75206e65
5c7072696d657d
20616e64207461
6461756768746572
3a205765
3b204d
28696e742069
696320746f
6c6970
70726f6772657373
20285c5b
206a6f6220
0a2020202020202020746869732e
6f77736b
206f662076696577
2061747472616374697665
766967
73706163652069
20746f206d616b65
20697420646f6573
782c
6564206d616e
0a202020202020
2370
2048656164
206f66207468652061
2065766f6c76
20796f7572
2070726f766964696e67
312020202020202020
20696620746865
4e4f
757272656e6379
20686176696e67206120
20776974682054
206465707468
656769736c6174757265
2056696577
616e6963
6565742c
2532
20666f722053
75626d697373
5d2e20496e
667269656e646c79
206f6620746865206761
20736f7274206f66
5346
652e204865
73206f662042
3d3024
323331
2061706172746d656e74
32372c20
6c6e28
776964676574
656420696e
76656420
766964656f
2073616c61
206f6620746865206a
706c616e746174696f6e
206c696d697473
20612063617365
696e746572
20616e64204d
67756c61
6e640a2020
2e3136
2c20522e
20656e68616e63
6f756e6420666f72
6564206265747765656e
696e6720e2809c
776973
636f7264616e6365
676c7963
656420776974682074686520
6d65616e
64756374696f6e2c
343136
697465
207468652067616d
69736369706c696e
206368726f6d6174
6f20636f6d
6174746f726e6579
616e642077
2074686520736b
206e756d62657273206f66
3a7265
65732e222022
5f6d
2062756c6c
6563726574617279
2076616c69646174696f6e
205553
616e2062
206e6f7420666f72
79206973
204a756e652032
70616464
20776f726b20746f
2073756267726f7570
7320616e20
4c656f6e
6d6f74696f6e73
7320746f6f
2c203338
756369
206162696c69747920746f
5e32
69636f6e
756e6472
5c6e657120
206d656368616e69736d73
63686f6c61
2e20526563
6e206265747765656e
204167656e63
206275636b
205374616e64617264
6c792074686174
6e742d
206b6565702074686520
273b
205253
4368696c64
4f626a
373830
6c65637420746865
323130
706c61792e
72697468
6f7879
20696e20776869636820
0a494e
2066697273742069
53746f
6f7022
20746865
706563696669636174696f6e
204e657874
2e2054686520
696e6720726573756c74
206c696e652c
73686170
4f757220
6c6f772d
495020
5f55
7461746564
286d6f64
65726c616e64
636c69707365
2068756d616e
6d2070
536f6d6574696d65
756c617465
65642061626f7665
6e672063
74206265666f7265
6e65206f66207468656d
2e28
6f6a
7368616b65
38382c20
6f675f
cebc4d
7175616e74756d
642c20
5265636f7264
31223e
6f206973
537d7d
206e756d626572
206279206974
206c696b6520796f75
5c6f6d6567617d
20537472696e67
64657369676e61746564
297d
696e2074686520636f6e74657874
20666f726d756c
6d20746f20
6520746f6f6b
652061736b6564
2e6f72672f
6f206861
222c0a20202020202020202020202022
65655f
2e2027
616e67652e
6e657373206973
2074686520616374696f6e
5d2c20616e64
4243
2d3e67
6c65732077657265
2068757362616e64
524950
2c0a2020
6f206269
756c61746f72
2064656e69
203c703e
20656e6a6f79
742066726f6d
7472616e73666f726d6564
6d706c656d656e746564
74726179
373029
20706f6c796d6572
652072656d
6e4f
656e64696e67
207468652031
2074686520747275
3a67
72696674
6c6f6e69
206e696365
3b0a
20707572706f73
5768696c6520
6c6973746564
656469617472
32382c20
6f72732e
74206f766572
6e20656666656374697665
360a
696e6720746865
7a6162
7320726567617264696e67
6564207573
2450
20636f6d706172696e67
70697261746f7279
6d65616e696e67
616e
2070617274
20626f74746c
6b20666f72
6472657373
656d7074
204261736564206f6e
287365
5f4d4f
756261
2220746865
5d5b
686572652061
696a
652063616e206265
6861742068617070656e73
6c65206f72
6970
756573
696675
6730
2069742077
63617465676f7279
6c6f776564
20796f752070
206e65636573736172
732c2061732077656c6c206173
20616e616c7973697320
696e67204a
696c
64676564
755e7b
746f756368
323035
2e2057652061
6f732c20
666c6176
444b
20696e74657273656374696f6e
20616e64207175
6275696c
62657220
2074686520636f75727365
242026
20696e20746865206172
4d6973
206d617474
757374206e6f74
6d6d61
393234
726f6e676c79
6d66
20696e766f6c76656420696e20746865
6174207468652043
4661696c
616c69747920616e64
646174652c
20416e64
70726f6772616d2c
20746865726527732061
70726f7465696e73
68656f
756e64696e6720
20202020202020202f2a
742824
207079
743a
290a53696d706c6966792028
6c6261
656c6c20696e
203d2036
20616e20617070
20612074687265
20746865207379
67656e2d
2c20666972
3b0a0a2f2a
6163636f
206f6e736574
28782920
61727465
656420616e6420
72206f66
65642073
6f206d616e79
7d41
785f31
205050
2074726164696e67
65726174697665
205c71756164
206c616b
204b6974
2073796e64726f6d65
2072657475726e696e67
646f7365
2066756e64616d656e74616c
353020
646974696f6e616c6c79
303238
6b2064
302e30303129
616461
20686973206368
7420696e2061
277320616c6c
20616e64206174
4f574e
692064
202020203a
6973206861
6d6d2e
696e67207573
20696e20706572
20746f706963
4432
656e696e67
797261
0a202a0a202a
20263d
6f6f6420
2a2a20202020
37362c
20736f756c
20776572652074
736ee2809974
20636f6e747269627574
766f69
204250
6f74726f70
696e64696e6773
482c20
6c696e6b
6176
6e7320617265
206279207468652043
617070656172
206d6573
20696e6e6f766174
6f726465722061
425554
6f736d
0a4d616e79
646f776e20616e64
7429
206d6179
0a0a4f766572
20746865206d616a6f72
222c0a20202020
3a2025
2323
5f6261
206f7264696e617279
20697320756e
436f6d706c6574
207769746820612068
2076657273757320
20706c6561
6d6972
333430
636c6173736573
20207b
2e0a0a5265666572656e6365
2e2e2f2e2e2f2e2e2f
204152
20616e642074686f7365
292e20546865
677569
206172652076657279
7374206f662061
20706172656e
20696e2070726f
69766520656666656374
484d
73207b23536563
73736973
2e20416674
20746865207072696d
693e20
2a5d7b7d20
207072696f7269
68656e73
204252
766572616765
2e205075
726973
222028
67676572
2074696d656c
4c696272617279
656c657373
702c20
292049
637265617365206f66
65662d
2077686963682074686579
20616e64207768656e
207069656365
312d31
777261
7265666572656e636520
656e7a79
206f66204e
303134
6c797a
65642064617461
2066756e6374696f6e2e20
223b0a202020202020
363330
20776f756c64206c
687d0a2020
20726568
696e2d
657665
742e2054686973
202020302e32
66203d
2c20616e7469
782a
65206279
73652f
2c20492068617665
5f6164
203d20
393735
616c2068
69656420746f
20736572766572
20612070617274
32203d
4c657474
656e646f
69612e
5c657461
20302e35
2e20205468
706172656e74
63656e73
64656420696e
204f7574
0a7472
7a6f6f
206865207761
6f7065726174696f6e
53616d706c65
3d2022
2061206c6567
6d49
20507265
0a092f2f
64652074
6d206173
393935
36342e
72757074696f6e
207761732064657465726d696e6564
697365
206973206d65
557365
69676e65
20706967
5f3220
5d2c20
2c206163636f7264696e6720746f
656e746564
3a2067
756c6c65
70696e6573
7468652070
736f6369
756d696e
20636175
656e65726174696f6e
20436f6d707574
207065726d
23706f6e652e30
79207468696e6b
6174696f6e20666f72
64756369
6964652d
3c76
3964
6c6c2c2049
2053756e646179
6c6c206f6620746865
2d43
69746c
792067
2363
2f2a2a0a202a
20746865206365
756c70
2074686520636f72
20612070
73207769746820746865
6c756e
616e747320746f
7420756e
20616e64206d61
320a0a
742074686520
6b6520696e
7265646972656374
30303033
206578706572696d656e7473
3128
666f756e646174696f6e
63616e6f
363630
206c656164657273686970
2e302028
2e3537
20696e2072656c
204672616e63
2c202020202020202020
446566656e64616e7473
203d2022
616c20746865
20486572
323730
0a546865
2e205468657265666f72652c20
3d226669
666563
656e75
6c6c6f7773
6c7920706f
746f6e2e
20646f
686563
69646963
20646576696174696f6e
206120636f75706c65
313932
292a
2070726f6475636564
206f662063
242e2054686973
68616e20
202242
20746f20726566
7463682c
65686176696f72
2070726f6265
2077686174206974
6f706c75
736b
6e206f7468657220776f726473
2c20616e64206865
7274656e
206f75742c
6f73697479
2c20616e642066
61646472
446f6374
6d617473
7b6461
655e
207769746820
4d696b65
20302c
2076616c756573206f66
2c204172
3a0a2020202020202020202020
204645
6f77
6c6f79
3b0a2020
696e7465726573746564
2077696c6c20696e
73797374656d2e
20737472657373
7420616c6c
205363686f6f6c
207072696f7220
206f662074686520707265
736575646f
25206f6620746865
5d7b7d20
2e0a0a5375
20746f2032
20616c736f20696e
682e0a
205461
20726571756573
0a0a46696e616c
5c6c6162656c7b65
466f72206578616d706c652c
5c5d2e20496e
206465737069746520746865
43206973
2077686f207265
726967687429
732e636f6d
6c696e2c
2d323031
6966202821
6c6563742061
696f6e2e0a0a
20646f776e2c
656e7369
416972
5370656369666963616c6c792c
204368
20776167
2066726f6d207468652066
5b22
2e7368
513a0a
7562
20636f6d706574696e67
6c696d697473
6172697479
206f7572206c
452b
207761732064
7468656e
6420656e6f756768
2076696577206f66
332c
20746865206d656e
696d697a65
207765726520
20666f6c6c6f772d7570
2c20746865206f6e
696e67746f6e2c
726520666f72
7374726f6e673e
613e20
207265736f6c76
20696e7465726163
20656767
68696e67
656570696e67
656420776974686f7574
2024245c6c6162656c7b6571
4c6167
20746f2024
636c65
206c6f636174696f6e
64652e20546865
7374617473
4c6f6e
6f6e6465
4f7e327e
536563726574
7d7d5c
206c61756e63686564
2e0a0a54
2064657363726962
2044617669
657474696e67732e
207365656473
72616674
7d0a0a
6d656e742e0a0a
62757420
6c616e
1e
2c207761732061
2e3635
20666f72207061
796f75206d6179
2070657273706563746976
20486f7573
616b6564
343835
2066697273742072
5f6964
666176
65722c20627574
742077696c6c206265
616e64657273
67676c65
20696e66656374696f6e
6d656e7461
6420617265
20706f6c6c75
222929
382062
206e6577737061706572
206f66203138
20686f7272
4f5445
206e6f727468
696e65206973
206973206c69
696e672e2e2e
757264
7765616b
696e6672
206f6666
730a3c
287429
20746f20646f2077697468
2c20616e64207368
207175657374696f6e6e61697265
206672616d65
323539
2d6665
5468652073616d65
20546f6f
656d6d
6f70656e73
20466172
206d6963726f62
7420686173
35352e
5c6f6d6567
69732053
636f6e737472756374696f6e20
31302e
2b2b29207b
20696e206172
207768696368206d6179
206f66207468
5e327d7b
2077617320676f696e67
20736f75676874
696e652c20
73290a0a
65642042
617520
20416d
20776520646f
206c6f776572207468616e
323f0a
7269732c
204c616e
206d6163726f7068616765
2c20302c
20696e2067
206465736372696265
2a2f20
0a0a4120
696e63656e74
73746d
732d3e
65206576656e
7220696e
20706c6179
6d61736b
20616e642056
20656e64207570
6570656e
726573756c
730a0a45
6f756e6420696e
79206e6577
67732c
20726174696f206f6620
20616c6c65676174696f6e
482c
6ee28099742068617665
6e68616e63656d656e74
437269
65722076657273696f6e
766964696e67
206d61726b6572
5468656f72656d
0a20202020202020207d
61796d656e74
20706f6c6974696369616e73
206576616c7561746520746865
696f6e2028
776569676874
4964
756273657175656e746c79
207265736964656e74
3b0a202020202020202024
206e6574
6d696c6c69
206f20
2e2054686520636f6e
20686f77206d756368
207761746368696e67
666f726d20
332028
72617669
756c74696d617465
206d652074686174
206d757461
6174207468656972
3b204e
204f72646572
4e5f7b
4b656e
6973737565
7b4c
2858
3a0a20
207375626d69
2a672a2a
746974696f6e6572
20616e6420656e64
7970657274656e73696f6e
e299
526f62657274
576527
72696566
61626c6520746f
2c20342c20
4f7468657220
2073636172
286e6577
20726563
2062726f
207468652076616c756573
2061206368696c64
73747d
76696e63
207465726d696e6174
2064756520746f20
282d34
20696e2068657220
75206e
67656f
726573706f6e7365
2e0a0a53
204c6f7320416e67656c6573
6d7072657373697665
20696e2074686520696e
20746865207370656369
782e20
2073696d756c74616e656f75736c79
6d657263
66616d
747275650a
6c79206164
6469736372696d696e
65e28094
6e3a
6b24
7320666f722024
2c207765206669
20283429
746961
466967757265
696e743634
6d756c7469
206f66206f6e65
20456e67
696e670a0a
20416761696e
7120
7320666172206173
466967757265c2a0
2c207669
6e2e2054686973
3529202020
20696e20746865206f
4e554c4c2c
0a0a537461
6b657273
392c20
20696e76656e74
206f66207468652068
61636875
68696c6c
6174652062
656d626564646564
20776869636820
2074616b6573
3c3f706870
697469
2044722e
20616e78
20746869732073656374696f6e
536f75726365
20616c6f6e67
656420756e
315d2e
20746f75
69206d
6973
6d6163
207574696c697a65
20532e20
74686f7365
2047656f72676961
206973206120636f6e
6c6578
20636f6e74657874
76696374
0d0a2020
706c7567
73206865
2068616e67
204a696d
2e205265
2054696d6573
383235
2049207468696e6b206974
204f70
206c6f77657220
0a0a5468656e
30293b0a2020
2041697220
6564206261636b
757365206d
206578706c69636974
2046756e6374696f6e
3420202020202020202020
616e746963
2077616e7420746f2064
6f7570
207769746820616e79
6963616c2c
696e7374616e63652c20
332077
73206f70656e
39392c
746170
647669
20202020202031
646520666f72
e289a5
2c20616e642053
2e220a
69782d
732064656d6f6e7374726174
2e3839
207265736964756573
457374
20697320736574
20636f6e74696e75656420746f
73206261
207a6f
0a2020202a20
4c6f61
7b5c6266
0a4c
2c2d31
732e20536565
20736570617261746564
205379
736571
2d6d657468
6469616772616d
616e696d6174696f6e
496d61676520
730a202a
293b0a20
20616e64206578
333530
6966696564
785e7b
205441
404b
6f7374
20706172616c6c656c
2c20776869636820617265
33297b
646976
20776f726b20696e
2073686f756c642061
66756c6c79
656c2c20
206279207468656972
205c66
6f756c6420746865
a1
61626c652e
616363656c65726174
20245c63
4f5345
66656e646572
3d3d3d3d3d3d3d
486f75
207370656369666963
303529
5641
3a207b0a2020202020
20746f2042
772043
782062
203d202d35
2074686520726563
616374696f6e20696e
76652e
6f6f6420666f72
6c6c2074686174
20706f776572
2074686520736f6c7574696f6e
6173732c
7572652074686174
6343
20616c736f2062
4672
372c2031
74204f
3109
207072656d697365
206172652070
2e20546865206361
20746f20656e
2073696d
476f
2a30
697374
206f66207468652070726f
48656164
796e6368
68656170
277d
636f6e64756374696e67
204d50
206d6963
73697665
207b0a2020202020202020202020
20776f726b206f6e
696f73
2c2074686520636f6e
494420
20686176652063
2074686520746173
6e6f727468
224e
636f656666
73696e73
78746572
61636520616e64
207068696c6f736f7068
4a756c
20332e30
20736572766963
65207374696c6c
2074616b6520
52656c61746564
206f6e20746865206c
686f7365
446f63
792068656c70
6d656e7473206f6e
205c696e74
5d20546865
205c5b5b40435232
206e6577206c
2d3135
7d20656c7365207b0a20202020
642c207765
20666f6c646572
742d
676c79
71756976616c656e74
417d
6c656674
2e3134
696e73756c696e
79206d6f
20522e
2061732064
6961746564
6564206f7572
7363756c
616e6965
292f2828
207468616e20
73797374656d696320
7d7b31
726521
3f
3f204974
656e74732c
36392c
65696768626f72
2074657374
7320636c617373
2d7468652d
5c44656c7461
20657374696d61746573
204841
20696e7472
28626f
6967687420616e64
20666c6f7572
a7
2254686520
207468652073616d652077
e28094616e64
2043617365
205c656e647b616c69676e65647d2424
4f6e6c696e65
70726f7068
0a0a5468657265
70732e0a
6765
206f66206368
20202020202020200a
426f6f6c65616e
616c20636f6e646974696f6e
656f7573
726974657273
206f787967656e
2072656769737472
20657874656e647320
2031393933
0a202020202e
615f69
6d617a
79636c696e67
206f6e20612063
746f206974
2074686520476f
206f6e207468652062
72736f
2074686520746f74616c
286629
6974696f6e73
7373696f6e20616e64
205349
20205d
2d312c
6475637473
732055
73206d6f7265
5f6924
6f75676874
20706572696f646963
6c792077697468
2e3339
2c204368696e
252920
4142494c495459
5f6f72
6f756e642e
204920646f6e2774
20746865206d6f737420
206d6f746976
2c20616e6420736f20
20776f726c6477696465
2849
6e2069646561
7420756e74696c
7665206f66
6f76657220
70726f70657274792e
250a0a
6e616d6527
666974
626e
745e7b
33372c20
20746861742049206861
73207761
2076617269616e74
6e6f7420646f
72652c20746865
6173746963
7d7d7d24
6173652e
202457
72616973
66616d6f757320
436861
363730
0953
206120626c
702077
206d6f756e7461696e
49206e656564
20666f722074686520636f
206f6e207468652067
686578
2074686174207468652073
730a202020202020202020202020
706974616c
5c6c696d
474154
432a
2062792074686520
206c6f6361746564
524d41
2074656d706572617475726520
2c0a202020202020
206861766520696e
2067726577
20202b
617920616e64
79204d
292d3e
2064697669646520
616e616e
7d7d5c7269676874
3d3d3d3d3d3d3d3d3d
747320616e64
2c2062757420696e
20706f74656e7469616c6c7920
706172616772617068
202d205c
696e636c75
732c20496e63
5c6c6571205c
6261636b67726f756e
20707265636973656c79
7365636f6e
6765206f66
2064696c75
2e54
2057696e
362020
2e0a0a5b
303334
20666973
2073616372
2072697365
7564
206672756974
6465206279
2061637175697265
20626f756e646172
0a0a496e20
2061756469
20686176652069
20776527
61742077
726520616c736f
20526576
7920676574
31350a
20796f752c
2e2e2049
323525
0a3c64
70706c65
5468616e6b20796f75
696b61
3c696e
0a2020e28083
2c20616e642072
206c696b65
206162736f6c7574
202020202020202020202020202020
742074686973
7465696e2c
204853
222050
61626c652062
2f4d
736563726574
372e36
2d3132
2061726520746f
6e69636b
2c20616d
6f6f6c73
206f66206d61
206d6f7274676167
2070726f74656374697665
61736e
7070656c6c616e7473
57656c6c2c
6720
6f6c6c61626f726174696f6e
0a202020207072697661746520
282d3129
6f75732063
362e
6f6e6f6d79
696f6c6f676963616c
20746865206573
2074686572652077657265
6f722077
20467261
73657276657273
2064696374
4e616d
212057
2e32642034
6d696e61
20555341
3522
687973
0a57652068617665
646974696e67
7b5c6d6174686262
6e74656c6c65637475616c
6d6973
2c207768656e
206b656570696e67
7375626d
6e207265
363b
6f7273686970
63746963
2077686f206861
7564656e74
7265206974
646973747269627574
29207573
20666169
20776572652068
66696c652e
2c207768656e20746865
7175696e
732069732074686174
68696e65
65726174696f6e
207468652072657374
6f74696e67
616666696c69617465
73206d6164
323437
2074776f2068
74696d6520
2074686520776f726c64
20636861726163746572
6e6361
20537461746520
20717565
7469616e
6e2c2041
657320616761696e7374
20302e3031
0a0a646566
656e74206f66
786d6c
4c6f636b
204d61726b20
6c696e67
206469736162696c697479
202020205b
6163742e
456475636174
7573206f72
2069736f
65662e
6f747461
636172652c
62696c
61626c6574
657320776f756c64
2070696374757265
20696e63726561736564
206f6620676c
32292e
6172626f6e
454e5420
6f6767
206f662067
496e64
61766520796f75
6320616e64
62756c6c
63686f73
5761746368
722042
f4
2061206c617267
69646573
65722c2061
6c696573
207468652065646765
206a75646765
20686173
2028692e652e
207374796c65
656e616c
207468652074776f
6f6e206973
646f73
73746164
205c72696768746172726f77
2073656564
3e7b
506572736f6e616c
0a49742773
2c0a0909
74732c20
73206269
6f746174696f6e73
63726561736520696e20746865
74696f6ec2a0
6b6167657b
292c0a0909
676d656e74
206e75636c65
20616e64206d69
2056616e
24206973
726576696f75736c79
66696e6974656c79
61726e6573
6c6f6e79
652063617365
636c6f7468
7931
20436f6e6e656374
54595045
206163636570
70686961
65642e0a0a
5269676874
2e3235
73206f66206f7572
626c6f77
696f6e2c20627574
4d616e79
6669656c642e
2064726561
2073686520686164
20746f2053
2061206661
6563726561736564
0a0a4d75
72652c20
6d616e746963
2044657669
2052657075626c6963616e
63616e64
0a5468657365
6e6475
6f6e20756e
697665
d2
736576657265
2049662024
732043
732073756666696369656e74
6973207265706f7274
3a0a0a20202020
696e67206469
495353
736f75726365732c
756c6c61
6f7572732c
206f66206d656469
72652066
74726163746f72
69636b6564
207061726b696e67
6b696e73
702024
2d6f6666
696e6775
20616e642070726f76696465
6d616b
22293b0a202020202020
2c20616e642054
206c6f6e672d7465726d20
646576
365d29
0a2f2a
616374696f6e20746f
2e313938
20e280932069
526169
20616e64204368
6f6c696e
2c2069742069
696e6f72697479
20646f75626c652d
20616c6c206f6620746865
73616964
2c20616e64206e6f
5b335d
747365
5b4669677572652031
20697320746f
2e5265
0a0a31
7469632063
287b7b
6c62657274
34c2a0
20706c616e73
6d63
68652073686f756c64
442d31
20796f75206c6f
6c742e
616c206c696665
726f6b
2056616c7565
207468652073616d706c65
2077696c6c2074616b65
7920776f72
6c6f616420
c2ab
0a3137
20746f206170706c79
20202020202020202032
6e69676874
0d0a202020
2070656f706c6520696e
206974207365656d73
742074686520746f70
67657b6d
350a20
20626f756e64617279
2067756172616e746565
73747265616d20
34202020202020202020
5d24
5d5c5d2e2049
707269736573
203d202d32
ceb2
20746865206578
706573206f66
6d617a696e67
206469737365
7768696368
20526f6e
61646573
2076657279206d756368
595f
c2a024
2c207468657920617265
5f74797065
20676f6f642061
4d6963726f736f6674
202846
2061206665
726e697368
657320686164
20756e69
2066696c6c6564
63686574
5765277265
696e76656e74696f6e2072656c617465
2061732077656c6c206173
706f6e64
656269
283330
6735
65207369676e
0a2d2d2d2d2d2d2d2d
206265206b
5042
29203a
3e0a20
206f75742077697468
756e746f
206d6f727068
642048
73747275
656e6e657373
207820
202b20282d
79292c
756d6f7572
6973636c6f73757265
20627275
617074696f6e
61727920616e64
20626c6164
20617661696c61626c6520696e
76616c656e6365
2c3129
63617061636974
73636c65
20746865206c61636b206f66
2061707065616c
207061676573
20636f6e74726f6c
6f726965
686520746f6c64
2c20556e
2054686972
4c6175
20243130
6c7920646973
657220696e
43686170746572
2063656c6c756c
2a2053
204f4b
20646973747269627574696f6e
20456469
20657874726163
647572
6c65732e
206e6561726279
207c20202020202020
6d61747465722e
72657475726e3b0a
2070696e
2c20736d
61742065616368
7472616e6365
7b5c72
323339
393534
69657320696e
2064656e696564
6f6d61696e
2062757264656e
292e2046
2074686520746f776e
20626567616e20
682057
313a31
69706f
2061646472657373
766976
6b696e672c
2e3534
20616761696e2e
0a0a54
602e
746573
522d
5b78
696e6f6d
72616e6368
20666c657869
6f75
4479
636f6e76657273696f6e
202d20332a
73696f
737061636573
6f6c642e
492028
796e65
72206d
20766563746f7220
7769
7920666f756e64
20736574746c
7061727479
736962
726e6f
20616d6f6e672074686520
61727468
2061636164656d6963
20746865206f6666656e
5d0a2020202020
7777772e61
4962
203d207b0a2020
74696320616e64
205c74696c6465
416273
20656c65637472
2e0a0a4173
696e672068697320
7374656e74
436f7079
555f
496e7465726e
6162696c697479206f6620746865
20746f207468652053
2c207468652063
506f736974696f6e
65616c746863617265
616d7073
224c
696e2031
6c617766756c
54686174
6174206c6f77
6f7220617274
6567696e
24206f6620746865
20616e6420616e7469
0a0a42
6574732c
70617468
4b6f
434320
736f6c6964
3a20696e
63616d657261
206174207468652066
20746f77617264732074686520
652032
63726573
20e2809c6f
547765
20412e
20736f757468
3d2264
74792e
6e732a
2c20686f77657665722c
4f6c6976
5c6d6174686672616b
616374657269616c
64207468657365
6578697374656e
20796f7572206d
0a53696d706c69667920
2071756172746572
204920686164
72656c6961626c65
206c6f636174656420696e
2077697468206f6e65
0a63
6e3f
66697273742c20
656375
2064656c696265726174
327d0a
206368616e676520696e20
6572204c
616e6f6d61
50726f666573736f72
29203d205c
d4
746572732c
33382c20
2920213d
5965
20446566656e64616e74
2077652063616e
6f732c
737570706f7274656420627920
756172
792063616e206265
72653b
732e204a
626f756e6473
206f662070617469656e74
6963696f7573
20686f7572
792074
202020302e39
202063
64696e6720696e
327d5e
656e5f
6974792e0a0a
656420616e642073
20627269676874
2e6e6574
20706c6179656420
2e0a0a5768696c65
732069737375
61203d
6f646573
73746174652c
66697273742070
2e3033
2077616c6c
67616e64
6820616e6420
4120776173
7830
696d6963
6c20616e64
682048
206e6575726f6e73
206761
696d6d696772616e74
20736c696365
2e20506572
617272616e67
5624
52657365727665
50656e6e73796c76616e6961
206173206974206973
7075626c69632073746174696320
206d6f6e74682c
424c
20417072696c2032
78295c
696566
2074
6c206f6620746865
79206e656564
6163726f7068616765
506167
206c6976696e6720
52756c
2e2049742077617320
43454e
656163
2028692e652e2c20
787465
6f7320
20676f696e67
696e672033
7274792d
20646f6573206e6f7420
2061646f70746564
54686520636f
20492074686f75676874
437d
6c792070
617373756d
20616e64206c69
20656c646572
2052
206c61746572
2420697320616e
75626f
20616761696e7374
206f722061
7374643a3a
6f7220616c6c
207374726970
2067726f75
616e6365206f6e
3c53
20726576657273
73207461
48616c
65206973206e6f74
20696e76657374696761746520746865
20746f207468696e6b
206163726f737320
343532
756e646566
61637469766520
0a230a
20636f75706c6564
2c20696e636c7564696e672074686520
3a2073
6869676865737420636f6d6d6f6e
66207468656972
2073686f636b
20686176652066
436c69
696e6564
7320616e642041
204c2e
4e494e
732067656e6572616c6c79
4e616d6520
657220746865
426f73746f6e
323833
20657665727920646179
532073
616773
206d6f72652074
65727465
2070726f6772616d2e
2073686f777320746865
2073686520
20726573706f6e736962696c6974
6576657220746865
676e6f
2e6461
20776974682074686174
323637
4f7468
4f7065726174696f6e
20536176
6e7175697279
30303030
2e205765207265
506169
73206265696e67
65617264
69676c
5c73696e
2024245c6c6162656c7b
6d6f746f
6e204a
4f707469
20466562
34392c
22290a20202020
20454d
7320636c6f7365
2064697665
7020666f72
576f726b73
2e2920
6f6e796d
207370656e64696e67
20656666
63742c
2074686569722076
202874686973
74656374696f6e206f66
7265206f72
73706974
20636f686f7274
65206368616e6765
205769
207468652063617365206f6620
22646973
68206f66
466f6f74
65642063656c6c
4a53
20636f6e74726f6c20
696e746572657374
207468697320736561736f6e
696e672074686520696e
5c6c656674285c66726163
737075
206368616c6c656e6765
2074656172
6520616c6c
504c41
66697273742d
0a09097b
64652063
6d696420
20666f6f74
2d54
203230313420
6465636f726174
7061746820
6a65
613f
6e652e
6520656e
20612e
69736b
43742e
416e696d616c
2e204a757374
680a0a
4b65
75626d6974
732049
6c6f77696e67
6f74656c
e2889230
20e28892
206d756c7469706c65206f6620
20746869732069732061
313234
20616e642072656c
65204a
206672657175656e63
6520616c736f
206865e2809973
656c656374726f
20656d706c6f796565
20696e20707265
6d656e747320617265
49742069732061
20657870657269656e63652061
204a61636b736f6e
c3a973
54656d706c6174
70686f746f6e
49207468696e6b
6120706c6179
6861646f77
e280896d
6f7274756e6174656c792c
4c61
20666f72206f7572
6c6469
63757473
650a20
2447
742c20616e64
632028
242c2077686572652024
726765642077697468
656e20696e
2065787072657373696f6e206f66
2c20302c2030
5c6465
51756572
79206173
20746f2022
657a
20696e206f72
2e2054616b
206f66207468652067656e
697473
206d6f72652066
20726570726573656e7420
2061206865
4131
5d206973
6f6779
3b205b
526174
73203d
746865206f7074696d
7420776f
e2809331
207068656e6f6d656e
6e2057
6368696c647265
7973
656e0a0a
72206265666f7265
537570702e
20542d
202d2069
5f4e414d45
61726c6965
2c206576656e2074686f756768
20746f20e2809c
2e204372
206f66207768696368
2434
730a0a49
313038
6c6573
206578616d706c65
536c6f
0a766f6964
616e742d
7b637d
726269
7374206f6620746865
20616c74
6374696f6e732077657265
2832
616b
65726f7573
726f6772616d6d696e67
20746f206669
2ce2809d20
656e746f72
2772
206e6f6e2d
7363726f6c6c
20666f6c6c6f77696e672061
2f61
206368696c64686f6f64
466f7220696e7374616e63652c
720a
2e2e2e0a
206174206c65617374
7320626f
73696e67756c6172
6865726974
20467269646179
206f6620736f
207468652074696d
7768696368206d65616e
6f6c657261
732920
73656c6c
20686173206265
6e65617265737420696e74656765723f
4a6f696e
206f6e6c79206861
7472756529
74657272
79737465
652e2049
6e7375
20e2809c64
417320616e
5c205c205c
63656e65
676f7474656e
28766f6964
2031303030
20796f7527726520
2c20506879732e20526576
53204f5220
f09f
20d181
20746865204368
696e672074686520636f
2e20e2809c54
6465726d
657074
706d20
206f6620612073
2074686569722061
732065787072657373
65656b
2074686579e280997265
6520617265
736179
0a0a5468616e6b
6c792076
20657374617465
204d6163
4e4120
656365
20616e696d616c
204c6973
20736f7572636573
2074686f75676874
776f7264
2068617070656e
20746f20656e64
657463
2e202020202020
207075626c696320
2064656372656173696e67
20696e2070617469656e74
636f72726563746c79
73206265747765656e20746865
65204d
652e204974
205468652048
2c206f
5c6d61746862627b
616c697479206f66
2e0a0a496e20746865
290a0a546865
20726561736f6e73
20756e6976657273697479
4d4152
6060
686f6c6573
7369676e2c
20202020202035
20627574206865
7b327d20
636f75727365
2073686f772061
6c77617973
73206c696b
20696e20612068
342c2032
7070726f707269617465
39322c
2e2a2a
6963682c
e79a84
67617264
756767
696e672077686174
683e
4c73
20666962726f
616c27
776172642e
636b20666f72
69c3
206f75746c6574
657374726f
6976652077697468
696c6c617279
2e2e2e222022
6176696e
38302c20
50726f6772616d20
6963616e74
77696e6e696e67
70686f6e6573
504920
20636f6c6c656374696f6e
65676d656e74
65727473
6f69
636f6e76696374696f6e
727a
20e2809c53
70202b
206f66206173
312f32
2069732070726f
2065787472616374696f6e
6d61676963
20e2809c546865
6c20746f
6f626c617374
72657475726e2066616c7365
280a2020202020202020
2063617272696564
61726d61
63616d
72616c697a6564
617465676f72696573
206f6e20746865207374
203329
617020
696162
696e6720776173
204361
2061732074
333837
656374696f6e2031
2e20447572696e6720746865
69737472
206d656469756d20
207472616e73616374696f6e
317d5c
286529
2066696c746572
6d61726b
20466f7220
732c22
656c7920
5c0a2020
310a09
20726f6c6520696e20
20746f206861
6c6c20616e64
506c61796572
2e0a0a27
5c7665727420
422c
6574656374696f6e
2e20546861
4348
7446
626f6f6b20
50726f66696c
6674656e
092d
726973696e67
7b5c63
2070617373616765
20656666656374206f66
5b24
20686f75
7665722c
20746865206c6f77
3f2220225468
7d242c2024
2e204875
73206368
20546f72
766572206f66
204143
74696d6f
202a69
203d2066
20492068617665
6e6f746966
732075706f6e
2072657669657773
31322028
205c737562736574
206172726573746564
2073706972697475616c
6c65657020
747220
6f75742c
2054657861
424143
20636172656572
2e204e65766572
726520776f756c64
682068
206361726469
2d2d2d2020
2076617374
20796f75206669
20736c6f7065
222c0a20202020202022
65206e6577
70726573656e746174696f6e206f66
696e207265616c
2070726f6a65
6365206174
6c696e6b20
5f327d
2e20416c6c
696e67206120
206d696c6c696f6e20
2050616c657374696e69616e
652020
73207368617265
656c65746564
646967657374
486f77657665722c20746865
6f6d62696e
0d0a0d0a
7320697473
206f6e2068657220
652045
2077657265206469
7474656d7074
84
2c204920616d
226e616d65
20636f6d70726568656e73697665
6564
5c7a657461
20283131
6424
696d73656c66
4c6574
65786365707420666f72
20202020656e64
662f
266e6273703b266e6273703b
6e2048
20686176652073
2c20616e6420616e
2e0a416e
696e67206f662074686520
207265636f676e69
656e747320
4163
20646570656e64696e67206f6e
79206966
30372c
20796561722e20
61637469766174
29202d20
6772617068
20747261646974696f6e
206f757473696465206f66
207468652072656d
696d656e74
20746865726520657869737473
207465616d73
5c6c65
5c3e
2063797374
0a7d0a0a2f2f20
57616c74
536f72
7768656e
2077697468207468656972
69726563746f7279
646b
732e20466f72
656f6c6f676963616c
2074686520676173
6e206576656e74
656d656e7473
2e6265
20202020202034
772074686174
617d5f
6f6e65732c
206f66206f70
303836
5f7468
204879
20776f726c
33342c20
5b4062696231
5046
207d0a0a
61722061
313338
455353
2064656d6f63726163
427572
636c6173732c
616e206f66
2066726f6d206265
65642066726f6d20
20202020202020202020202042
416d656e646d656e74
202269
205c61
206368726f6d6f736f6d
7661706f72
2070657263656e74206f6620746865
206a75737420
592c
0a0a51
272c0a2020
743e20
2061732077656c6c
20726566657265
2c2077686963682077617320
6b65726e656c
333738
69616e63
69645f
5c64656c7461
657068
732e20536f
206861732065
3728
3a2068747470733a2f2f
756e6e
6c79207369676e69666963616e74
2073696d706c6520
2074686579206e65
20626f74682073
2066726f6d2053
6b202d
4c4f52
7220616e64
2c20616374
207468652070617274696573
20617320746865
2065786163746c79207768
736861726564
6c696d65
57696e
203132
73736572
2c20746865206d6f
73686520636f756c64
206d6f74
6173796e63
2d317d28
73206c6f77
6f6e65206f6620746865
6f7572697374
6c6c2073
616e2070
313735
696e64
7b5c746578747b
2063616e206f6e6c79
676974687562
65726e
5e7b2d317d24
6974206d6f7265
76696577206f6620
63652d
5f3028
736b6574
20636f7570
204349
204265726e
6c653b
4a6170616e657365
616464
2e204966
706172742e
792050
202829
db
20617320796f75
2020202020202020202020206c
5c76
2063617265
5f7b2d
2062757420616c736f
4d4554
6e746c79
6720776173
6174696e672061
5c686174
6520706f696e74
5468652049
656420617420746865
20202020202a2f
203436
73206578
2065766964656e63652c
53495a45
73617469
6564206f6e6c79
5056
74206d61
4a6170616e
616261
68656e2049207761
66207468657265206973
43617365
20746865206261636b
616c2063617365
2d79656172
616c6b61
4c6574206a
6d6574657273
74656e64696e67
20616e642068656c70
69657320746865
73e2809920
2068656c7020746865
2e0a2d32
20776974682053
20706f70756c6174696f6e73
6e2061707065616c
3c2f646976
42617262
732c2068
61742028
656e63696e67
4e47
20e28093
3e2031
6f697365
6436
20747269616c
6e672d
6e68616e636564
2d6372
20736964
766f6c7574696f6e617279
20636f6e76
584d
6f706963
2062792053
2c20616e64206f
546f53
2f47
6974726f67656e
6374696f6e
2255
20656e61626c
2e205468652062
20776569676874
6e7363
20766f746572
e280893de28089
4465736372697074
7461726765
207374657070
206d65616e
4469616c6f67
6f6e2072
7461696c6564
2e204164646974696f6e616c6c792c
202f
20636f7272656c61746564
2020202020302e30
20636f6d6d756e697479
206f66206c69
2072656675
657379
39342c
20696e636c7564696e67
7d242e
6c6c207468726565
e2809333
2066757274686572
2075736564206173
20636f6e76696374696f6e
206e616d
54686572652077657265
1c
6f7220737562
756374696f6e
6174696f6e20696e20746865
534b
5f6f626a
2d6b
702073
746578742d
0a202020202f2f2f20
6f76652c
73696f6e20776173
20706572736f6e
617070726f76
22202257656c6c2c
612074686174
4c5f
64676573
7265663d22
6f756c642068617665206265656e
2020202020202020202020203c
7320496e
20736f6d652074
4634
2c20746f20746865
642073756368
746f746963
6f616c
370a
69766573206f66
20757375616c
6e6e6564
686f6c6420
756c6174
2070726f67
616e7461
2075706f6e2061
2072656c61
2074686520736f
203230313120
2e636f6c
6176696e6773
61786174696f6e
636f6e737472756374
6f73652d
6974792773
20696e207468652046
2062652069
204d75
20766f74657273
7068616e
38352c
20616e616c797369732e20
5f7375
6e2c20627574
206964656e74697479
696e2074686520556e69746564205374
36292e20
8099
206d61696e7461696e696e67
202023
2068616c66
7a7a
204f62616d
6e68
766573
fd
3a66
6978696e67
5365727669636573
202020302e37
2074686520737472656574
2e0a0a4e6f
4c75
393033
303929
2d2d2d2d202d2d2d2d2d2d2d2d2d2d2d
6e616d
20203d
6572206f
616c6c20666f72
20534c
20616c676f726974686d
6368696c64
6c6f7720636f
3a0a09
652e67
6174696f6e206f6620746865
20656e7472696573
292e2020
206e657572616c
207468652070
09696e
75746572
31302c20
2c20636f6e737420
6d6f726520746f
6f61642c
70656e20746f
2c20737469
203d20313b
20696d6167696e67
2074616b656e
2e0a0a4869
4e6f2e2032
2c207468652061
73796d6d6574726963
652070726f63657373
206d656173757265
7320686176
732d30392d3030
696d67
676865
206d6178696d756d20
696d6f6e
6261636b67726f756e642d
6173746572
206120646966666572656e74
6173736179
67657428
5c64656c74615f7b
2e290a0a
6e6e656c
7072696e74696e67
44696167
74656e63
0a7b0a
0a2020202020202020202020207d
20546865204d
202b2022
6d657373
6c6c7573
616c20726573706f6e73
204e616d65
5c667261637b64
28293b0a20
6b7368
74206f6620
7369676e206f66
377468
636564
206f6620746f
733b0a2020
6f6e2061707065
2077686572652073
2074686520646562
31362e
2073756368206120
657874656e64
696e205b
20666f722074
72792c
2072617465
72657374726963746564
69657320666f72
d8a7
20617265207368
747328
5349
73657269616c
6174206e69676874
206275
202020202020202020202020202032
2073686f776564207468617420
30303036
6430
636b79
6174696f6e732074686174
6f7665726e6f72
646566656e64616e74
20627920746865
204547
32303035
2c20746869
0a0a2241
616c20666f72
6c616374
616d69
792c206865
207061706572
495448
20686520776173
0a0a4172
2063656e7472
28293b0d
2074686520636f6e63657074
5c7365746d696e75
43616c69666f726e6961
6365696c
204b6f
652077657265
2063616e2061
7374617469632066696e616c
5275737369616e20
696d616e
5c7073
696d6d756e65
20796f752077
2e646f
20746f204368
206d696e7574657320
76696c
647920616e64
20706f696e74206f66
427566
206661696c656420746f20
0a202020207075626c696320766f6964
206167
206c657665
20736f667477617265
6167657b75
2061626f75742e
72656379
20202020202020203c2f6469763e
20706f737369626c652c
206f662066616374
0a20
2c204170
3620616e64
546f6b65
2074686174206d6f
74656e73697665
766520796f7572
76616c656e74
4846
2d3331
71756164
20616c736f2077
706c6163652061
6fe2809973
20686520776f756c64
20696e20746865206669
2e0a0a5472
7472616e73706f7274
2065617374
204162
732c2074
71756f7469
65203a
6d626961
302020202020202020
6172676f
6d0a
67726567
7b63
20496e646578
302420616e64
2066756e6374696f
6c6967687420
205369676e
6429
776f6f
532c20
22202020
2065646974
73686166
696573206973
756e696f72
6f6e6473
7374206173
63652e2049
20666f722045
333438
2829290a20202020
606060
65732e2049
6b20696e
206c6f6f70
7920706f696e74
315c
696e2e0a0a
737d200a20
2e2e2e2e2e2e2e2e2e2e2e2e2e2e2e2e
702a
672e20
2077697468207768
656974
686177
65642062792024
6620636f75727365
69657322
6b6965
206973206d616465
656d706c6f796564
2073657175656e636573
6374696f6e616c
2c20636f6e
656e742061
20666f722054
7562756e
6f7764
202042
206164766f636174
656374757265
2e0a0a546865
796f757273656c66
6f6e7320746f
2062652075736566756c
20747970653d
20616e64206d6574
656e6e
2c20696e6469636174696e67
20736179732e
20414e4420
612b
6e636964656e74
61727920696e
20746865207363616c
20637572696f
2074686520696e697469616c20
2074686520617274
72656e65
2e20412070
20617272697665
20646f6e
73637269707473
2068656c6c
61626c6522
6f7074696d616c
206f75722063
206c7973
616d706c653a
322c33
292031
20245c6d6174686266
5468652070726573656e74
204e616d
7b5c6d75
696e70757420
207175616e74697479
6c756374
206a7573742063
312030
682d
20696e203139
2c206e6f20
4a2c20
5c6d75
69742773
656e7461
0a496e2061
202466
20617070726f616368
4b2c20
7420646f65736ee2809974
656c636f6d65
75705f
66696c6c6564
6174696f6e5f
7265706f7369746f72
20686176652024
726f73
4c4c
2070657263656e7420
736962696c697479206f66
20612070726f
6e5b
205d
652033
d984
50616c
0a7374
20746f2065
6174202a
726175
0a66756e63
742e2041
2074686520696e6e6572
5c6d757d
436f646520
6f2070
79207368
207365656d6564
6173652049
596f7520617265
206265656e2062
746f727920
6472616674
63756c747572616c
7320616e6420
5f6c696e
4f6e65206f66
2a7a
20202020202020
20686572206e
646f69
706f77
20736f727279
20616e6420686176
300a20
206a7573746966
206f66205363
6a6f72
0a2020202020207d0a20202020
6620736865
732061626f757420746865
2074686520696e74
207673
2066616c6c696e67
7320776f726b
206d616e75736372697074
206f72206279
736368656d
706c6578
20746865206d61696e20
6620
202d2033
446966
766f696420
616c69736d
275d
28290a20202020
616e2c
207374617274
7374656c6c
633b
732026
22293b0a20
313332
70726564696374
6d657468796c6174
464f52
2e683e0a23696e636c756465203c
616e696d
20636f6e74656e74
65737472
2e0a0a20202020202020
206f626573
742077
20646f75626c65
20617661696c61626c
6b75
7072657373696f6e20616e64
696e6e6f
70726574
29293b0a20
706f73696e67
652062656361757365
20696e6469636174652074686174
7d2e20
204e6f6e65
2066726f6d204c
543a
556b
41726775
5c72616e676c6524
20746861742064
6f7273206f66
20282a
747275653b
20746865206f7267616e
206f66205472
205c3e
343435
207d3b
e280a62e
206d656d6f
302e3131
20646f6d696e616e74
556e697465642053746174657320762e
305c
2074686973207765656b
6d7366
732039
2749
6e6365207765
2074616b696e672061
617263
2e0a32
206f66206e6577
0a0a0a0a0a0a0a0a
204675
486179
206865722064
4e616d65203d20
0a0a446973
20656e7669726f6e6d656e74
436174686f6c6963
206669626572
434b5f
616c207269676874
20726571756972657320
6577206f66
75722c
65747a
50
20666f6c6c6f77696e6720746865
0a20202020202069662028
206578706f737572
206177616974
616e2074
69636b2c
656c20746f
20696e746572666163
2e6964
7e327e20
74687d0a
202773
6f6e2054
297b0a2020
73657269616c697a
357d0a
63617262
6172616d
50616c657374696e69616e
2061726520746865
206665776572
6d626c696e67
20706172742c
0a2a2a
202d2d3e20
415020
6f626a656374697665
4c53
636f6e74726f6c2e
2c2049
227d0a
6572206d
2074756d6f7273
7420696e20746865
205242
69666520616e64
7320646520
6c652e20
656e636520
792074686174
6f6c6c6172
323031
7976
205448
2c207468656e20
6374696f6e7320616e64
20666f7220612062
6e657a
732066696c
2061206c6f6f6b
2061646f6c657363
2049206e65656420746f
2c2077686f
6f7264657220
4d5e
2074686520706f736974696f6e
2074686520666f
342062
7769646765
20524e
63656e7469
31392e
696e67206f6e20746865
3a0a0a49
616e676c
206d6f7265207468616e
2d7769
2c205761
292e20
74726163
20746865206f
656d2e
20636f6e7461696e656420696e
7761
2030303a
2920617420
70616e6963
73742028
30352c20
752063
292c2032
726f6d61676e6574
335d2c
2074686520776f726b
64697265637420
2070726f706f73616c
6578616d706c65
6843
69676e69666963616e6365
65722e204865
6d706c6f796572
2074686520706f72
6174207468652050
2063726561746573
7920746f20746865
57696c6c
38303030
56697267696e6961
2020202020202020202020202020203c
20736f2d63616c6c6564
20636f6c6c61626f726174
7d5e32
2d47
302e3133
64726f69
68747470733a2f2f
446976
62656c69
436f6d6d
2e32642037
6f6e20746865
666f7263
20313237
787d
312e30
2066726f6d20746865
2c2066756e6374696f6e
7377696e67
656e
2c20636f6e74
20616e63
53514c
4f73
242e
393829
6d6d75
3f2020286129
73706f6f6e
69636174696f6e
696e6475636564
43686572
637569
746f6e20
20737572676963616c
7474
66756e6374696f6e616c20
64726f7070
6f6c617465
706173
5765737465726e20
656173757265206f66
20617265206e6f74
7b51
3020cebc
20696e766173696f6e
3329
616d626967
4f68
6d6f64
206465636c696e65
6574696e
616c207472616e73
6d656e75
652066756e6374696f6e
656420666f722061
6f77656c
68656174
622e20
6368656d
20757375616c6c79
c390c2bec390
626c65206279
20726f6c65
20696e74726f64756374696f6e
696e67206279
697468657220
65207468656d
73736f63696174656420776974682061
2074686174207468652070
20636c6f736572
73206973
206c6974657261747572
223b0a20202020
2034
207261646963616c
5f5c6d
20382d
726f6e61
2c206f70
6c4d
7b0a202020
7920736f
637261746368
2077657265206f627461696e
74697a6174696f6e
413a
616374697665
317d0a3d3d3d3d3d
2053616e7461
22293b0a2020
310a202020
6372656173696e6720
20416c74
7320762e
44494e47
2020202020202020202032
20785f
7320696e206f7572
20647572696e6720
28657272
696d6167
6e6379
506173
5c54
206469766964
322020
20706c6163
617468616e
782061
66616d69
732028
70617469
292076
206f662074686520706c61
5d292c20
24c2a0
65206865
2c20736f2049
204275696c64
616e6e6f
746e
75636f73
25252525252525252525252525252525
20796f752073
207368652773
46697368
333434
20746865207072696d617279
626c6520616e64
206865e28099
6f6c6b
2048756e
4175677573742032
537570702e20
6669786564
61742047
202d2068
65642e2054686973
53696d706c
2c20697320
343634
2072617469
20796f7520776f
616c6c6f7720
20736572696f757320
206f6e63
20612077656c6c
69636c65
696d6167652e
20746865206e65787420
7320245c
20617420686973
73616d706c6520
312e0a0a
554e54
61746f7220
2d2d48
20746865205765
20616476616e63656420
0a202046
2074726f
20746865736520
6c616773
7320696d706f7274
6573736572
20706861726d6163
7564696f
6f6f642d
202056
20245c6d617468
73202849
3b20692b2b29
7279206f6e
20426f75
7420636f6e
204d6f6465
207468652045
6f737369
646479
656e747279
4d43
20696e20746865207365
206772617373
7374616e6420746865
697420696e
2077616765
2d6973
20707269766174
20746f2067697665
2073756464656e
2076696f6c6174
4952
0a2020202070
20245c72686f
6e65737320746f
74656d706c61746520
4053
620a
6e5e
292c2063
7562626c65
e28099732061
496e7465726e6174696f6e616c
656c6570686f6e65
20617265206c
6f7574657220
2a2069
20492066696e
0a096966
61706c
7b507d
72206e
6b6e6f776c656467
20646f65736e2774
323634
20696e207468652073
414e43
6c6963656e7365
6c6c6173
6e656420746865
76657273696f6e2e
6d6f64616c
48656c6c6f
20746865207061727469
656e7a796d6520
6572732e20
64756e
2073686f756c6420
6e696665
20636f6e636c7564652074686174
20616374696f6e2c
697a6174696f6e2c
64657269
6f72656d20
6469736d697373
0a350a
244f
7465206f66
652e672e2c
206772617068
20436f2e2c
696c6c696e
65786973
3e2063
6b6d
696e6420
5c5b5b4072
20636f6d706c69636174696f6e
5b4042
383031
5445
20636f66666565
20646f6ee28099742068617665
696e636c7564
61747461636b
2929207b0a
742e636f
616e6368
2067726561746572207468616e
5361756469
67686573
206c6576656c2e20
362e0a
4e6174757265
6e652073
6368726f6e
436f64
207b5c
204142
205768696c65
696768742d
482e
206f6620706572
72696461
696e6b73
7920646f206e6f74
202852
4f0a
6c6f6e6720746865
33312c20
6164
4a6f686e
5252
202452
5e30
20666f72206d
2077657265206e6f74
5d7b7d2c20
20616e7469626f64696573
6576656e206966
7373656c
3d2032
ceba
646f6d6169
7320736f6d65
20746865207669
20746861742074696d65
206d616b6520746865
742e222022
205072657373
206f6e2042
20746861742067
6f6c2d
70616972656420
206d696e69
20636f6c6c656374697665
6f6e63
50726f7065727479
616e2049
436f6d6d656e74
67696e61
696e2065616368
656e206f6e
