662878
7374656c6c6172
2c2074686f7365
75727665696c6c616e6365
207468656972206f776e
20757064617465
20737472
092d
206578706f73656420746f
6a617661736372697074
207265616c697479
2073657175656e63696e67
2250
343936
203431
2074686520706c616e
20746f206f66666572
204368
3e0d0a2020
2068657220746f
506164
69676874
353137
2e20466f72206578616d706c65
2074686520636f757274
2e0a45
5b40435231
206b696e64
2068696d20746f
54687573
206d656368616e69736d73
6f7274616c
456e67696e65
41726773
757261
782e
6574726f
20757365
617070656c6c616e74
5c64656c7461
3b2044
206c61626f7261746f7279
7320e28093
385f
2e205f
6c61707365
206e6f742073686f77
2077617920746f
6f7567687420746f
65722773
2e31
6e2774206265
203333
206672616d65
20726573756c
2046616d696c79
616e79
76656c
0a0a5265666572656e636573
2062656c6965766520746865
6c6c2d
2074686174206d6179
2070617274206f6620746865
696e6720616e
2069736ee2809974
32202d2031
20726570656174
20636f6c6c656374696f6e206f66
6b6579776f7264
46726565
204d6572
20245c7369676d61
636174
73686564
677261706873
506c616e
686f726e
7472696573
307830302c
206c61796f7574
4d656d6f7279
2e0a49
5824
7920686173
205441
207468657920646964
20726576657273
20746f6f6c73
207469
206120626967
207369676e616c73
20616363756d756c6174
5d2c205b40706f6e652e30
7d24
65e2809973
204a756467
2d332d
206973206f6e65206f6620746865
687562
2e0a322e
20496e7465726e6174696f6e616c
617a61
6368756e6b
7b5c766172
207572
20736572696f75736c79
0a43617465676f7279
696e673b
332b
66696c652e
417574686f72
68696c6c
616c2073
6966696564206279
5b5e315d
6973742c
204c61
20766974616c
2d6d6174657269616c227d29
3f3f3f
73696c656e6365
2e3136
4d494e
315d3a
4173
206163636570746564
64756369626c65
20617474616368
5228
67726565
0a34
726520
2073747275637475726573
676c617373
496e7465726e6174696f6e616c
747970653d22
20636f757274
776974686f7574
70617261
20616e7377
6b2b
6174682c
20746865207465726d7320696e20
273a
696e732c
205269
4547
2068616c
20646973747269627574696f6e
723e
82c382c283c383c283
4576657279
65747465
2077697468207573
4c6574
206d616a6f72697479
2c206c
302e3135
2522
20283230
3d27
206f6e2074686174
2073696d706c
2c200a
2062652028
2069732075736564
204a534f4e
292424
73756d6d617279206a7564676d656e74
313033
20627579
20746f20746865
6e657373206973
206261736963
6f0a0a
20666f72206f7572
5f636f6e
20746869733a0a
766f6e
2c202d32
63686573
727920
20616e6e6f756e63
2d646973
627269646765
206561726e6564
20612066756c6c
3d3d
362f
204d6f6e646179
70726f6261626c65
6573742d
7b0a2020202020202020202020
2074727920746f
696f6e697374
20697320686f77
757466
696e20776173
2074686520676c6f62616c
68616e646564
0a23656e6469660a
0a43
732054
7265736f6c766564
2e706e67
20636f6e737472756374
20456e676c697368
20627265617374
6f7074696f6e
726167
7577
477569
206f6e6520616e6f74686572
707261
65207468656d
323531
20546169
220a22
206f6666696365
52657175657374
6c5f
2020
206f66207468652063
5f6765745f
323336
6f6d6d756e69636174696f6e73
205061726b
313930
206162736f6c7574656c79
3a53
20726570
205c
62616c616e6365
204b6e
2074686520616e7469
20496e6469616e61
20706f737369626c65
616c2066
7a79
2e20427920
20696e203139
7b6a
766174
206c656420746f
28312b
2d302e31
20697421
20737570706f72746564206279
2b5c
20556e696f6e
20616c6c6f7720746865
6932
206865726f
204f52
2f68
756e646566696e6564
2e2054616b
c2b5
20776974682041
2077617320746f
732e0a0a53
6e657373
203638
207573
6572696e67
2073656e736974697665
5c646167676572
20657870616e646564
2067726f776e
2072656c65617365206f6620
0a5b
20636f75727473
616e6f
6c616b65
277665
2d70
20656e6473
666f7265616368
20616e7377657273
6376
2e20417320746865
0a4c
206b6e6f776c65646765206f66
2062696b65
617564
2074686520656666656374206f66
20696e20323031
206f6e65206f66
333835
206661766f72697465
207768696c65
20746f20626f7468
20706f7373657373696f6e
e0a5
207761732075736564
2077696c6c696e67
2057696c64
616c6c207468657365
65616c696e67
207468652054
206661637473
6e5c
4974206973206e6f74
6e6168
205475726b
6520776173
206573
2c2077652063616e
3a206e
204869
79
5068617365
7b0a202020202020202072657475726e
204d6f6e
7077
20656e74
73207468726f756768
776f726473
69766572
69626c79
20766f6c756e74656572
20536f63
656e63652c
2a7a
766f6b6564
206172652073
2e0a0a496e20
20c2b1
20766572737573
75636b6574
72617368
6c6c6572
206e6f7465642074686174
204567797074
5769746820746865
616d20
206f7065726174696f6e
3b0a20207d0a
6d7061
206174207468652074696d65206f66
6c6162656c
207468652077
6f726465726564
20616374697665
7374616d70
75726573
696f6c
205370616365
cc
2063617264
6f75742e
2068616e67
20696e746f20746865
20456475636174696f6e
73207468617420
4166
61766564
6f746964
207072696e6369706c6573
2061742031
696f6e732c
4e75636c
20696e2074686520666f726d
2063656c6c7320696e
206e6575726f
20746865207061
2ce2809d2073616964
20706f70756c6174696f6e73
6965732e20546865
206275742061
206e6f746963
57617368696e67746f6e
726973746f
20656e646f
656e69
4f7264
2053657276696365
2074616b656e
20636f6d7065746974
5347
726567617264
2074726561746d656e7473
766f6c766564
323339
2068697320
20697320667265
0a0a2020202020202020202020202020
5370656369616c
207761732066
206261636b2c
20656c656374726963
0a3d3d3d3d3d3d3d3d3d3d3d3d
3a2048
2f0a0a
20747261636b696e67
6372797074
5449
206571756174696f6e
3b0a202020207d0a7d0a
20202020202020
207472616374
2053686f
737473
20796561727320616e64
490a
2077697468207468652073616d65
696e636c756465
6f7468
20736f75746865726e
706f6c
6e616d
343838
636520746865
2073796e74686573
494c4c
6a756e6374
c3a4
34382d
30293b
3a2043
242c207468656e
6b68
7320696e207468656972
2061207175657374696f6e
20696e20746865206d6964
6f772c
205768
70696e65
20696d706f7274616e7420746f
205b24
207375706572696f72
206973207468
303f0a
632e
292e20537570706f736520
2e646f
a5
6b20
206472696c6c
62656c74
696e646572
2077696e65
6d6d756e6f
666f756e64
2061646d696e697374726174696f6e
20416b
20636f72726563746c79
6d617374
4549
3a0a2020
6965732e0a0a
63616c6962726174
6e0a0a
29207b0a09090909
2070726576616c656e6365
7b4e
2061677265656420746f20
6d20746865
6168
2c20657272
747320696e
75732a
3b204e
495459
3144
63746c
7069
20666f7263
2066726f6d2052
6572e2809973
2052757373
20696e646963617465642074686174
62726f77736572
20612022
2049206c6f7665
27203d3e
20696e207468652063617365206f66
6f6c6174696f6e
2067656e6572616c6c79
5b404235
397468
206d65726974
766972757365
436f6e66696775726174696f6e
76697375616c
4d75
20494c2d31
436f6e74726f6c
20676f6c64
432028
205068696c
322920
20776973
64656e73697479
652077696c6c
202e20
4e6575726f
6163746963
20626f746820
7320666172206173
6d656c
696e6720646f776e
5f327d
656261
636f6e7472696275746f72
7321
20617267756564
2073617973
746172676574
207468652064
20776974682045
20776f727374
20706c616e7320746f
2050415254
69667920746865
2a205c3c20
207768657265206865
7075626c696320766f6964
2063686f6f7365
6f7220746865
206c6576656c2c
206d6f766965
652077
206265616368
20746f20656e737572652074686174
20746f2066
2a64
207265636f726473
696469
20686f73706974616c73
6f6f70
2066616c6c73
206368616e6765
65732c20616e64
616767
636f756e74696e67
207468652066616d696c79
2064656661756c74
7761746368
457874656e73696f6e
2073696d706c65
6e74
5c667261637b32
2048696d
635d
2068747470733a2f2f
2041736961
0a57686174206973
c3b36e
6556
6164656c
656769736c6174757265
345c
20746865206c616e64
6e6174
206d656368616e6973
205f7b
206d616465206279
207468726f7567682061
2f38
656420746f2061
292e0a2d
2069732074686174
7878
206c6965
207361766564
20776f72
5052
696172
2063616c63756c
756c74
313134
696e67207468617420746865
2073686f756c64206e6f74
416c736f
2044656d6f63726174
67726f756e64
696e672045
206d656e74696f6e
627370
206f6e20796f7572
205343
2073656c
726f70
612047
204146
20436976696c
2e20617420
202430
382e34
2048756d616e
474650
2077616e7420746f206265
c3b6
206d61736b
2e2028
0a687474703a2f2f
2846
2770
707572
206372617368
61726520
6e672d
293b0a20202020202020207d
2074696d
2070726f766964652061
484f
20696d706c6965732074686174
204a616e756172792031
20666f722049
20726573706f6e7369626c65
207374727563747572
2070726976696c656765
206d697374616b65
20696e64756374696f6e
315d2823
4750
73697a655f74
726579
2920
20616e6420746865206f74686572
65617468
205765
6c6f63616c697a6174696f6e
793a
20746f206368616e6765
20226e6f
20656666
446563656d62657220
20696e746572616374696f6e73
206d6963726f
696f6e7320696e
207765726520756e
6b0a
20776173207369676e69666963616e74
20617420736f6d65
2070657269
2064657374726f79
785e7b
2053514c
0a0a2f2f
65726963
617472
77617266
5c6c656674285c667261637b
20696d706f7274616e6365
2c20736f2049
292e20
2062792053
4d73
6c7574696f6e
20696e207468652053
20746563686e6f6c6f67696573
6974792e0a0a
20746865206261636b
2061646a6163656e74
48657265206973
7320416374
2c2062757420
207265736964656e7473
20494949
6429
7665727469636573
2d6173
5e7b2d317d24
20657870656374
2073697a65206f66
2c20492068617665
73746f70
69636f6e
f6
303437
77656e7479
20617373
266e6273703b266e6273703b
20696e6a656374696f6e
696e79
6e69636b
202d2036
7973
2067656e6573
20612073
202855
73797374
6f6e69746f72696e67
207468656d20746f
20746f206576616c75617465
2061666665637420746865
20616e6420756e
7828
203d2076
2d2d2d2d2d2d2d2d2d2d2d2d2d2d2d2d
4631
3520616e64
6974792e
313135
206265747765656e
2075736564206279
31302c
32297d
6564206c696e65
766964656e6365
617a7a
6c616e642c
64656d6f67726170686963
7068656e
6578616d706c65
7b66
67656e6572616c
4173796e63
4469726563746f72
20746865206e6574776f726b
7d0a2020
2041726d79
61736b73
7a757265
7764
222043
72696f
2c20627574
2c20746f2074686520
20616e79206f66
20434f55
61756768746572
0a53
48656c70
2074656e64
20496e73746974757465
657374
20746865206f766572
556e64657220746865
3b206974
206465746563746f72
736372
20636c65616e696e67
20746869
2e2057686174206973
2064656e79
20666f722054
207769746820796f75
2c206f7220
7d2420
7265706f7274
697265
2e3537
32302d30
797374
5c667261637b5c7061727469616c
64646564
2073746172
206f75746572
20537461746573
297b2346
2068617070656e73
3025
72656d61696e646572207768656e
2065636f
4748
207365656d7320746f206265
207365727669636573
2032303132
616c63
20286f6e
204c6574
3d7b
206e696c
676773
3b205b
20627574206e6f74
63617262
2e3235
2074686174206d616b65
207468657261706575746963
20666f722074686520
2e0a0a332e
322e36
20686f
7d29
6c656374726f6e696320
3a2041
20616e616c79736973206f6620746865
2075702c
2043616c
2e3035
5320616e64
2069743f
656d20
20245c7b
20666f72207468656d
6e652c
2063617272696564206f7574
2e2050687973
207368652073616964
2e22202257
20726573756c7420696e
223a2022
696d706f7274
2c20302e
6f727461626c65
287a29
2c20313939
20636f6d6d6974
2063656c6c732077657265
6b24
227d
207368616c6c206265
69636b6572
206e6f74206265
4b4f
2e636f6d2e
5745
0a0a436f
2c20617320746865
616e6e61
76696577206f6620746865
77696b69
357d
7175
206669677572
5361696e74
2061736b6564
206c6576656c206f6620
6f27
207573652c
205044
0d0a202a
2056616c7565
6c7578
220a20202020202020
4f28
206175646974
206120736572696573206f66
0a0a59
20736572766573
20646f20
6e6461
20202020302e
627265616b696e67
2e72656164
426f6f6b
2066726f6d204d
7472616374696f6e
20616e642059
20736565206974
207468652070656f706c65
2829207b0a
20612067656e6572616c
2077696c6c
65617374
20c2
202265
20436174686f6c6963
3a0a09
20313530
206c656176696e67
52657475726e
2063656c6c206c696e6573
287229
2074686520626f
4e6174697665
546865204d
20526f6e
206163757465
656761
686574
20746865204575726f7065616e
454545
2054686f6d6173
7374656d
203637
416c
20546172
696e736f6e
0a09202a20
466f72206578616d706c65
7b7265662d747970653d22666967227d
325d2c
6d6b
207765656b73
206f6b
206d61796265
766172
20746865207472
20696e766573746967617465
545241
7374657273
323936
206d6964
3e207b
2d6265
20666f7220686572
27293b
20526576
0a0a70
205c3c20302e30
6d6174726978
20636f6d70
20696e206f7572
2c3078
7b55
48657265
726174696e67
7870
56657274
2c20736f6d65
73207b23736563
0a0a4920686176652061
62726f77
2042726f
207765726520746865
7275
323835
6672616d65776f726b
20636f6e667573
2073746f726d
54686520666f6c6c6f77696e67
207769746820697473
20746162
290d
20502e
2061207365636f6e64
6269616e
696e697469616c
2d73656e736f72732d
74696d
3031
333438
726f74617465
20666f7220796f7572
20626974
2e55
2d5c66726163
69616e67
5869
656420646f776e
7d0a0a2020
207468652066616365
20612066616d696c79
203244
65642066726f6d20
e289
207265667573656420746f
74726f7068
63696e65
20747269636b
3531
2835
2e0a0a427574
616c75
626572
20616e642047
69646573
73746174696e
2e2038
2077617320736f
5d2c205b404352
20636f6e636c75646564
2d3934
70726573736564
31342c
69766f
c382c282c383c2
2062696e64696e67
5f7b78
616d696465
636f6d70726f6d6973
7a61
5d205b
5c5b666967
20686176652073686f776e
426f6f6c65616e
4d4150
4256
2e5b4062
2e2220224f
696e672077
322d2d
20636f6e76696e6365
207761726e696e67
28782c
206e756c6c
6b65
206964656e746966696564
73206c65
2076656c6f636974
20686f74656c
70657274
206e6f6973
220a2020202020202020
20736179
205b40706f6e652e30
6c6c2e
61e2809973
73686f7073
6e656d
4438
20637570
0a536f6c766520
4f6e65206f6620746865
20746861742047
7072657373757265
6c6f72
506572736f6e616c
207365656d656420746f
273a2027
74696e65
20626174746c65
2a657420616c2e2a
6c7920756e
726f6e65
20646563656e74
732c0a
77616c6c
20666967757265
207375626a65637473
206c6576656c73206f6620
657474
20696d706c656d656e746564
206e69676874
73206174
737479
555249
204d657263
20746865206368616e6765
7b5c6d61746862667b
73746f
536c
20596f7572
636f6465
696374696f6e617279
204e6f2e
20746f6f206d756368
69616c
20657420616c2e20
206f6620616c6c
72656c696d696e617279
313029
65722073
204d696e6973746572
2c206d6f7374
412ec2a0
7967
63726f7373
75726f
43617465676f72
20556e6974656420537461746573
2028313939
207468652032
626f786573
20636f6e74696e75657320746f
20626c656e64
2e6564
207768656e2074
2061626f76652c
49442c
203031
250a0a
20746865207265616c
2048656172
2053
303131
72616365
0a20207b
20616374
20696e666f726d6174696f6e2e
772f
206d616368696e6573
6634
20416d6572696361
725f
20746f6e65
6c7265616479
6b656570
2c20692e652e2c
2061666669726d
20726571756972696e67
20706c75
652063
656c6567617465
207468696e6b206f66
2035
2073746972
63697465
207072696f72
206465
766f6c74
20696e66
7320697473
6e656e
70726f63
686b
20616e6420636f6d
3b0a2020202020202020202020
20416c
6f73
696e672f
5c6d7520
662f
666f726d6174696f6e
2062657374
2c20616e6420746f
6974616c
206f7065726174696f6e73
2074686520616374696f6e
20736c6f776c79
79206e6f74
57696c6c69616d
31332e
696c6974617279
6f6973
7468696373
332e35
68656d6973747279
676572
206d616b
20696e204d61
20626567616e20746f
207072696e746564
20526163
7370656369666963
d182
207265737472696374696f6e73
2072617465206f66
2c202a2a
20666c61766f72
69657320617265
20666163746f72
6c696d617465
20636172626f6e
5c706920
205c5b5b4052
206469737472
20666f6f64
323431
207468617420746865726520776173
416e616c79736973
20616e642068
64657465726d696e
207468652069646561
6e646572
7061727469636c65
313939
2e2220
c391c282
2829207b
687964726f
20746f20756e6465727374616e64
20657870616e64
2077616b65
4170706c69636174696f6e
61726174
642773
206f6e6520
322d
696e20746865
207461626c65
207363686564756c6564
20626f6e64
2053746174
327d
656c6c5f
5c71756164
20636f6d7061746962
2062792074686520
63617465676f7279
6f6d6572
20696e6469636174652074686174
642064
444e41
206c6f6f6b6564
206361706974616c
302c2031
5f6e616d65
696e67
0a0a4f6e65
0a606060
20666c69676874
2c207468
646d696e697374726174697665
292e676574
3073
2062616e6b73
616d656e74
5258
64617920
7222
756572
633a
546f646179
6666656374697665
6c696d6974
2073756d6d617279
476574
6772617068696373
2431
2064657461696c
65206465
204920646f6e2774
7d0a20
206164756c74
78202b20
20736f6369616c
207d7d
732c206f72
73205c5b5b4042
293b0a202020202020
2074686174207468657365
6f737420
206964656e7469666965642061
656e7420746f
6c6f6f
206f6e2046
20676f7420746865
20486177
7070656e646978
5c667261637b317d7b327d
207472616e73706c616e74
2073686f77732074686174
207472696564
2f6f
206d65616e73
657229
206571756976616c656e74
3a0a202020202020202020202020
577d
636f6d6d7574
6e6720
6f722074686174
203d2073656c662e
2041677265656d656e74
206d6f7265206c696b65
5574
206f66206f74686572
6874
2e696e
202d2035
20737475646965732068617665
204c6175
6573206173
207465726d696e6174
20656d706c6f796d656e74
666163
656c6976657279
737472756374697665
74686972642064657269766174697665
20536b
6c79696e67
732e20427574
20636f6e74616d696e
5c696e745f7b
3f22202257
20646f6e2774
20746f20697473
5342
4d2d
72616e74
e2809d206973
5b406233
206973206f6674656e
6f7262
7669736564
67756c6174696f6e
70696e
2062726f6b65
20616e6420696e
414345
20506c6174
312920
0a20202a
206d6f6e7468732c
204d6f6e74
20696e2c
2061206d6f7265
292062652074686520
20617070656172616e6365
202b2028
69646572
205c5b5b40706f6e652e30
5447
206265656e
206162736f7262
20796f75206e65656420746f
206d6f74696f6e20666f72
20756e6465722061
3541
732061626f757420746865
6e616d652c
7b0a
6268
20c397c2
486f7374
4f6c6976
8089
206120646966666572656e74
20776974682068696d
6f6d65747279
697665206f66
6c696573
2072656c6174657320746f
206265666f726520746865
20636f6f6b696e67
5f7b73
20686f70696e67
313929
4742
20746865206c
61727469636970616e7473
5f5354
20646f6c6c6172
2e202a2a
8520
7320676f
2c20696e636c7564696e6720
28696e7420
313532
7d0a202020202020202020202020
616c6c69
6e2d
636f6e6e
66656374696f6e
6e6575
696e6572
4c65742070
206964656e74696669
2070726f7370656374
206f6620756e
2e20416e6f74686572
206f66207468652045
20e2809c73
203c2d20
54686520617574686f7273
69736f6e
313739
65737472
706f70756c6172
6e6f2d
20757020
20412e
202828
616420
6974656d
61736b657462616c6c
20636861726765
206f7468
20746865206c69676874
20616e6420686173
50726f7065727479
d5
20726570726573656e74696e67
617373657274696f6e
20494e
686572656e6365
7320666f756e64
2061626f757420746f
20566f
307830
6329
20616c6c2d
6c6569
342e0a
392c
2e20466f7220
20776f756c642068617665206265656e
542c
7468656e
7d27
2062792045
2073656e736f72
20627566666572
20524e
20726567756c6174696f6e
343130
696e67206174
0a0a2e
4d20
206c65617365
504f5354
2070726f7065726c79
20706572736f6e616c
2c20706172
20616e73776572
207269736b20666163746f72
3e3c
2070726f7365637574
666563
204a696d
0a2f2a20
2c20616c6c
206661
20696e204e657720596f726b
6d2e0a
732026
7a696e67
207374616e64
20656e7669726f6e6d656e74616c
20626563617573
0a0a30
20737563682061732061
2e3238
72657475726e2028
452c
206d656e75
61206465
7376
4d69636861656c
7920746f
20706c616e6e6564
205269766572
20636974697a656e
287029
617573
20726570616972
204f63746f6265722031
2066696c6520
706963616c
5c6d6174686672616b
436f6e7374
20626c61636b20
626f72726f77
6c696e652c
6f776c
2069740a
20506f72
62616e6b
20746865206f6c64
20612077696465
2077656174686572
45766572
2c205374
2065786368616e67
5468652070
2c2073756767657374696e67
2c2074686579
6173616c
20656e64206f6620746865
6d6f6e
646f636b
303338
20617474656e74696f6e
20676f742061
206865726520666f72
2068696768657220
2062756666
2063616e20
41544520
2073706f74
4669727374
2073656573
2e20537562
2c20647572696e67
74656e616e74
7363616c65
313038
e28094
207363616e
20636f6e7374616e74
20776f726b657273
20636f6d706f6e656e74
2e2053686520776173
656d70
2063617468
4c65742068
706174686f6c6f676963
2e20616e64
74686579
323135
20636f6e7472696275746564
20636173652c20746865
202451
20696e746572657374
706f
20706f70756c6174696f6e
3b2042
206f66207468652049
20657175
7265666572656e6365
202620302e
656e61626c6564
5365727669636573
2c0a22
2d2028
20612074696d65
20486172
206172726976
546865204c
7047
20736f757468
20747261
2c70
3b0d0a20
20697420666f72
382f
796c65
7468
205265
6920696e
6c6c206265
2065787072657373
206d7573
2d2d34
2062656c6965766573
207363616c65
487e327e
0a3a
65642070
796f
7468657265
70696e67
2073747261746567
6f6365
656c7665
20746563686e
206b6e6f77
494e
28292c20
20696e76616c6964
646970
5073
20746865
207068656e6f6d656e
2055736572
20c2a0
6572736f6e
20746f206d616b652061
206c6f636174696f6e73
33292e20
20646565706c79
20612063617365
2074656d706f72
5c7369676d61
61776b
5d20
20286e6f
206d617468
732e222022
2773207265
5b305d
782f
656574
557365
7820616e64
20666c756f72
2a7e
2231
20627920616e
2073706172
206e6f7420736f
292420616e642024
20726174696f73
6e616d6573
6f70657261746f72
2e3237
676c7963
4d6f
303438
207769746820646966666572656e74
206475726174696f6e
2066756c6c2d
c390c2b2
656c73652069662028
616e6365206f6620746865
2420697320
43686172
206f6e20686572
206b6e6f7773
61636b73
20616c6c2074686520
666f637573
206f662074686520496e
20476c61
6a29
5c7573657061636b6167657b
206a7564676d656e74
20617320646573637269626564
20436861
526f62657274
2077657265207265
5c7269676874297d
204f4620
536561726368
6a756e6374696f6e
20736f6d6574696d6573
6174696f6e2e20
207461
20666f72206d6f7265
20247c
3c53
e8ae
20656173
206469736369706c696e65
2d2d2d2d2d2d2d2d2d2d2d2d2d2d2d0a
2076697369746f72
696374
2061732077656c6c2061732061
73656e7365
6172726f77
206576616c7561746520746865
20636f6e7472616374
4542
7520
0a20202020202a0a20202020202a20
4b6974
647563
204e6174696f6e
666c6f77
7320666f72
302e3031
696d6f
7175696e
2043656e74
7865
72696d
7373697374616e74
090909
206d65616e696e67
45787072657373696f6e
2046696e616c
6372797374616c6c
202d2032
696e672e
206f6620476f64
20646570656e64656e74
742066726f6d20
696f6e20666f72
240a
20646973636f7665726564
207265666c656374696f6e
206c6573736f6e
20706c61796572
5c2f
20736f206974
207365656e20696e
6f7a
6d706c656d656e74
333335
207175616e7469746174697665
5350
206275726e
613d
61646572
206f7665722031
20302e37
2068657265
2c20666f722061
2066656c74
28292e
6d756c
2077616e74656420746f
323438
206f6e6365
732073686f77
20696e636c
355e
2f2a2a
44656661756c74
676e6f73746963
7374643a3a
3d2d
5c5d2e
2062656c69657665
69e2809973
66696e64
6772616e756c
203a29
20746f2072756e
6976697479
2a49
2c20312c20
7072696365
20726573746f7265
20202043
0a0a36
20666163742074686174
207468656f72696573
205375706572
20616e696d
527d
74682d
e28099732061
3b2061
312e35
656e6572
616c20696e
2c20636f6e737420
70656e74
7d203d20
5f7b28
206775696c74
0a0a232323
4e2c
2d3335
20707265747479
417d
2065766964656e63652c
20686173
20283132
6f6e2c
20617420616e
207468656e
657175
20636f6d706172656420746f20
73746572
223e0a
20696e7665737469676174696f6e
486172
696e66
20436f70797269676874
612e20546865
313935
206164646564
656b
20696e2072
32202020
20636f6e6365726e696e67
6d65746164617461
626b
2050
5374756479
544152
2836
636164656d6963
20612067616d65
206c65742773
79206f6620
320a
732066726f6d2061
20436f6d
206465726976
207374617465642074686174
204a657773
206368726f6d
2f42
0a2d2d2d2d2d2d2d2d
5e7b6d
686973
2061732061
732061626f7574
207175616c6966696564
436f6e6e
202a29
20766172
6f6c2c
766972
6e756d6572
436f6e7374616e74
350a2020
70706c6963616e74
20736f6d65
496f
566f6c
6c696e656172
20636f6d6d6f6e6c79
2061637469766974696573
207375726661636573
20726962
20626520282d
466f7265
20776974682074686f7365
6d75746174696f6e
7265616c6973746963
4d61696e
203c2030
0d0a202020202020
64657363726962696e67
5570
6865696d
6f746963
6764
20647269
6b2f
204d616c
32290a
7b68
20746f2050
272c0a20202020
3c737472696e673e
736f75726365
6c79206173
6564206d
2e65
656c6c65
20696e7374656164
2062656e
2044616e
506c61696e7469666673
6c0a
4d52
206265
64756374
506c61696e74696666
29203d3e207b
204d696e69737472
20526f6164
20696e2074686520616273656e6365
5c7068695f
2020205c
6f6d62
206d65617375726564
d6
09090972657475726e20
206c656773
6b696c6c
2e20596f7572
20537472696e67
636f6d706574656e
63656e7472616c
6469726563746c79
3836
6d656e742c
207175616c697479
206f6666657273
6972656c657373
2070656c
574152
792050
302020
43697479
20746f20726564756365
7b0a0909090909
20776861742061
207269676874206e6f77
206f6e6c79206966
20616e64206e
61726f
e2809332
736571
20202034
20616c736f2068617665
6865616420616e64
20696e6a7572
2920616e64
6170
206d6178696d756d
6c69746572616c6c79
205469
20696e20697473
526f
696e6720746f2061
207468652070
204c6573
203532
2c20616e64207468656e
75616e
20636f6e74656e6473
4b61
312c303030
222d
2043656c6c
2070617274696573
206465636c617265
2e0a0a232323
2e20546865206669727374
7b52
205c6c6520
656c6967696f7573
20666c6578
2077696c6c2062652061
2e204272
6f6d696e616c
20746561
20757267
2072656672
64656c657465
0a0a3130
5f73746174
2073686f6f74696e67
3034
206c616964
2e3336
657465
6167
7365727669636573
506c616365
696e676572
7836
522043
62656174
2067726f777468
206261
204441
2862
20697320617661696c61626c65
202a
20636f6d706c69636174696f6e
2076616c7565206f6620
20736c6f77
207468652076616c7565
206d6174657269616c
20666f756e64
676c616e64
20636f6d62696e6174696f6e206f66
3e2028
3a3a
657220776173
5f7b
20726f746174
46726f6d
617465642c
636f72652e
206d61726b6564
32207965617273
2076616c7565206f6620746865
2072696768
6e616d6529
20612053
2e220a0a49
2061626f75742061
207368652773
61726d696e67
205052
7524
4649472e2031
203a3a
6f7273686970
203d2070
3063
65642062656361757365
206e756d62
2d6d6f64
737464
2838
313139
206d61792062652061
7669736974
20746865206465617468
76616e74
207765656b
52616e6765
20656475636174696f6e
436f6d6d6974
313937
293b0a202020207d0a
20706c61636520696e
206f7574707574
616d73
206964656e74697479
20636f6e73747261696e7473
2074696d652e20
20636f6d707269736573
2d7269676874
207374616b65
206c75
696f6c6f6779
6d6272
207365616c
70696e696f6e
2062656172696e67
6f6e6f
207468652063656c6c
29206973
63726f7373696e67
54756573646179
416e696d616c
496e206164646974696f6e20746f
20616c7465726564
2057696c6c69616d73
206f66206e6f6e
69636b6e657373
2c5c6c646f74732c
7061727469636c6573
68696e65
206974206f6e
63616e
7128
3c2f7370616e
7374616c
313136
206c6f7473206f66
e280a6
746f20
2420616e64
2074686520746f70
75616c20
746f78696e
365d2823
206f6e20686f77
20616d6f6e6720746865
494e46
424552
4c6574207573
7265616d696e67
54494d45
455354
3a3130
2c20686572
202475
2077697468206f6e65
20746869636b6e657373
20496e666f726d6174696f6e
20666f726d
206174746163686564
2e2e2f2e2e2f2e2e2f
4920616d206e6f74
34202d
20737563682074686174
20302030
5c7069
656d65
d0bed0
636f6e7369646572
20636f6e74726f6c
2076617269657479206f66
2077657265
2066726f6d206974
617270
206d65
425554
70617261746f72
3027
313132
206d61746368696e67
206f6620697473
204865616c7468
61746528
506c
205c706869
2061726561
d0b5d1
20227265
706f736974
206964656173
2842
696e673f
5769647468
20416d656e646d656e74
6135
7365637572697479
6d6174
497465
20746865207570
616666696c69617465
2c20696e20
2c202020
20616c6c6f776564
2e0a0a4b
642070
6564206c
2c202e
0972
2071756172746572
20776869
206e65656473
6174656420616e64
3d0a
696e672041
2c20776520617265
206d656e74616c206865616c7468
2063616e6e6f74206265
3c212d2d20
3131
6f2074
2d6e6f
247b
544553
2d696d
2069732077686174
3c6272
e280896d
20746f6e
206e65776c79
6a757374
2774
20666f756e6420696e
5741
4e6f
686f70
756d696e
302e37
7d0a
2074686520706f70756c6174696f6e
2074686520726567696f6e
20616c676f726974686d
206e756d626572
3d312c
20706572696f
206d617920
572e
7367
6c656f
206e6565642061
20696e636f72706f726174
617269
2a56
20e2809320616e64
29207c7c
64696d
20616e642048
206576656e20746865
20696e206661766f72206f66
2073656e74656e63696e67
43616c69666f726e6961
6c656d
6c7a
2a2f0d0a
2066756e6374696f6e2028
6c69706964
6974726f67656e
20646f6d696e617465
4229
5c5c0a
5472
20746865207461626c65
4368726f6d
6973636f76657279
2062792042
0a202020202f2f
2c203236
2a702a
706f72746564
6a6b
2068756e6472656473206f66
2061207370656369616c
20666f722074686f7365
7469726564
6c7920696e
2d43
2e3335
436170
206d656368616e6963616c
5b34
342e33
4a7d
7d2c0a09
206661726d6572
7468726565
2020202020202020202020202020
207761737465
69746174696f6e73
c2b620
4e55
616c65
313730
0a3d3d3d3d3d3d3d0a0a
20486f
206c656769736c6174
206d6978
206a757374
52545f
4d46
313737
706561
68616c66206f6620746865
2066696e64696e6773
2077656c6c20
3a2f
6368656d
6765726961
2063726974696369736d
20416d
0a20204d
2e2053756368
222920
732022
69676874206f6620746865
4749
67616c
73202a2f
4824
616c6973
656c6f
206f70656e6564
5620
20566f6c
7b42
2067726f7570
2d74696d65
303232
505245
312026
626f782e
6861726d61
20666163696c697479
696c6572
207265636f72646564
743e
20756e65
68617261637465726973746963
6420776173
323532
20696d6d756e6f
20636f6e736964657261626c65
6c696e652e
207c202a2a
2063686f73656e
290a20202020
626f6e65
3722
656e73697479
20707269766174
2020202020202020696e74
44657461696c
207175616e746974
65746963616c
2062656361757365207765
206d6f74696f6e
3b0a20202020202020207d0a20202020
690a
2e20496e2066616374
28290a0a
207375627374616e7469
3a2047
20637572
207468696e6b696e67
206164642061
4f42
20636c6f73656c79
3f0a3c
20636f6d6d6974746565
2b5c667261637b
2c2074686174206973
2c204c61
766572696679
2a2a32202b20
2773206a757374
20706c6174666f726d
7020
6c77
5c686174
5054494f4e
2048656e
6e2d31
5c2020202020202020202020
2073656c656374696f6e
20656c656374726f6e
5d28234d4f45534d
7468726f
205279
65696768746564
7320696e206f7264657220746f
62726577
fc
22202249
6e636c7573697665
7265616479
206d7973746572
65722077696c6c
206465636973
2c2043
20667572
6162
20506174
323734
2c204368696e
206966207468657265
5348
2070617469656e74732077686f
436f7374
7333
2077697468
5529
2066616365
206578616d696e65
2063616e20736565
2c20666f72206578616d706c65
3436
81
696666
20696e2056
54696d65
2c20736865
74726f
2074656d706572617475726573
20736f6c656c79
69736d
20696e7465677261746564
73205b
207075626c6973686564
27732053
2073747564696f
206f662076
415348
5e202020
0a3c2f
20696e666c616d6d61746f7279
204920646f6ee2809974
61726965
206f662077
2c0a
79206265
65737473
2222220a20202020
616e73
2070726f6265
20536570
3b0a0a2020202020202020
6172746963756c61726c79
2053656374696f6e
43414e
5c7769646574696c64657b
696e7428
2f2f2f
313536
2f2f
6772616d
206973207573656420746f
20706c616e6e696e67
204d69636861656c
72656e
67676572
5f4c4f
2074686520696d616765
6365617365
20466f7274
206c696573
2e3032
20746f6765746865722c
61636b696e67
20707572706f736573
206672616d65776f726b
20656d
206d6178696d
20612068
5e7b2a
6e203d20
3344
20616e797468696e67
20636865636b73
522a
207375727072697365
206f662022
202d31
206a65
20627275
20656c656d656e74
436f6e74657874
207365747570
2d726567756c6174
6c656164
20657863657373697665
2064657461696c73
2c2074
616c6c7920
61696e73
323933
293b0a20202020202020202020
6529
2074686520726573706f6e7365
50494e
20706c616e7473
0a0a2020
6f6361726469
352d
2072656164696e67
4243
206b6e6f776e206173
4c4c45
7369676e
686520696d706f7274616e6365206f66
206172677565732074686174
2d7374
496d61676573
74726963746c79
202464
20666f727468
20746865697220
206f757420746865
202473
667269656e646c79
6c616d
31393832
20546865
6632
726967687429
56616c756573
4e53
2073746f726564
20736d616c6c
33322e
2e205468652070
353035
20656c696d696e6174
6e756d5f
2074726164696e67
207468617420776173
652e0a0a
206665776572
206f70706f73
6c6573
7b48
20636f756e7473
206f75742c
2e20496e20706172746963756c6172
20707265636564
435e
2061206c697374206f66
5374696c6c
2066616972
20636f6f6b6965
20746f20616e6f74686572
206661696c6564
696e6720617420746865
446576696365
2053686f77
5528
6134
20746572726f72697374
2062792032
2060
524553
0a0a646566
65722c20616e64
2c20616464
636f6e7472616374
6172696e
5f7b5c6d75
4f7074
20686f7573696e67
6c796e
732034
693a
696d756c6174696f6e
3a2052
29202626
20746865206d617373
65722042
20436c
204d696b65
416e696d
3932
20657874726163746564
207374616e6461726473
4c454e
6f6c6574
616e7420616e64
6e677279
206973207265717569726564
73206f7220
2070726f6f66
20636f696e63696465
20284d
333229
544552
537472756374
20746865206a
207175616c
206f6666736574
2e0a0a0a0a
20746865206a757279
2069732c
203d2031
2e20496e64656564
7075626c69636c79
3b0a20207d0a0a2020
29206279
20706174686f67656e
20636972636c65
20706c6163656420696e
732e0a0a41
6c2e
2031303a
616768
c2a031
206f6e6c79206f6e65
207361696420696e
6720
203636
2062697264
67726170686963
20667269656e64
0a3230
206d616e79206f66
206e65617265737420746f20
6f726967696e616c
206578706c6f7369
20707265736964656e74
20c39720
20636f6f7264696e61746573
2068616e646c696e67
36
20666173746572
756c73
717561
206a757374696365
4368616d70696f6e
7b30
6f72696e67
2079617264
2e2e2e
68726f6e6963
206c6f77
2070617273
2e3338
20646973747269637420636f757274
2062757379
20610a
53746f7265
310a
82c3
206861766520746f
20776879
4f4d
2074686520796f756e67
0a7265
3c21
20746f207365
696e69
20636865657365
726576696577
7169
64202d20
6f7665722d
2e22202249742773
7565
617379
20736d616c6c6572
4352
726173
6b696e65
726368
20657374696d
292024
6162696c697479206f6620746865
20746f2070726f7665
6d65646961227d
20746865207269676874
726565206f66
686f73706974616c
20636f6e636c756465
697a6174696f6e2c
20776974682074686973
2063726577
2864
202d203130
205369
7b76
4e3d
57495448
5379
7370656369666963697479
20696e203138
2061726d79
65642069
63686172202a
6d6d79
5f7b5c616c706861
2065646765
504143
3c2f6469763e0a
206a757374206c696b65
20737461746963
20616e64204c
2e7275
20696e2074776f
2020202020202020202024
4472697665
6e6f63
457863657074696f6e
4775
e2809d29
6d79
5450
206c657373207468616e20
206b6e6f77696e67
49276c6c
696768746c79
43617374
74696d656f7574
647563696e67
5374617274
5d3b205b40
206f6e65206f6620746865206d6f7374
496e74657266616365
756d656e74
2e20427574206974
323238
696e666f726d617469
206173736573736564
35302d
48617665
2d66726565
2d45
7570736574
206173206c6f6e67206173
2e0a5265
2076696c6c61
20796f
7320746f2061
204c2e45642e326420
5f76616c
6f6c6c61626f726174696f6e
20687474703a2f2f
2077697468206974
20776869636820746865
5d2868747470733a2f2f
206427
2061737361756c74
70726f7065727479
343030
65722c20746865
3b0a0a20
73686f70
20666f7220616e79
696f7573
61746564
6d75
206d756368206d6f7265
5355
cebc67
696e656d61
206379636c
20796f757468
2061726973
204e75
20636f6e7665726765
7679
6463
69746973
205768656e
2070617373656e676572
206265696e67
64697374696e6775697368
20646966666572656e742066726f6d
20636f736d
63652e
5c6e6f74
20706f74656e7469616c
7468206f66
20646570656e64656e6365
69626572
20756e6974
2065766572797468696e67
636569766564
20686f757365686f6c64
204d6172
424954
436865636b
202241
65646c79
6c792075736564
6d4d
20746869733f
5652
20706c7573
2070726f706167
466163
206265666f72652061
2876616c7565
20776f6e64657266756c
20696e746572657374656420696e
732d3e
6174696f6e206f6e
2063617461
2073656564
757365756d
66756c6c
2e2220546865
6f6368
6c616e67
206e6f72
20657870616e73696f6e
2057617368696e67746f6e
732068617665
2b2d
2c2073616964
20d0
6966662773
6d656e74
730a20
34292e20
207468652064657369676e
333136
204c6f63616c
20746865207368
206f662065616368
d0b8
206973206c696b656c79
0a4f6e
204269626c
6e7469626f64696573
534f4e
72652d
204d6343
7320616e6420696e
2c2024
2066696c696e67
204775617264
0a46696e64
2a642a2a
206c6f636b
504543
206465736972
53656d
2e204d61796265
20746f2073686f772074686174
20746f2075
20436f6d6d
636c69636b
206d617474
20656e73757265
20617420612074696d65
03
6f6e73747261696e7473
313731
204344
2075736520746865
20706572636569766564
20617320616e
207761732061626c6520746f
69736820
20656c656374726f6e6963
205265736f75726365
72756c65
20736d616c6c20
414e44
5c5d2c
6361757365
20696e207468652062
2044616e69656c
6978
2e2048
616e67656c
75706f6e
20746865206f7574
7475616c
656420617420
2064656274
0a202a202020
204c7563
2c33
7462
20696e666c616d6d6174696f6e
204d617274696e
4c6172
6172696e67
5750
736369
737420
20616e616c79746963
2063656c6c756c6172
2067656e75696e65
425547
20746f2073
2077697468206f74686572
206368616e67
20612073696d696c6172
312a
202835
4563
686c
20706f6c696365
5c5d2e0a0a
20746865206a756467
637572736f72
20202020202020203c
6f6d
5c4f6d656761
2064656369646564
74686f756768
20686172646572
6f6d706c61696e74
207265616c6c7920
4d65616e
61726961
20776520617265
20776520736565
6c6f7264
5765646e6573646179
f3
28290a202020202020202020202020
457272
206578697374
2061626c6520746f
2042726f6f6b
307846
697479206973
736b61
2074686520666f6c6c6f77696e67
206469616772616d
3c6120687265663d22
554e54
20696e2074686973
74656e73
2e6c6f67
204c2e45642e3264
2e2047
2920202020202020
61726561
617070726f78
4541
6c6179
2079
3761
20736f2d63616c6c6564
2c63
4279
742072
2070757473
20696e74657276656e74696f6e73
206d75736963
20646567726565206f66
656420746f20746865
746175
2063616d70
676976656e
757220
2e2049742069732061
20416761696e
2074686520656e7669726f6e6d656e74
206d696c6c
2074686520617574686f72
2073746f72696573
2063686f6f73
7072657373
20646f6d61696e
67696c
206f7274686f
2826
206d65646963616c
204a65
2e204861
645d
312e36
2c20202020
2067726561746c79
3026
732074
204946
313330
2873656c662e
293b0a0a09
4c65742066
202878
203233
206669656c6473
207374756479696e67
2074686520636861726163746572
20666f72206d
5f5041
2c20686520776173
77696674
487e
203935
4765
2072656c6967696f6e
5e7b6e
20666f72
20616e6f7468657220
504b
220a202020
3a20302e
20477261
4b616d
20646f6e27742077616e74
6375
53616d
776564
20746f6765746865722077697468
5d5d
206475706c6963
53696465
696573
20636f6e647563
696464
57686174206973
206f76657272696465
527573736961
2e322e
20746f207368617265
204166746572
656e74616c
0a0a74
20646574656374
5f4449
4461746162617365
204a6577
696f6e6963
66696c6d
2d4c
20616e64207468656972
e2809331
6c6974
282d35
726570726573656e746174696f6e
6f7564
206d69786564
2061736b696e67
697a6174696f6e206f6620746865
20286865
495343
29290a
20697320616c7265616479
616d696e6f
73757266616365
436861726163746572
5d282346
20737461746564
63682c
2066696e616e6365
3333
222c0a2020202022
746f6f6c
2074696d65206f66
2074686520666f6c6c6f77
205745
2d646f
2e2e2f
2069742073686f756c64
6261
6c792c20616e64
2066726f6d20616c6c
0a4f
207061796d656e74
20686973746f726963
6d6269
4170
726f6f6d
70706c65
352c20
20482e
2c2026
245e7b
20617370656374206f66
20285c5b6571
20202020202020202020202020203130
456e676c697368
206f6e20686973
2e36
2069736e2774
4f564944
20432d
2074686520766172696f7573
66696369656e74
2c38
630a
746168
64696d656e
20766f6c756e746172
252c
206120706c616365
20636c696e6963
6469616e
20707572706f73
61746368696e67
20686f7720796f75
20506f776572
616d
726164696f
736561726368696e67
20616e64207472
292c0a2020
2073696d756c74616e656f7573
3865
2e204964
41646d696e
4146
2e3030
204c49
204c61626f72
222f3e
207468652061766572616765
707069
697373696e67
20e0a4
203d20303b0a
313233
652077657265
20696e207768696368
206f6e20697473
207573696e6720616e
67616d6d61
3f20546865
2076657279
206d69642d
7b24
6520696e746f
20666565646261636b
285b
5072
20736169642074686174
20776974682053
4665
202857
20686f726d6f6e
206172656ee2809974
2c2067
5430
206f66206f
73706563
2e20
345d5c5d
3c73756d6d6172793e
7320636f756c64206265
32303139
2073746f636b
2066696674
20666c6f
666f7277617264
20747970653d22
41726561
4134
20746563686e6f6c6f6779
6e2049
6564207573
5e61
7561
657220696e
3462
6d656d
4375
46696c6d
20696e74657270726574
5f4e
667573696f6e
6f2063
5c74657874
204c41
756d2e
20696e7374656164206f66
206f6620636172
20616666616972
20637269736973
20427261
20776520646964
2070726f70
207368616c6c
3139
3529
64616e
69612c
2e0a0a5768656e
2043617264
2c32
207269
20706c
2066696c6564
2073797374656d61746963
4447
746c65
e8a1
4e455353
2074696d6520616e64
207261646963616c
64756374697665
6d617468727366737d0a
68616c6f
6e6f6465
20686173206265656e
6f626f
206d6f7374206f66
222e20
20616464726573736564
4448
2067757973
2062617265
207468726f756768
206b696e64206f6620
61746572
20696e20313938
2c20616e64206f74686572
206772616e
2c2074686520
2062616e6473
4c6561
30202020
206f
206c696b6520616e
20202020202020202020202020202035
20746f2074
76696577206f66
5c0a2020202020202020
73756d696e67
20756e6976657273616c
4c696e65
207468652070726573656e6365
47494e
322e35
7920776173
68726566
2077616c6c
2c20412e
2066696c65642061
206120646972656374
656c6c696e67
626f64
206d656d6272616e65
6f7061
417474
206661766f72
3b0a0909
4e28
6379636c65
6f7365
2c202c
2c76
6361706974
666d
4f626a6563
7265717569
20696e766f6c76656d656e74
63686965
20746f2064697363757373
77697468
61746f6573
696e63696e
20726567617264696e6720746865
747269616e
7d2e2424
6127
22293b0a2020
323031
2073746f
6173652028
6c61756e6368
43686f
64657374726f79
20736f75676874
72696d696e616c
206b696e64206f66
646f77
206566666f727420746f
203f
20746f2064
6561
61746865
706879
20766567657461626c65
c391c280
4f6276
206465616c2077697468
206e65676c6967
66656c
656e73
333036
204349
474d
4459
626f6c64
206c6f6e672d
7664
6964656e
2074686520474e55
5c5b
5f636f756e74
636172626f
350a0a
206665656c696e6773
44
717561726b
73206f6e65
2062656e6368
636f6e7461696e73
204343
797468
206c6172676572207468616e
20496e7465726e6174696f6e616c20
290a3c
20616666696c696174
61747472
6f766572
57
207475726e6564
5f62
2077656e7420746f
726174697665
7377696e67
206f6e206120
5055
292028
20776f726c64
2c20736f
2074686520646966666572656e74
0a0a427574
2053656e
70726f62206f662073657175656e6365
757369
2e202e202e20
656d6f637261746963
77686174
657369646573
2d646570656e64656e74
636f6e73697374656e74
29207b0a2020202020202020
27732063
2072656d61696e6564
20646966666572656e74
206d656469
32202d20
2063617264696163
207468657265207761732061
20766172696f757320
2073756273657175656e74
7d293b0a
2061207365706172617465
207269736b73
20756e6465727374616e64696e67
20293b
5065746974696f6e
3c2f74723e0a
204665646572616c
6d2e
6573746174696f6e
28312d
733f0a0a
20746f20617373657373
3b0a090909
20415049
6c6f79
2070657263656e74616765
616e646f
2069732074727565
70726f66
6060
207472616e736974696f6e
206f7220736f6d65
206769
6d656e74206f6620746865
20746865206d6f64656c
3f22
204665627275617279
2e3037
20766f696365
204f72
20696e74657276696577
5b325d
206d617073
2068616972
6f7665722c
20686f77207765
54595045
206665656c206c696b65
2062726f7773
353038
20657863657074696f6e
20617761792066726f6d
20616e64207768656e
39202020202020202020202020202020
5b40435233
2050726f7465
596f752063616e
2c202d35
0a236966
206578747261
2070756e697368
20616e6420302e
20696e20686572
20686520646964
456e756d
20746f74616c6c79
2069662074686579
6769746875622e636f6d2f
206f6e2074686520
76617269616e6365
65642c20627574
20626567696e6e
657479
20646566696e6974656c79
657661
61727920
4d6174657269616c
313239
7769636b
736c616e64
206c617474696365
616c69676e6564
6237
756e63
20646520
6236
20696e74657273656374696f6e
2d746f2d
20263d20
7269616e
20436f756e74
5b32
333034
726573706f6e64696e67
0a20202020202072657475726e
742d3e
2061206e
204f666669636572
2073746174757465
20707265636973656c79
74756e
4c69737420746865207072
6f6262
20777269746572
466f7220746865
20746f2070726f76696465
4865616c7468
20696e20726563656e74
313336
207468652027
20706572666f726d696e67
222069643d22
29206f6620746865
2c20666f72206578616d706c652c
72657370656374
646a
6d62617373
20646566696e65
20737461636b
2065766964656e63652074686174
74696e656e74
736574
205c667261637b
0a0a4e
70202b20
7472616e73
206173736f63696174
2074686520656666656374
456e76
265c
2072656a656374
20506170
506f6c696379
5f627566
285c5b65713a
61727468
20746865206164
2f78
7c2d2d2d7c2d2d2d7c2d2d2d7c2d2d2d
65723a
206368726f6d6174
20666c6174
2072656d61696e73
20616e6e6f756e636564
6f6c66
343138
3d3d3d3d3d3d3d3d3d3d3d3d3d3d0a0a
7363
73656d626c65
20636f696e
2061742043
2054696d6573
20636f6d706c69636174696f6e73
84
0a24
4e6174696f6e616c
4641
2070726f626c656d2077697468
3f0a547275650a4973
2074686520616d6f756e74
566572
2061206368616e6365
20696e666572
2053797374656d2e
7362757267
20696e206164646974696f6e20746f
3e
e280a620
20736d6f6b696e67
2c20697420776f756c64
2e20e2809c546865
7d242e20546865
762f
292077697468
2c203137
497420776173
20696e204669672e
0a696e
6328
206c6974746c6520
2064697669646564
2068617665206d616465
3a204a
63656c6c
207265666572656e636520746f
202456
20636f6d6d656e
7320617265
6a616e
ea
27732073
6e6472
6d626c65
20737065616b
2064617461626173
0a09097d0a0909
5c4f6d6567615f
207b0a20202020202020202020
656d696e
6861707079
206465616c
3661
2074686174207468656972
6d6f6e64
20566963746f72
2d6578
206a6f75726e6579
6c696f
736f667477617265
2073696c656e63
20636f6d70726568656e73697665
5c6d617468
62696e64696e67
5c656e647b616c69676e65647d2424
20616c736f
203d2041
2073706f6e74
66657373696f6e
24245c626567696e7b616c69676e6564
20537461746520762e
2073747265616d
0a54
204175737472616c6961
70726f63657373
2e56
20736f20
0a20202020766172
6f2d
70617261626c65
7068616c
202854
544558
6174696f6e3a
2e452e326420
75726564
73746f72
20636f6e74726f6c73
446174
20746861742077657265
5351
20746865206d616e
207468652069
20666f722074686973
6e616d653d
4420616e64
756464656e6c79
4d49
20696e206f6e65
206f66203139
696e67207570
747920616e64
616c2063656c6c
697665
5f6672
20246e24
20706c61736d
74686573
204920646964
476f
2047696c
50726f62
697220
7374616c6c
32303033
7420746f
746d
206c69
7b5c626f6c6473796d626f6c7b
207061726b
20706f6c6963696573
2c20616e6420776173
6e6f6964
42696e64696e67
696e743332
756368
536563726574
2077686963682074686579
20612076
2073656e7369746976
207468652068756d616e
2048696c6c
20626f6f6b73
3e0a2020
72616e73616374696f6e
6963616c6c79
20666c6f6f72
20666f72206e6f
496e697469616c
0a0a546865726520617265
6e657273
3a2050
6e6978
706f7274696e67
4d4d
5333
20796f752077696c6c
20707265
636f6e73742063686172
63616d
6f7220e2809c
32303037
2032303131
62696c69
776f727468
2d746f
6964203d
6f6c74
204368696e61
20676172
207b0a
207468652065766964656e6365
2065616368206f74686572
6261636b
20656d707479
20746f206d6f7665
5570646174
2c20616e642074
4224
e1bb
332c2031
70726574
6f2073
616e7473206f66
52756e
4320616e64
20646562
20616c7465726174696f6e
5c64656c746120
207765206d6179
6770
75732061
6174696f6e2c
7b22
20696d706f7274616e74
20756e6365727461696e7479
313137
287729
206f726967696e616c6c79
2072656c69
5c7369676d615f
20486f757365
2077617320706572666f726d
373530
20677261766974
20646961676e6f736973206f66
20746f2061766f6964
2e0a0a556e
d984
28742c
2068656174696e67
2043454f
20626f6e6473
207369676e6174757265
206570697468656c69
32293b
20616e6420756e646572
20696e74657374696e
48652773
20686f70652074686174
34303030
7b50
7568
5f65
3f3f
6769
20666f726365
20746f6f6b20746865
207468652073746174757465
5444
85
71756974
64646c65
20616e6420686f77
20617272616e67656d656e74
6b696e64
727563
392f
20626c656564
4843
20746872656174
61637469766520
656420696e
65206469
2728
20466f6f64
5f312c20
20616e642037
20676f6f642c
6c6765627261
726f6e67
2074616b6520
0a47
485e
4d6f72
302e303529
2d3234
5c72696768747c
4131
732e20486f77657665722c
596f7572
382028
20746f2065737461626c697368
506172616d
31362e
206d657267
436f756e74
67726164
273b0a
206279206120
20627920
697374
20666f722033
6c6970
206a757279
20323a
2073746174696f6e73
2e20496e20746865
612062
585f7b
20746f206170706c79
20746865206a6f62
20646f7365
2061732077656c6c
206c6967
343238
2057617368
76616c75653e
2073706f7274
5031
736b
646966666572656e74
636570
20636f2d
732061726520746865
2050726f
207375707261
20616761696e73742061
2e2044617461
2070726f63657373
2f6d
20616e64206578
0a2d2d2d2d2d2d2d2d2d2d2d2d
7d0a7d0a
636f6d62
20737461746973746963616c6c79
2050726f706f736974696f6e
3265
72656c6174696f6e206265747765656e
6174696e672061
706872617365
2073697a6573
7e347e
200a
2873656c662c
7368697265
657266
206d656574696e67
20706c6174
69203d20
2066756e6e79
333030
5c766172
20283134
ae
746f776e
0a4c65742075
223a207b0a202020
6d22
757461626c65
325c
546f6b656e
20446972656374
20657370656369616c6c79
2e0a0a546f
2070657263656e74
706172656420746f
6f6e76656e74696f6e616c
4a534f4e
2061207072696d
2076616c7665
756c65
20696d6d756e65
72653e
20696e6469636174696f6e
204f68696f
3b0a696d706f7274206a6176
2d7370
77656172
68617264
35206d696e75746573
73756d6d617279
206368616d70696f6e
206472657373
2076657273696f6e206f6620746865
204369
636974696e67
20796f752c
2070756c6c
617273
203438
2a2f0a
204d2e
2e0a0a57686174
20646566656374
6d6e
313736
206e6f7420696e
342e31
2c0a2020202020202020202020202020
2e3233
20746865736520617265
206173
686f6d65
20636f6e76
656e6961
6d6f64656c696e67
6967617265747465
436c6173
507265
706c79
5047
20532e43742e20
207365
486173
444d
6f7869
7265736f75726365
3525
3e26
7469
206865617264
20666f6c6c6f7773
6f706566756c6c79
68656d69
696e6720706f696e74
20726567756c617465
696e677320616e64
2e0a0a4163636f7264696e6720746f
2e0a202a2f0a
352a
20726563656976
e28892302e30
536d
665c
4431
7b0a202020
20616e6420656e
2e0a202020202020
616775
207375627374697475
646174615f
207265666c656374
20696e2074686174
6f757473
226964
206665617475726573206f66
2074686520696e697469616c
20e289a5
79e2809973
2028696e636c7564696e67
2032303230
20612044
20417320
0a39
47726f757020
353530
2d2d2d2d2d2d2d2d2d2d2d2d2d2d0a0a
5b41
6564206265666f7265
286b29
303333
65e28099
20616c746572
82c282c383c283
5c72686f20
726f6c6c696e67
0a45
776173
76616c756529
57656c6c
5c6c6566742820
20696e68696269746f7273
20636f6d6d756e
206f662068697320
20436c696e6963
206578656d70
207468652056
20726563697065
2074696d65732c
207d0a
20747269616c73
6f75742c
206120636172
3029
20202020202020202020202020202027
6974657261746f72
20746f20736574
2030
3c2f68
20697320696d706f7274616e74
207075626c697368
3533
206c79
5c74657874726d7b
206f626a656374
63616c63
652c206f72
2e222022416e64
205344
206177617264
2c20492063616e
2073747564656e7473
6572732028
696c61
76617220
2e20536f6c766520
6f7269
7374617465
0a0a
2073657474696e6773
54686572652069732061
2061742053
323836
756f
6c7920636f6e
20636f756c642068617665
2031393939
6564206f766572
7d0a2d2d2d2d2d2d2d2d2d2d2d2d2d2d
5d5c5d2e0a0a
6c6574746572
616e7473
20636f686f7274
5c70
32303036
6469737061746368
7b40
6f6f6e
74686174
676e6572
5f64
20666f72206576657279
2720
20426f75
482c20
676f20
662c
20746f2073746179
56616c
20777269746573
20506c
20245b
5079
20246b
2070686f746f6e
5c6d6174686672616b7b
20666f7220616e
2066726f6d207768696368
20616e6e75616c
20747275
4c6970
313b20
61746f7279
53756368
6369
3220616e6420
206465636f
20706974
454420
5f74202a
54455354
73756363657373
3b0a09
207761732063
0a0a57697468
70726f78696d617465
20696e7369676874
20746869732073656374696f6e
20576f726c642057
20746865206c6f776572
2063656c6c732c
2d7265
506f736974696f6e
362e39
2063616d65
206d617070696e67
2b28
2063616c6c20746865
2028313937
206672657175656e74
2e0a53
20696c6c6567616c
6f67
206f7665722061
732072656d61696e
20616e642077686174
20636f6d626174
6e75
206973206c6f6361746564
6b20616e64
733e
434f4e54
292c0a
596f75277265
6f7765
6d6f6c6563756c6172
4f4e45
202434
20696e6475636564206279
0a616e
4d6174
5b315d2823
20737570706f72
666172
2e2043
20696e207468652041
6c656d656e74
282d3329
2243
7420696e
20726164696174696f6e
7472
4e43
62696e67
2068656172
20706f636b6574
636f756e746564
65642e20546865
20747970
7363656e64696e67206f72646572
32292c
272929
726565
20617373756d6564
205c3e
392e37
3e0a202020203c2f
2068756d
417070656c6c616e74
20746f20756e
636f6f7264
204c6f7320416e67656c6573
4d6f7265
2072656d6f7665
206561726e
2d7570
73616e
766965776572
20436f6c6c
6f6d70726568656e73697665
20666f756e6420746f206265
20612067
2073797374656d206f66
677565
2e204163636f7264696e6720746f
2063697479
706f6c6172697a6174696f6e
616666
0a0a5768656e
61726f6e
2077656172
206c6561726e
73206c696b65
20646966666572656e636520696e
7528
637265616d
5d0a20202020
415244
2c2077696c6c
2e2053696d696c6172
206e756d65726963616c
2074686f73652077686f
206120737562
2070726f76
5c5d29
70726f636573736f72
2070726573656e746564
627261636b
746563
207461786573
20646f776e20746f
2074686520656e64206f66
206f6620616c6c20746865
6c696572
20776f727279
616472
20486569
62617468726f6f6d
206861707069
4c65742077
76616c656e6365
2e0a0a46
72656e65
2a2a202020
656e5f
5f454e
20696e647563
2d6f6e65
206261746368
4532
5479706573
756b65
53696c766572
2e2042757420746865
206368726f6e6963
73656374696f6e
202e
207374726169676874
2022
537562
20746861742c
6f6d61676e65746963
73657274
657665
2e0a0a232323232323200a0a
20616e642056
69642e
5d3b0a
706173
4b2e
20676976656e206279
2420617265
5c6c6162656c7b65713a
6f7570
205472656174
2c204920776173
20776f727269
20534d
207175696574
20746861742048
2041727469636c65
206269727468
7375706572
206173736f6369617465
29206173
207265636570746f7273
